export interface Jargon {
    name: string
    alias?: string[]
    desc: string
    type: string[]
    /** 参考数据表 */
    ref?: string
}

export const jargonData: Jargon[] = [
    {
        name: "伤害",
        alias: ["狩月人"],
        desc: "伤害分为技能伤害和武器伤害; 技能伤害=角色攻击*(1+属性穿透)*技能倍率*(1+增伤+技能伤害)",
        type: ["伤害"],
    },
    {
        name: "狩月人之阶",
        alias: ["狩月人"],
        desc: "狩月人之阶的赛制分为分组赛和巅峰排名两个阶段。狩月人之阶活动开启后，会立刻开启分组赛阶段。分组赛阶段中，完成分组赛关卡挑战后会依据战斗表现结算积分，并且依据分组赛阶段的历史最高积分进行分组。分组赛阶段结束时会依据所在的分组进行奖励结算。分组赛阶段结束后，会立刻开启巅峰排名阶段，狩月人小队完成巅峰排名关卡挑战后会依据战斗表现结算积分，并且依据巅峰排名阶段的历史最高积分进行组内排名。巍峰排名关卡挑战需要消耗小队邀请函才能进行，同时也会依据每次挑战结算的积分获得一定数目的狩月纪念币。狩月纪念币可用于在排名商店中换商品，部分商品会随着巅峰排名阶段的历史最高积分解锁。",
        type: ["活动"],
        ref: "raid",
    },
    {
        name: "收获日",
        desc: "活动期间，夜航手册中的委托每天将有6次奖励提升的加成，该加成可与委托手册叠加，此时开始委托，将获得更多的委托奖励。活动期间每天可挑战1次限时魔之楔委托。夜航手册中的每个魔之楔相关委托都对应一个限时魔之楔委托，号令者会大量出现在限时魔之楔委托中。挑战次数和奖励加成次数无法跨日积累，次日将全部清空。",
        type: ["活动"],
    },
    {
        name: "委托手册",
        alias: ["金书", "紫书", "蓝书", "绿书"],
        desc: "使用该道具可以增加副本奖励数量, 每个副本或每个无尽波次只能选择一张 根据品质加成不同 金色到绿色分别额外增加20,8,2,1倍掉落, 该道具可以通过4个低级合成高级 如4紫书合成1金书",
        type: ["物品", "道具", "消耗品"],
        ref: "resource",
    },
    {
        name: "魔之楔",
        alias: ["MOD"],
        desc: "角色和武器可装备的一种装备 角色可以装备8个普通魔之楔和一个羽蛇系列魔之楔 武器可以装备8个 同律武器只能装备4个 可以升级提高属性 一般可以+5 金色魔之楔可以通过消耗1,1,2,2,3个指定魔之楔继续升级到+10",
        type: ["物品", "装备"],
        ref: "mod",
    },
    {
        name: "专属魔之楔",
        alias: ["专属MOD"],
        desc: "部分属性限定的魔之楔系列: 暗=审判者 水=巨鲸 火=焰灵 风=黄衣 光=金乌 雷=夜使",
        type: ["物品", "装备"],
        ref: "mod",
    },
    {
        name: "专武",
        alias: ["角色专武"],
        desc: "指和限定角色一起登场的武器 一个角色只有一把 但不代表这把武器只有该角色可以用; 兰迪=慧谋的攻守 西比尔=不渝的梦海 丽蓓卡=塞王的拥吻 妮弗尔夫人=茵布拉花序 赛琪=希冀的丰稔 菲娜=织梦的白羽 扶疏=泽世的慈雨 刻舟=若华的飞光 止流=万古的诀别 煜明=罪愆的逆鳞 ",
        type: ["武器", "装备"],
        ref: "weapon",
    },
    {
        name: "限定角色",
        desc: "指初次在沉浸式戏剧登场的角色 戏剧只给65个密函 需要等戏剧结束后进周本才可以刷取 限定角色顺序: 赛琪, 菲娜, 扶疏, 刻舟, 止流, 煜明",
        type: ["武器", "装备"],
        ref: "weapon",
    },
    {
        name: "密函",
        alias: ["核桃"],
        desc: "通过密函副本可以开出奖励  机制: 从每个奖励的随机范围抽取n个该种奖励后加入到奖励序列, 打乱后在序列结尾放置金奖励, 重复抽取直到抽出金后重置序列 ",
        type: ["道具"],
        ref: "walnut",
    },
    {
        name: "梦魇残声",
        alias: ["周本"],
        desc: "指每周限定5次的特殊BOSS, 俗称周本, 其奖励会定期更换",
        type: ["副本"],
        ref: "hardboss",
    },
    {
        name: "夫人",
        desc: "指角色妮弗尔夫人",
        type: ["角色"],
        ref: "char",
    },
    {
        name: "军团长",
        desc: "指角色海尔法",
        type: ["角色"],
        ref: "char",
    },
    {
        name: "垃圾妹",
        desc: "指角色玛尔洁",
        type: ["角色"],
        ref: "char",
    },
    {
        name: "猪妹",
        alias: ["猪"],
        desc: "指角色松露与榛子 因为技能都和猪有关",
        type: ["角色"],
        ref: "char",
    },
    {
        name: "蝶妹",
        alias: ["蝶"],
        desc: "指角色赛琪",
        type: ["角色"],
        ref: "char",
    },
    {
        name: "女枪",
        desc: "指角色琳恩",
        type: ["角色"],
        ref: "char",
    },
    {
        name: "水母",
        desc: "指角色丽蓓卡 也可能是她的召唤物",
        type: ["角色", "技能", "召唤物"],
        ref: "char",
    },
    {
        name: "触手",
        desc: "指角色塔比瑟 也可能是她的召唤物",
        type: ["角色", "技能", "召唤物"],
        ref: "char",
    },
    {
        name: "栗子",
        desc: "指角色莉兹贝尔",
        type: ["角色"],
        ref: "char",
    },
]
