export interface MonsterTag {
    id: string
    name: string
    desc: string
    vars: MonsterTagVars
}

export interface MonsterTagVars {
    伤害类型?: string[]
    加成?: Record<string, number>
    受击类型?: string
    [key: string]: any
}

export const monsterTagData: MonsterTag[] = [
    {
        id: "Mon.Strong.Blood",
        name: "猩红 号令者",
        desc: "“号令者”是敌人中拥有号令者能力的强大个体。\n猩红 号令者每隔一段时间在自身周围生成3片[腐坏沼泽]。\n[腐坏沼泽]：范围内的敌对目标受到持续伤害，范围内的友方目标持续回复生命值。",
        vars: {
            间隔时间: 10.0,
            持续时间: 10,
            最大召唤数量: 3,
            每次召唤数量: 3,
            召唤延迟: 2,
            BUFF持续: 0.5,
            DOT伤害: 0.3,
            DOT间隔: 2,
            伤害类型: ["Dot", "PhantomAvoid", "Blood"],
            HOT回复: 0.02,
            HOT间隔: 2,
            飞行速度: 600,
            命中延迟: 2,
        },
    },
    {
        id: "Mon.Strong.Burst",
        name: "爆破 号令者",
        desc: "“号令者”是敌人中拥有号令者能力的强大个体。\n爆破 号令者每隔一段时间以自身为中心引发爆炸，击飞周围的敌对目标。",
        vars: {
            间隔时间: 13,
            预警延迟: 2.5,
            伤害倍率: 0.65,
            伤害类型: ["PhantomAvoid", "Burst"],
            半径: 400,
            削韧值: 100,
            受击类型: "HitFly_XY500Z1000",
        },
    },
    {
        id: "Mon.Strong.Burst.Double",
        name: "爆破 号令者",
        desc: "“号令者”是敌人中拥有号令者能力的强大个体。\n爆破 号令者每隔一段时间以自身为中心引发爆炸，击飞周围的敌对目标。",
        vars: {
            间隔时间: 5,
            预警延迟: 2.5,
            伤害倍率: 0.65,
            伤害类型: ["PhantomAvoid", "Burst"],
            半径: 400,
            削韧值: 100,
            受击类型: "HitFly_XY500Z1000",
        },
    },
    {
        id: "Mon.Strong.Burst.Triple",
        name: "爆破 号令者",
        desc: "“号令者”是敌人中拥有号令者能力的强大个体。\n爆破 号令者每隔一段时间以自身为中心引发爆炸，击飞周围的敌对目标。",
        vars: {
            间隔时间: 5,
            预警延迟: 2.5,
            伤害倍率: 0.65,
            伤害类型: ["PhantomAvoid", "Burst"],
            半径: 400,
            削韧值: 100,
            受击类型: "HitFly_XY500Z1000",
        },
    },
    {
        id: "Mon.Strong.Fade",
        name: "枯萎 号令者",
        desc: "“号令者”是敌人中拥有号令者能力的强大个体。\n枯萎 号令者每隔一段时间从自身周围发射3条[枯萎射线]：持续10秒，且持续旋转，对命中的敌对目标造成伤害并削减目标神智。",
        vars: {
            间隔时间: 15,
            预警延迟: 0.2,
            持续时间: 12.5,
        },
    },
    {
        id: "Mon.Strong.Frozen",
        name: "凛霜 号令者",
        desc: "“号令者”是敌人中拥有号令者能力的强大个体。\n凛霜 号令者被远程武器攻击命中时，向攻击来源发射冰锥，命中敌对目标时造成伤害并附加1层[减速]：降低攻击速度和移动速度，持续3秒，最多叠加5层。",
        vars: {
            飞行速度: 1500,
            持续时间: 5,
            追踪速度: 100,
            追踪范围: 150,
            伤害倍率: 0.1,
            伤害类型: ["PhantomAvoid"],
            BUFF持续: 3,
            时间膨胀倍率: 0.96,
            最大层数: 5,
        },
    },
    {
        id: "Mon.Strong.IceOrb",
        name: "霜狱 号令者",
        desc: "“号令者”是敌人中拥有号令者能力的强大个体。\n霜狱 号令者每隔一段时间在敌对目标脚下生成[霜狱]：减速范围内的目标，持续2.5秒后爆炸，对范围内的敌对目标造成伤害。",
        vars: {
            间隔时间: 10,
            技能作用距离: 2500,
            持续时间: 4,
            最大召唤数量: 8,
            每次召唤数量: 1,
            BUFF持续: 0.5,
            时间膨胀倍率: 0.5,
            伤害倍率: 0.65,
            伤害类型: ["PhantomAvoid", "IceOrb"],
        },
    },
    {
        id: "Mon.Strong.Kamikaze",
        name: "舍身 号令者",
        desc: "“号令者”是敌人中拥有号令者能力的强大个体。\n舍身 号令者被击败时产生爆炸，对范围内的敌对目标造成伤害。",
        vars: {
            飞行速度: 0,
            持续时间: 5,
            生效延迟: 2.5,
            半径: 400,
            伤害倍率: 0.65,
            伤害类型: ["PhantomAvoid"],
            受击类型: "LightHit",
            削韧值: 200,
        },
    },
    {
        id: "Mon.Strong.Poison",
        name: "侵蚀 号令者",
        desc: "“号令者”是敌人中拥有号令者能力的强大个体。\n侵蚀 号令者每隔一段时间在脚下生成一滩[毒液]：降低站在[毒液]内的敌对目标的防御，并对目标造成持续伤害。\n此外，侵蚀 号令者存活期间会增加血清降低速度。",
        vars: {
            间隔时间: 10,
            持续时间: 10,
            最大召唤数量: 15,
            每次召唤数量: 1,
            召唤延迟: 3,
            BUFF持续: 0.5,
            加成: {
                防御: -0.9,
            },
            DOT伤害: 0.1,
            DOT间隔: 2,
            伤害类型: ["Dot", "PhantomAvoid", "Poison"],
        },
    },
    {
        id: "Mon.Strong.Poison.Double",
        name: "侵蚀 号令者",
        desc: "“号令者”是敌人中拥有号令者能力的强大个体。\n侵蚀 号令者每隔一段时间在脚下生成一滩[毒液]：降低站在[毒液]内的敌对目标的防御，并对目标造成持续伤害。\n此外，侵蚀 号令者存活期间会增加血清降低速度。",
        vars: {
            间隔时间: 5,
            持续时间: 10,
            最大召唤数量: 15,
            每次召唤数量: 1,
            召唤延迟: 3,
            BUFF持续: 0.5,
            加成: {
                防御: -0.9,
            },
            DOT伤害: 0.1,
            DOT间隔: 2,
            伤害类型: ["Dot", "PhantomAvoid", "Poison"],
        },
    },
    {
        id: "Mon.Strong.Poison.Triple",
        name: "侵蚀 号令者",
        desc: "“号令者”是敌人中拥有号令者能力的强大个体。\n侵蚀 号令者每隔一段时间在脚下生成一滩[毒液]：降低站在[毒液]内的敌对目标的防御，并对目标造成持续伤害。\n此外，侵蚀 号令者存活期间会增加血清降低速度。",
        vars: {
            间隔时间: 5,
            持续时间: 10,
            最大召唤数量: 15,
            每次召唤数量: 1,
            召唤延迟: 3,
            BUFF持续: 0.5,
            加成: {
                防御: -0.9,
            },
            DOT伤害: 0.1,
            DOT间隔: 2,
            伤害类型: ["Dot", "PhantomAvoid", "Poison"],
        },
    },
    {
        id: "Mon.Strong.Reflect",
        name: "残火 号令者",
        desc: "“号令者”是敌人中拥有号令者能力的强大个体。\n残火 号令者每隔一段时间为自己附加持续2.5秒的[残火状态]：若在持续时间内受到伤害，结束该状态并产生爆炸，对范围内的敌对目标造成伤害。",
        vars: {
            间隔时间: 7,
            BUFF持续: 2.5,
            伤害倍率: 0.65,
            伤害类型: ["PhantomAvoid", "Reflect"],
            半径: 400,
            受击类型: "LightHit",
        },
    },
    {
        id: "Mon.Strong.Reflect.Double",
        name: "残火 号令者",
        desc: "“号令者”是敌人中拥有号令者能力的强大个体。\n残火 号令者每隔一段时间为自己附加持续2.5秒的[残火状态]：若在持续时间内受到伤害，结束该状态并产生爆炸，对范围内的敌对目标造成伤害。",
        vars: {
            间隔时间: 6,
            BUFF持续: 2.5,
            伤害倍率: 0.65,
            伤害类型: ["PhantomAvoid", "Reflect"],
            半径: 400,
            受击类型: "LightHit",
        },
    },
    {
        id: "Mon.Strong.Reflect.Triple",
        name: "残火 号令者",
        desc: "“号令者”是敌人中拥有号令者能力的强大个体。\n残火 号令者每隔一段时间为自己附加持续2.5秒的[残火状态]：若在持续时间内受到伤害，结束该状态并产生爆炸，对范围内的敌对目标造成伤害。",
        vars: {
            间隔时间: 6,
            BUFF持续: 2.5,
            伤害倍率: 0.65,
            伤害类型: ["PhantomAvoid", "Reflect"],
            半径: 400,
            受击类型: "LightHit",
        },
    },
    {
        id: "Mon.Strong.Revenge",
        name: "复仇 号令者",
        desc: "“号令者”是敌人中拥有号令者能力的强大个体。\n复仇 号令者被击败时为附近的友方目标附加[强力]：提高攻击力、防御、移动速度和攻击速度，持续20秒。",
        vars: {
            BUFF持续: 20,
            最大层数: 3,
            加成: {
                防御: 0.5,
                攻击: 0.5,
                技能速度: 0.4,
                移动速度: 0.4,
            },
        },
    },
    {
        id: "Mon.Strong.Shield",
        name: "守护 号令者",
        desc: "“号令者”是敌人中拥有号令者能力的强大个体。\n守护 号令者每隔一段时间在以自身为中心召唤[守护立场]：持续9秒，阻挡所有命中立场的敌对子弹和飞行物。",
        vars: {
            间隔时间: 15,
            持续时间: 9,
            最大召唤数量: 1,
            每次召唤数量: 1,
        },
    },
    {
        id: "Mon.Strong.Threefold",
        name: "掠影 号令者",
        desc: "“号令者”是敌人中拥有号令者能力的强大个体。\n掠影 号令者进入战斗后召唤2个[幻影]：受到的伤害提高，与召唤者的战斗技能相同。",
        vars: {
            伤害加成倍率: 1.5,
            BUFF持续: -1,
        },
    },
    {
        id: "Mon.Strong.Thunder",
        name: "霹雳 号令者",
        desc: "“号令者”是敌人中拥有号令者能力的强大个体。\n霹雳 号令者每隔一段时间以自身为中心向周围发射[电球]：每隔0.5秒对小范围内的敌对目标释放电流造成伤害，受到攻击后消失。",
        vars: {
            间隔时间: 5,
            预警延迟: 2.5,
            持续时间: 1,
            伤害间隔: 0.5,
            伤害倍率: 0.1,
            伤害类型: ["PhantomAvoid"],
            半径: 200,
        },
    },
    {
        id: "Mon.Strong.ThunderLaser",
        name: "转雷 号令者",
        desc: "“号令者”是敌人中拥有号令者能力的强大个体。\n转雷 号令者每隔一段时间在自身周围生成多个[雷狱]：持续旋转，对命中的敌对目标造成伤害。",
        vars: {
            间隔时间: 10,
            持续时间: 10,
            最大召唤数量: 8,
            每次召唤数量: 6,
            伤害倍率: 0.4,
            伤害类型: ["PhantomAvoid", "ThunderLaser"],
            半径: 50,
        },
    },
    {
        id: "Mon.Strong.ThunderLaser.Double",
        name: "转雷 号令者",
        desc: "“号令者”是敌人中拥有号令者能力的强大个体。\n转雷 号令者每隔一段时间在自身周围生成多个[雷狱]：持续旋转，对命中的敌对目标造成伤害。",
        vars: {
            间隔时间: 12,
            持续时间: 10,
            最大召唤数量: 8,
            每次召唤数量: 6,
            伤害倍率: 0.4,
            伤害类型: ["PhantomAvoid", "ThunderLaser"],
            半径: 50,
        },
    },
    {
        id: "Mon.Strong.ThunderLaser.Triple",
        name: "转雷 号令者",
        desc: "“号令者”是敌人中拥有号令者能力的强大个体。\n转雷 号令者每隔一段时间在自身周围生成多个[雷狱]：持续旋转，对命中的敌对目标造成伤害。",
        vars: {
            间隔时间: 12,
            持续时间: 10,
            最大召唤数量: 8,
            每次召唤数量: 6,
            伤害倍率: 0.4,
            伤害类型: ["PhantomAvoid", "ThunderLaser"],
            半径: 50,
        },
    },
    {
        id: "Mon.Strong.Vampire",
        name: "浴血 号令者",
        desc: "“号令者”是敌人中拥有号令者能力的强大个体。\n浴血 号令者造成伤害时，为自身回复生命值。",
        vars: {
            吸血比例: 0.02,
        },
    },
]

export default monsterTagData
