export interface QuestList {
    id: number
    quests: QuestItem[]
}

export interface QuestItem {
    id: number
    dialogues: Dialogue[]
}

export interface Dialogue {
    id: number
    content: string
    npc?: number
}

export const questData: QuestList[] = [
    {
        id: 100101,
        quests: [
            {
                id: 10010101,
                dialogues: [
                    {
                        id: 10018701,
                        content: "——“我是谁？”",
                        npc: 100001,
                    },
                ],
            },
            {
                id: 10010103,
                dialogues: [
                    {
                        id: 10010101,
                        content: "贝蕾，我……",
                        npc: 100001,
                    },
                    {
                        id: 10029301,
                        content: "无数次，螺旋般往复的梦中，我一遍又一遍地问着。",
                        npc: 100001,
                    },
                    {
                        id: 10018401,
                        content: "回答我的，只有不尽流泻的无垠白沙；以及……",
                        npc: 100001,
                    },
                    {
                        id: 10018402,
                        content: "{性别：她|他}。",
                        npc: 100001,
                    },
                ],
            },
            {
                id: 10010104,
                dialogues: [
                    {
                        id: 10025704,
                        content: "因为我们平静的生活，早已被秽兽的利爪撕碎……",
                    },
                    {
                        id: 10025701,
                        content: "这场逃亡，是从那场奇异的梦开始的；从小到大，我一直重复着相似的梦。",
                    },
                    {
                        id: 10025702,
                        content: "但不容回想，我知道此刻有更急迫的事——",
                    },
                    {
                        id: 10025703,
                        content: "必须和贝蕾妮卡一起逃离这座叫做“净界岛”的小岛，即使这是我们一起长大的地方。",
                    },
                    {
                        id: 10010112,
                        content: "慢慢来。",
                        npc: 100003,
                    },
                ],
            },
            {
                id: 10010105,
                dialogues: [
                    {
                        id: 10010113,
                        content: "当心脚下，不要踩空。",
                        npc: 100003,
                    },
                    {
                        id: 10010114,
                        content: "你的伤还没好吧，要不要紧？",
                        npc: 100003,
                    },
                    {
                        id: 10010115,
                        content: "早就没事了，区区几道沟而已。",
                        npc: 100001,
                    },
                    {
                        id: 10010116,
                        content: "别逞强。不要还没遇到秽兽，先用光了力气。",
                        npc: 100003,
                    },
                    {
                        id: 10010114,
                        content: "你的伤还没好吧，要不要紧？",
                        npc: 100003,
                    },
                    {
                        id: 10010115,
                        content: "早就没事了，区区几道沟而已。",
                        npc: 100001,
                    },
                    {
                        id: 10010116,
                        content: "别逞强。不要还没遇到秽兽，先用光了力气。",
                        npc: 100003,
                    },
                ],
            },
            {
                id: 10010107,
                dialogues: [
                    {
                        id: 10019007,
                        content: "（……我们现在赤手空拳，得尽量避开秽兽。）",
                        npc: 100001,
                    },
                    {
                        id: 10019005,
                        content: "（……我们现在赤手空拳，得尽量避开秽兽。）",
                        npc: 100001,
                    },
                    {
                        id: 10019006,
                        content: "还差一点……家就在前面了。",
                        npc: 100003,
                    },
                    {
                        id: 10019001,
                        content: "村子里什么人声都没有，恐怕他们已经……",
                        npc: 100003,
                    },
                    {
                        id: 10019002,
                        content: "……！！",
                        npc: 100001,
                    },
                    {
                        id: 10019003,
                        content: "……我的意思是，他们大多应该乘船逃走了。",
                        npc: 100003,
                    },
                    {
                        id: 10019004,
                        content: "抓紧回家拿到武器，然后去码头吧。这里现在还很危险。",
                        npc: 100003,
                    },
                    {
                        id: 10019005,
                        content: "（……我们现在赤手空拳，得尽量避开秽兽。）",
                        npc: 100001,
                    },
                    {
                        id: 10019006,
                        content: "还差一点……家就在前面了。",
                        npc: 100003,
                    },
                ],
            },
            {
                id: 10010109,
                dialogues: [
                    {
                        id: 10010601,
                        content: "走，去码头。",
                        npc: 100003,
                    },
                    {
                        id: 10010701,
                        content: "啧，他们还真是……一条船都没剩下。",
                        npc: 100003,
                    },
                    {
                        id: 10010702,
                        content: "秽兽来的时候，你还在村子里吧？如果不是折回去找我，你本可以一起逃走的。",
                        npc: 100001,
                    },
                    {
                        id: 10010703,
                        content: "别说蠢话，换你在这儿也一样。我们先沿着海岸找找有没有旧一些的船。",
                        npc: 100003,
                    },
                ],
            },
            {
                id: 10010111,
                dialogues: [
                    {
                        id: 10010801,
                        content: "这是……大家逃跑时落下的吗？",
                        npc: 100001,
                    },
                    {
                        id: 10010802,
                        content: "嗯，带上吧，多做些准备总是好的。",
                        npc: 100003,
                    },
                ],
            },
        ],
    },
    {
        id: 100102,
        quests: [
            {
                id: 10010201,
                dialogues: [
                    {
                        id: 10011001,
                        content: "又有秽兽过来了……",
                        npc: 100003,
                    },
                    {
                        id: 10011002,
                        content: "{nickname}，等下不要离我太远。必要的话，就用我们的暗号。",
                        npc: 100003,
                    },
                    {
                        id: 10011003,
                        content: "还记得吗？之前上山时为了不惊动野兽约定的暗号。",
                        npc: 100003,
                    },
                    {
                        id: 10011004,
                        content: "当然。",
                        npc: 100001,
                    },
                    {
                        id: 10011005,
                        content: "嗯，我再确认一遍。轻拍右肩两下的意思是？",
                        npc: 100003,
                    },
                    {
                        id: 10011006,
                        content: "“留意身后。”",
                        npc: 100001,
                    },
                    {
                        id: 10011007,
                        content: "轻敲心口两次的意思是？",
                        npc: 100003,
                    },
                    {
                        id: 10011008,
                        content: "“靠过来。”",
                        npc: 100001,
                    },
                    {
                        id: 10011009,
                        content: "轻轻刮一下鼻梁是？",
                        npc: 100003,
                    },
                    {
                        id: 10011010,
                        content: "“已经没事了。”",
                        npc: 100001,
                    },
                    {
                        id: 10011011,
                        content: "好。最后一个——连续眨眼三次是？",
                        npc: 100003,
                    },
                    {
                        id: 10011012,
                        content: "……我忘了。",
                        npc: 100001,
                    },
                    {
                        id: 10011013,
                        content: "记住，连续眨眼三次的意思是——",
                        npc: 100003,
                    },
                    {
                        id: 10011014,
                        content: "别说了，我不感兴趣，说了也记不住的。",
                        npc: 100001,
                    },
                    {
                        id: 10011015,
                        content: "……唉。",
                        npc: 100003,
                    },
                ],
            },
            {
                id: 10010205,
                dialogues: [
                    {
                        id: 10011401,
                        content: "一路向上走到山顶，那里以前有一架飞艇。如果它还在，我们就有机会离开这里。",
                        npc: 100003,
                    },
                    {
                        id: 10011301,
                        content: "钥匙就是……这把剑？",
                        npc: 100001,
                    },
                    {
                        id: 10011302,
                        content: "嗯，你的剑从来不是伤人用的。",
                        npc: 100003,
                    },
                ],
            },
            {
                id: 10010207,
                dialogues: [
                    {
                        id: 10025801,
                        content: "这些秽兽……死了？",
                        npc: 100001,
                    },
                    {
                        id: 10025802,
                        content: "看来在我们之前，这里就有人和秽兽战斗过。而且，还没过去太久。",
                        npc: 100003,
                    },
                    {
                        id: 10025803,
                        content: "难道有村民逃到了这里……不，那扇门是我们打开的才对。",
                        npc: 100001,
                    },
                    {
                        id: 10025804,
                        content: "不过好在有他帮忙清理，否则秽兽就更难对付了。",
                        npc: 100001,
                    },
                    {
                        id: 10025805,
                        content: "无论是谁，他的实力都不容小觑。我们也要留心。",
                        npc: 100003,
                    },
                ],
            },
            {
                id: 10010209,
                dialogues: [
                    {
                        id: 10012401,
                        content: "这里好像有什么人生活过。",
                        npc: 100001,
                    },
                    {
                        id: 10012402,
                        content: "我猜，这是贝蕾曾经的家，对吗？",
                        npc: 100001,
                    },
                    {
                        id: 10012403,
                        content: "……我……",
                        npc: 100003,
                    },
                    {
                        id: 10012404,
                        content: "……是的，不止是我。这里是“我们”曾经的家。",
                        npc: 100003,
                    },
                    {
                        id: 10012405,
                        content: "我们？可我什么都想不起来。",
                        npc: 100001,
                    },
                    {
                        id: 10012406,
                        content: "……没关系，这样更好。等逃出去，我们会建起新的家。",
                        npc: 100003,
                    },
                ],
            },
            {
                id: 10010213,
                dialogues: [
                    {
                        id: 10019301,
                        content: "秽兽没完没了的……",
                        npc: 100001,
                    },
                    {
                        id: 10019302,
                        content: "向上跑。甩掉它们。",
                        npc: 100003,
                    },
                ],
            },
        ],
    },
    {
        id: 100103,
        quests: [
            {
                id: 10010302,
                dialogues: [
                    {
                        id: 10011605,
                        content: "……怎么……会是他们……",
                        npc: 100003,
                    },
                    {
                        id: 10011606,
                        content: "怎么回事，贝蕾？！",
                        npc: 100001,
                    },
                    {
                        id: 10011607,
                        content: "军团……还是找到了这儿吗……",
                        npc: 100003,
                    },
                    {
                        id: 10011608,
                        content: "……总之，先突围出去！",
                        npc: 100003,
                    },
                    {
                        id: 10011609,
                        content: "他们……绝非善类。",
                        npc: 100003,
                    },
                ],
            },
            {
                id: 10010303,
                dialogues: [
                    {
                        id: 10027501,
                        content: "在不远处……",
                    },
                ],
            },
            {
                id: 10010306,
                dialogues: [
                    {
                        id: 10012101,
                        content: "那是……",
                        npc: 100005,
                    },
                    {
                        id: 10012102,
                        content: "零号的力量明明还未解放，为什么……",
                        npc: 100005,
                    },
                    {
                        id: 10012103,
                        content: "不……这不是零号自身的力量，而是他人赋予的“和鸣之力”。",
                        npc: 100005,
                    },
                    {
                        id: 10012104,
                        content: "……她护着的小鬼……是“和鸣之力”新的宿体？",
                        npc: 100005,
                    },
                    {
                        id: 10012110,
                        content: "这么说来，那小鬼的相貌也……",
                        npc: 100005,
                    },
                    {
                        id: 10012105,
                        content: "“和鸣之力”和“零号”一起重现……到底意味着什么……",
                        npc: 100005,
                    },
                    {
                        id: 10011801,
                        content: "……呵，困兽之斗。",
                        npc: 100005,
                    },
                    {
                        id: 10011801,
                        content: "……呵，困兽之斗。",
                        npc: 100005,
                    },
                    {
                        id: 10010204,
                        content: "……",
                    },
                    {
                        id: 10010205,
                        content: "……",
                    },
                    {
                        id: 10010206,
                        content: "……",
                    },
                ],
            },
            {
                id: 10010307,
                dialogues: [
                    {
                        id: 10012701,
                        content: "你回来了。{nickname}……我的半身、我的倒影、我的回声。",
                        npc: 100012,
                    },
                    {
                        id: 10012702,
                        content: "你听到了我的声音。你找回了那份属于你的力量。“和鸣”。",
                        npc: 100012,
                    },
                    {
                        id: 10012703,
                        content: "这份力量什么都没能改变。我掉进了海里，不会再醒来，都结束了。",
                        npc: 100001,
                    },
                    {
                        id: 10012704,
                        content: "不。我能看见，你的未来、我们的未来……绝非止步于此。",
                        npc: 100012,
                    },
                    {
                        id: 10012705,
                        content: "会有人将你从苦涩的海水中打捞出来，带向一片苦寒的荒原，命运将在那里降下真正的淬炼。",
                        npc: 100012,
                    },
                    {
                        id: 10012706,
                        content: "你是说——我还活着？",
                        npc: 100001,
                    },
                    {
                        id: 10012712,
                        content: "该出发了。",
                        npc: 100012,
                    },
                    {
                        id: 10012713,
                        content: "……{nickname}。生命是航行在无尽长夜里的孤船。河流泪水满溢，夹岸荆棘丛生。",
                        npc: 100012,
                    },
                    {
                        id: 10012714,
                        content: "我会一直注视着……彼岸的你，将驶向何方。",
                        npc: 100012,
                    },
                    {
                        id: 10012710,
                        content: "从中寻觅吧……寻觅那些我们或许已经熟悉，或许将在未来相遇的身影。",
                        npc: 100012,
                    },
                    {
                        id: 10012711,
                        content: "愿他们成为你此行的助力。",
                        npc: 100012,
                    },
                    {
                        id: 10012712,
                        content: "该出发了。",
                        npc: 100012,
                    },
                    {
                        id: 10012713,
                        content: "……{nickname}。生命是航行在无尽长夜里的孤船。河流泪水满溢，夹岸荆棘丛生。",
                        npc: 100012,
                    },
                    {
                        id: 10012714,
                        content: "我会一直注视着……彼岸的你，将驶向何方。",
                        npc: 100012,
                    },
                ],
            },
            {
                id: 10010311,
                dialogues: [
                    {
                        id: 10010101,
                        content: "贝蕾，我……",
                        npc: 100001,
                    },
                ],
            },
        ],
    },
    {
        id: 100201,
        quests: [
            {
                id: 10020101,
                dialogues: [
                    {
                        id: 10100201,
                        content: "嗯。活着，能动弹，看起来骨头没断。",
                        npc: 200003,
                    },
                    {
                        id: 10100202,
                        content: "你们是……为什么知道我的名字？贝蕾，我们这是在哪——",
                        npc: 100001,
                    },
                    {
                        id: 10100203,
                        content: "不对，那时我们……",
                        npc: 100001,
                    },
                    {
                        id: 10100204,
                        content: "（得去找贝蕾。如果不用顾虑我的话，她也许能摆脱那些士兵逃走……）",
                        npc: 100001,
                    },
                    {
                        id: 10100205,
                        content: "（也许……吧……）",
                        npc: 100001,
                    },
                    {
                        id: 10100206,
                        content:
                            "哎，你在发什么呆？<H>白</>和卡米拉可是专门跑了大老远来救你的！先乖乖跟我们进城，不然就要被闲逛的秽兽啪嚓啪嚓吃掉了！",
                        npc: 200002,
                    },
                    {
                        id: 10100207,
                        content: "进……城？",
                        npc: 100001,
                    },
                    {
                        id: 10100208,
                        content: "吓坏了吧？没关系，等下就安全了——<H>冰湖城</>可是海伯利亚北方最大的城市！",
                        npc: 200002,
                    },
                    {
                        id: 10100209,
                        content: "海伯利亚……这里是海伯利亚帝国……？！",
                        npc: 100001,
                    },
                    {
                        id: 10100210,
                        content: "是啊，怎么啦，突然大惊小怪的？",
                        npc: 200002,
                    },
                    {
                        id: 10100211,
                        content: "那你们知道一个叫西比尔的女人吗？其他人叫她“军团长”，她应该就在这个国家……我想去找她。",
                        npc: 100001,
                    },
                    {
                        id: 10100212,
                        content: "叫西比尔的人遍地都是，但是被称作“军团长”的只能是那一位。找她？卡戎之民无惧严寒，你是怎么把脑子冻坏的？",
                        npc: 200003,
                    },
                    {
                        id: 10100213,
                        content: "我没在开玩笑。我有一个重要的……东西，可能落在了她手上，所以我一定要搞清楚。",
                        npc: 100001,
                    },
                    {
                        id: 10100214,
                        content:
                            "间谍，刺客，反抗者——单是凭你刚刚这句话，帝国士兵就能找出三种由头逮捕你。如果真的想要找大军团长，我奉劝你先不要这么着急。",
                        npc: 200003,
                    },
                    {
                        id: 10100215,
                        content: "最后一遍，不想留在这儿给秽兽当口粮，就跟上来。",
                        npc: 200003,
                    },
                ],
            },
            {
                id: 10020102,
                dialogues: [
                    {
                        id: 10100301,
                        content: "你看起来全身都是伤，不要紧吗？",
                        npc: 200002,
                    },
                    {
                        id: 10100302,
                        content: "没什么，已经不痛了。",
                        npc: 100001,
                    },
                    {
                        id: 10100303,
                        content: "你是不是遇到了很倒霉的事……不过不用怕！",
                        npc: 200002,
                    },
                    {
                        id: 10100304,
                        content: "现在有我罩着你啦！毕竟白可是——",
                        npc: 200002,
                    },
                ],
            },
            {
                id: 10020104,
                dialogues: [
                    {
                        id: 10100501,
                        content: "前面就是城门了，等下你就跟在我和卡米拉身后，悄悄混进去吧！",
                        npc: 200002,
                    },
                    {
                        id: 10100502,
                        content: "千万不要多说话哦，有什么事，万能的卡米拉会摆平的！",
                        npc: 200002,
                    },
                    {
                        id: 10100503,
                        content: "嗯，我明白。",
                        npc: 100001,
                    },
                    {
                        id: 10100601,
                        content: "站住。",
                        npc: 200071,
                    },
                    {
                        id: 10100602,
                        content: "好麻烦，又要盘查吗？连白和卡米拉都不记得，哼哼，你的眼睛和脑袋不太灵光！",
                        npc: 200002,
                    },
                    {
                        id: 10100603,
                        content: "谁问你了，皎皎之民。我是说——",
                        npc: 200071,
                    },
                    {
                        id: 10100604,
                        content: "听不见吗，一只眼的？跑那么快，是想赶着去治安署坐坐？",
                        npc: 200071,
                    },
                    {
                        id: 10100605,
                        content: "…………",
                        npc: 100001,
                    },
                    {
                        id: 10100606,
                        content: "不是本地人吧，哪来的？通行证呢？",
                        npc: 200071,
                    },
                    {
                        id: 10100601,
                        content: "站住。",
                        npc: 200071,
                    },
                    {
                        id: 10100602,
                        content: "好麻烦，又要盘查吗？连白和卡米拉都不记得，哼哼，你的眼睛和脑袋不太灵光！",
                        npc: 200002,
                    },
                    {
                        id: 10100603,
                        content: "谁问你了，皎皎之民。我是说——",
                        npc: 200071,
                    },
                    {
                        id: 10100604,
                        content: "听不见吗，一只眼的？跑那么快，是想赶着去治安署坐坐？",
                        npc: 200071,
                    },
                    {
                        id: 10100605,
                        content: "…………",
                        npc: 100001,
                    },
                    {
                        id: 10100606,
                        content: "不是本地人吧，哪来的？通行证呢？",
                        npc: 200071,
                    },
                    {
                        id: 10120601,
                        content: "（这就是“城市”吗，还是第一次见到……）",
                        npc: 100001,
                    },
                    {
                        id: 10120602,
                        content: "（可接下来去哪儿，完全没有头绪……还是先找到白和那位卡米拉女士吧。）",
                        npc: 100001,
                    },
                    {
                        id: 10100401,
                        content: "好像是哪个司机翻车了，竟然还引来了野兽……真是坏东西！",
                        npc: 200002,
                    },
                    {
                        id: 10100402,
                        content: "还好还好，揍扁了，揍扁了……",
                        npc: 200002,
                    },
                ],
            },
            {
                id: 10020105,
                dialogues: [
                    {
                        id: 10100801,
                        content: "挺会演的。",
                        npc: 200003,
                    },
                    {
                        id: 10100701,
                        content: "别在城里惹事，记住没？",
                        npc: 200004,
                    },
                ],
            },
            {
                id: 10020106,
                dialogues: [
                    {
                        id: 10100901,
                        content: "你刚才说的“鬼宅”，是什么意思？",
                        npc: 100001,
                    },
                    {
                        id: 10100902,
                        content: "是水仙平原的客人说的，时不时就会有人抱怨——",
                        npc: 200002,
                    },
                    {
                        id: 10100903,
                        content: "比如说明明那么大的旅馆，但是门每天都关得紧紧的，所有去投宿的外乡旅客都被赶走……",
                        npc: 200002,
                    },
                    {
                        id: 10100904,
                        content: "比如说旅馆的住客从不出门，里面还偶尔会飘出奇奇怪怪、说不上来的味道……",
                        npc: 200002,
                    },
                    {
                        id: 10100905,
                        content: "比如说那个店主的脸比泪湖的水还要冰，好像他开的不是旅馆，是棺材店！",
                        npc: 200002,
                    },
                    {
                        id: 10100906,
                        content: "听起来也算不上太坏。我还以为里面塞满了秽兽和西比尔。",
                        npc: 100001,
                    },
                    {
                        id: 10100907,
                        content: "但是，既然他们不接待外乡人，那我恐怕也……",
                        npc: 100001,
                    },
                    {
                        id: 10100908,
                        content: "不过，看起来卡米拉·斯卡雷特女士在这里颇有些声望。嗯……或许可以借一下她的名头。",
                        npc: 100001,
                    },
                    {
                        id: 10100909,
                        content: "不用不用，白的名头借给你用就好了。从今以后你就是我关照的人了，小仆从！",
                        npc: 200002,
                    },
                    {
                        id: 10100910,
                        content: "谢谢你，但是，“仆从”是什么？",
                        npc: 100001,
                    },
                    {
                        id: 10100911,
                        content: "是流行小说中受魔王大人眷顾的跟班！",
                        npc: 200002,
                    },
                    {
                        id: 10100912,
                        content: "世界上有那么多皎皎之民，为什么偏偏是白长了角呢？显然我命中注定会成为魔王大人！",
                        npc: 200002,
                    },
                    {
                        id: 10100913,
                        content: "而我是听到了神秘声音的指引找到了你，所以你一定是上天安排给我的仆从！",
                        npc: 200002,
                    },
                    {
                        id: 10100914,
                        content: "所以所以，我决定了——要以我的智慧，指引你走上正确的道路！",
                        npc: 200002,
                    },
                    {
                        id: 10100915,
                        content: "…………",
                        npc: 100001,
                    },
                    {
                        id: 10100916,
                        content: "（“<H>皎皎之民</>大多对人抱有亲近感”……书本没有骗我。）",
                        npc: 100001,
                    },
                    {
                        id: 10100917,
                        content: "那间旅馆就在北边！不要发呆啦，快~跟~上！",
                        npc: 200002,
                    },
                    {
                        id: 10100918,
                        content: "（……就、就是这位似乎有点亲近过头了。）",
                        npc: 100001,
                    },
                    {
                        id: 10101001,
                        content: "到啦！站在这儿等着！",
                        npc: 200002,
                    },
                ],
            },
            {
                id: 10020107,
                dialogues: [
                    {
                        id: 10101409,
                        content: "只有今晚。过了今晚，该去哪去哪。",
                        npc: 200005,
                    },
                    {
                        id: 10101410,
                        content: "……明白。",
                        npc: 100001,
                    },
                    {
                        id: 10101401,
                        content: "你……是……新来的住客？",
                        npc: 200006,
                    },
                    {
                        id: 10101402,
                        content: "没钱还想借宿的外乡人而已，我正要赶出去。",
                        npc: 200005,
                    },
                    {
                        id: 10101403,
                        content: "外乡人？那……赶出去的话，{性别：他|她}不就无家可归了吗？",
                        npc: 200006,
                    },
                    {
                        id: 10101404,
                        content: "与你无关。",
                        npc: 200005,
                    },
                    {
                        id: 10101405,
                        content:
                            "可是……反正那间宅邸暂时还没有卖掉，借给{性别：他|她}住一晚也没关系吧？等{性别：他|她}有了旅费再还您，我们不是白赚一份租金？",
                        npc: 200006,
                    },
                    {
                        id: 10101406,
                        content: "您要是一直这样，对谁都冷冰冰的，宅子就真的卖不掉啦。",
                        npc: 200006,
                    },
                    {
                        id: 10101407,
                        content: "你……",
                        npc: 200005,
                    },
                    {
                        id: 10101408,
                        content: "……算了，随你吧。",
                        npc: 200005,
                    },
                    {
                        id: 10101201,
                        content: "是卡米拉·斯卡雷特女士推荐我来的。我想在您这里借宿几天，不知是否方便？",
                        npc: 100001,
                    },
                    {
                        id: 10101202,
                        content: "…………",
                        npc: 200005,
                    },
                    {
                        id: 10101203,
                        content: "没通行证？",
                        npc: 200005,
                    },
                ],
            },
            {
                id: 10020108,
                dialogues: [
                    {
                        id: 10101501,
                        content: "那座宅子就在南边，跟我走吧！",
                        npc: 200006,
                    },
                    {
                        id: 10101502,
                        content: "就是这里。",
                        npc: 200006,
                    },
                    {
                        id: 10101601,
                        content: "这间刚刚打扫出来，今晚你就住这里吧。",
                        npc: 200006,
                    },
                    {
                        id: 10101602,
                        content: "好诶！",
                        npc: 200002,
                    },
                    {
                        id: 10101603,
                        content: "你不要生气，其实恩里克叔叔并没有那么贪财。只是我们最近实在拮据，不然他也不会打算卖掉老宅补贴家用。",
                        npc: 200006,
                    },
                    {
                        id: 10101604,
                        content: "这里虽然荒废了几年，但打扫完之后还不错，至少能挡住外面的寒风，对吧！",
                        npc: 200006,
                    },
                    {
                        id: 10101605,
                        content: "哦对了，还没告诉你们我的名字。我叫赛琪，是“修普诺斯之家”的住客，有时也会帮忙打打下手。",
                        npc: 200006,
                    },
                ],
            },
            {
                id: 10020111,
                dialogues: [
                    {
                        id: 10101701,
                        content:
                            "（太多事，发生了太多事......奇怪的梦、神秘的白斗篷、西比尔和“零号”……它们似乎有着某种关联，但我无法理清它们的头绪。）",
                        npc: 100001,
                    },
                    {
                        id: 10101702,
                        content: "（唯一确定的只有，我已经和贝蕾失散了……)",
                        npc: 100001,
                    },
                    {
                        id: 10101703,
                        content:
                            "（……如果她那时逃脱了，应该也会想尽办法找我......当然，不能排除最坏的可能性，也就是她被西比尔带去了军团。）",
                        npc: 100001,
                    },
                    {
                        id: 10101704,
                        content: "（不幸中的万幸是，西比尔似乎出于某种原因<H>需要</>贝蕾，应该不会加害于她。）",
                        npc: 100001,
                    },
                    {
                        id: 10101705,
                        content: "（.....总之，要想办法在冰湖城攒一笔钱，想办法弄到通行证，再做下一步打算。）",
                        npc: 100001,
                    },
                    {
                        id: 10101801,
                        content: "我回来了。",
                        npc: 200006,
                    },
                    {
                        id: 10101802,
                        content: "饿坏了吧？这是刚烤好的面包。",
                        npc: 200006,
                    },
                    {
                        id: 10101803,
                        content: "贝蕾……？",
                        npc: 100001,
                    },
                    {
                        id: 10101804,
                        content: "……？",
                        npc: 200006,
                    },
                    {
                        id: 10101805,
                        content: "你……还好吗？",
                        npc: 200006,
                    },
                    {
                        id: 10101806,
                        content: "……！！",
                        npc: 100001,
                    },
                    {
                        id: 10101807,
                        content: "没事。太饿了，不小心咬到了舌头。很疼，所以……",
                        npc: 100001,
                    },
                    {
                        id: 10101808,
                        content: "那你快把这个吃掉，再喝点热乎乎的牛奶，就舒服多了——当心，别再咬到舌头啦。",
                        npc: 200006,
                    },
                    {
                        id: 10101809,
                        content: "……谢谢你。",
                        npc: 100001,
                    },
                    {
                        id: 10101810,
                        content: "你……是不是很难过？",
                        npc: 200006,
                    },
                    {
                        id: 10101811,
                        content: "……嗯？",
                        npc: 100001,
                    },
                    {
                        id: 10101812,
                        content: "我感觉得到。虽然在努力挤出笑脸，但你并不快乐。",
                        npc: 200006,
                    },
                    {
                        id: 10101813,
                        content: "虽然有点好奇你到底遭遇过什么，但是恩里克叔叔告诉过我，不要追问客人的过去。",
                        npc: 200006,
                    },
                    {
                        id: 10101814,
                        content: "嗯……先在这里歇息一下，想想接下来做些什么吧。",
                        npc: 200006,
                    },
                    {
                        id: 10101815,
                        content: "好。",
                        npc: 100001,
                    },
                    {
                        id: 10101901,
                        content: "赛琪，我想问一件事。",
                        npc: 100001,
                    },
                    {
                        id: 10101902,
                        content: "我需要一笔钱。这座城市有没有什么地方，有可以交给外乡人的工作——我是说，不会被过问身份来历的地方？",
                        npc: 100001,
                    },
                    {
                        id: 10101903,
                        content: "我想想……",
                        npc: 200006,
                    },
                    {
                        id: 10101904,
                        content: "这里的人们大多是在工厂……唔，所有工厂都是需要通行证的……唔，实在不行可以试试那里？",
                        npc: 200006,
                    },
                    {
                        id: 10101905,
                        content: "卡米拉·斯卡雷特女士的酒馆“<H>水仙平原</>”。在那里接取委托，完成后可以得到一笔酬金。",
                        npc: 200006,
                    },
                    {
                        id: 10101906,
                        content: "不过那些委托大多有些危险，去一些卫戍部队都不愿意去的地方，如果遇到游荡的秽兽……",
                        npc: 200006,
                    },
                    {
                        id: 10101907,
                        content: "卡米拉·斯卡雷特？我与这位女士有过一面之缘，原来她的酒馆还经营这个。",
                        npc: 100001,
                    },
                    {
                        id: 10101908,
                        content: "没关系，我做得到。带我去吧。",
                        npc: 100001,
                    },
                ],
            },
            {
                id: 10020112,
                dialogues: [
                    {
                        id: 10102001,
                        content: "咦，你们兜兜转转，居然打算去找卡米拉了？",
                        npc: 200002,
                    },
                    {
                        id: 10102002,
                        content: "那白可太熟了，白也来带路！",
                        npc: 200002,
                    },
                ],
            },
        ],
    },
    {
        id: 100202,
        quests: [
            {
                id: 10020201,
                dialogues: [
                    {
                        id: 10103601,
                        content: "“水仙平原”就在南边。",
                        npc: 200006,
                    },
                    {
                        id: 10103602,
                        content: "快来快来！白在广场等你们！",
                        npc: 200002,
                    },
                ],
            },
            {
                id: 10020202,
                dialogues: [
                    {
                        id: 10102101,
                        content: "通行证……",
                        npc: 200008,
                    },
                    {
                        id: 10102102,
                        content: "听不懂人话吗？给老子看你的……通行证！",
                        npc: 200008,
                    },
                    {
                        id: 10102103,
                        content: "长官，我手脚不太好，请您稍等一下，我在找，在找……",
                        npc: 200009,
                    },
                    {
                        id: 10102104,
                        content: "啊，找到了，给您！",
                        npc: 200009,
                    },
                    {
                        id: 10102105,
                        content: "哦……？哦，照片上……是你这老东西？",
                        npc: 200008,
                    },
                    {
                        id: 10102106,
                        content: "是，长官……",
                        npc: 200009,
                    },
                    {
                        id: 10102107,
                        content: "我怎么看怎么像条狗呢，哈哈，哈哈哈哈哈！",
                        npc: 200008,
                    },
                    {
                        id: 10102108,
                        content: "哎，要不你学几声狗叫，给咱们听听？",
                        npc: 200010,
                    },
                    {
                        id: 10102401,
                        content: "……快走。",
                        npc: 200006,
                    },
                    {
                        id: 10102402,
                        content: "有一件重要的事，我不知道你是否清楚。",
                        npc: 200006,
                    },
                    {
                        id: 10102403,
                        content: "如果你们是从海伯利亚以外的地方来的，请记住，千万不要触怒“<H>索拉之民</>”。",
                        npc: 200006,
                    },
                    {
                        id: 10102404,
                        content: "“索拉之民”？你是说没有长角的那些……他们有什么特别之处吗？",
                        npc: 100001,
                    },
                    {
                        id: 10102405,
                        content: "还是说，<H>我们</>是特别的？",
                        npc: 100001,
                    },
                    {
                        id: 10102406,
                        content: "嗯。在海伯利亚，我们这样长着特别的角和脊椎的<H>卡戎之民</>，和索拉人是不一样的。他们还把我们叫做……",
                        npc: 200006,
                    },
                    {
                        id: 10102407,
                        content: "“<W>恶魔的孩子</>”。",
                        npc: 200006,
                    },
                    {
                        id: 10102408,
                        content: "唉，说到这个，白可——生气了！",
                        npc: 200002,
                    },
                    {
                        id: 10102409,
                        content:
                            "那群人说到“恶魔的孩子”和“魔法”就摆上一张难看的臭脸……就像卡米拉看到有人在水仙平原斗殴！可是明明是“恶魔”被他们欺负才对！",
                        npc: 200002,
                    },
                    {
                        id: 10102410,
                        content: "…………",
                        npc: 200006,
                    },
                    {
                        id: 10102411,
                        content: "谢谢你。",
                        npc: 200006,
                    },
                    {
                        id: 10102412,
                        content: "但是，我们在这里不受欢迎也是事实。你与索拉人打交道的时候，务必小心。",
                        npc: 200006,
                    },
                    {
                        id: 10102413,
                        content: "刚才那个士兵……即使那么残忍，他需要付出的代价，也不过是“失手”带来的降职而已。",
                        npc: 200006,
                    },
                    {
                        id: 10102414,
                        content: "同样的事情，我们见过很多、很多次……到最后，所有人都习惯了。在这里，这些事情是最平常不过的——",
                        npc: 200006,
                    },
                    {
                        id: 10102415,
                        content:
                            "就像卡戎之民不能进入冰湖城的内城，也不得离开帝国一样平常，就像花会凋谢，湖会冻结，雪落在炉火里会融化一样平常。",
                        npc: 200006,
                    },
                    {
                        id: 10102416,
                        content: "（……这么说来，回净界岛的困难又多了一件。）",
                        npc: 100001,
                    },
                    {
                        id: 10102417,
                        content: "为什么会这样？",
                        npc: 100001,
                    },
                    {
                        id: 10102418,
                        content: "海伯利亚的索拉人认为，会“魔法”的卡戎之民是邪恶的施术者，是人类安宁最大的威胁。",
                        npc: 200006,
                    },
                    {
                        id: 10102419,
                        content: "那你们也不能总是默默忍受一切呀！为什么不用你们的魔法“轰”地一下，打得他们哇哇叫！……真是的，气死我了。",
                        npc: 200002,
                    },
                    {
                        id: 10102401,
                        content: "……快走。",
                        npc: 200006,
                    },
                    {
                        id: 10102402,
                        content: "有一件重要的事，我不知道你是否清楚。",
                        npc: 200006,
                    },
                    {
                        id: 10102403,
                        content: "如果你们是从海伯利亚以外的地方来的，请记住，千万不要触怒“<H>索拉之民</>”。",
                        npc: 200006,
                    },
                    {
                        id: 10102404,
                        content: "“索拉之民”？你是说没有长角的那些……他们有什么特别之处吗？",
                        npc: 100001,
                    },
                    {
                        id: 10102405,
                        content: "还是说，<H>我们</>是特别的？",
                        npc: 100001,
                    },
                    {
                        id: 10102406,
                        content: "嗯。在海伯利亚，我们这样长着特别的角和脊椎的<H>卡戎之民</>，和索拉人是不一样的。他们还把我们叫做……",
                        npc: 200006,
                    },
                    {
                        id: 10102407,
                        content: "“<W>恶魔的孩子</>”。",
                        npc: 200006,
                    },
                    {
                        id: 10102408,
                        content: "唉，说到这个，白可——生气了！",
                        npc: 200002,
                    },
                    {
                        id: 10102409,
                        content:
                            "那群人说到“恶魔的孩子”和“魔法”就摆上一张难看的臭脸……就像卡米拉看到有人在水仙平原斗殴！可是明明是“恶魔”被他们欺负才对！",
                        npc: 200002,
                    },
                    {
                        id: 10102410,
                        content: "…………",
                        npc: 200006,
                    },
                    {
                        id: 10102411,
                        content: "谢谢你。",
                        npc: 200006,
                    },
                    {
                        id: 10102412,
                        content: "但是，我们在这里不受欢迎也是事实。你与索拉人打交道的时候，务必小心。",
                        npc: 200006,
                    },
                    {
                        id: 10102413,
                        content: "刚才那个士兵……即使那么残忍，他需要付出的代价，也不过是“失手”带来的降职而已。",
                        npc: 200006,
                    },
                    {
                        id: 10102414,
                        content: "同样的事情，我们见过很多、很多次……到最后，所有人都习惯了。在这里，这些事情是最平常不过的——",
                        npc: 200006,
                    },
                    {
                        id: 10102415,
                        content:
                            "就像卡戎之民不能进入冰湖城的内城，也不得离开帝国一样平常，就像花会凋谢，湖会冻结，雪落在炉火里会融化一样平常。",
                        npc: 200006,
                    },
                    {
                        id: 10102416,
                        content: "（……这么说来，回净界岛的困难又多了一件。）",
                        npc: 100001,
                    },
                    {
                        id: 10102417,
                        content: "为什么会这样？",
                        npc: 100001,
                    },
                    {
                        id: 10102418,
                        content: "海伯利亚的索拉人认为，会“魔法”的卡戎之民是邪恶的施术者，是人类安宁最大的威胁。",
                        npc: 200006,
                    },
                    {
                        id: 10102419,
                        content: "那你们也不能总是默默忍受一切呀！为什么不用你们的魔法“轰”地一下，打得他们哇哇叫！……真是的，气死我了。",
                        npc: 200002,
                    },
                ],
            },
            {
                id: 10020204,
                dialogues: [
                    {
                        id: 10102601,
                        content: "是你。还有你是那个……弗莱伊家的女儿？是叫……赛琪吧？",
                        npc: 200003,
                    },
                    {
                        id: 10102602,
                        content: "是的，卡米拉女士。我现在借住在修普诺斯之家。",
                        npc: 200006,
                    },
                    {
                        id: 10102603,
                        content: "……这样吗。",
                        npc: 200003,
                    },
                    {
                        id: 10102604,
                        content: "……我是带这位朋友来的。{性别：他|她}想找一份狩月人的工作。",
                        npc: 200006,
                    },
                    {
                        id: 10102605,
                        content: "狩月人！那你们是找对地方了，正巧，现在这里就有一份委托——",
                        npc: 200011,
                    },
                    {
                        id: 10102606,
                        content: "先别插嘴，玛尔洁。",
                        npc: 200003,
                    },
                    {
                        id: 10102607,
                        content: "……哦。",
                        npc: 200011,
                    },
                    {
                        id: 10102608,
                        content: "这么快就交上了朋友……你还挺受欢迎。至于狩月人——",
                        npc: 200003,
                    },
                    {
                        id: 10102609,
                        content:
                            "丑话说在前头，这不是小孩子玩闹，更不是什么轻松活计。这里是不问来历、不问出身，但你得到的每一枚回报，都伴随着相应的危险。",
                        npc: 200003,
                    },
                    {
                        id: 10102601,
                        content: "是你。还有你是那个……弗莱伊家的女儿？是叫……赛琪吧？",
                        npc: 200003,
                    },
                    {
                        id: 10102602,
                        content: "是的，卡米拉女士。我现在借住在修普诺斯之家。",
                        npc: 200006,
                    },
                    {
                        id: 10102603,
                        content: "……这样吗。",
                        npc: 200003,
                    },
                    {
                        id: 10102604,
                        content: "……我是带这位朋友来的。{性别：他|她}想找一份狩月人的工作。",
                        npc: 200006,
                    },
                    {
                        id: 10102605,
                        content: "狩月人！那你们是找对地方了，正巧，现在这里就有一份委托——",
                        npc: 200011,
                    },
                    {
                        id: 10102606,
                        content: "先别插嘴，玛尔洁。",
                        npc: 200003,
                    },
                    {
                        id: 10102607,
                        content: "……哦。",
                        npc: 200011,
                    },
                    {
                        id: 10102608,
                        content: "这么快就交上了朋友……你还挺受欢迎。至于狩月人——",
                        npc: 200003,
                    },
                    {
                        id: 10102609,
                        content:
                            "丑话说在前头，这不是小孩子玩闹，更不是什么轻松活计。这里是不问来历、不问出身，但你得到的每一枚回报，都伴随着相应的危险。",
                        npc: 200003,
                    },
                ],
            },
            {
                id: 10020205,
                dialogues: [
                    {
                        id: 10102701,
                        content: "那位小姐这么着急，我也一起去帮忙吧。",
                        npc: 200006,
                    },
                    {
                        id: 10102702,
                        content: "不要插手，这是对我们未来狩月人的简单考验。要是没有吃这碗饭的实力，做狩月人只会害了自己。",
                        npc: 200003,
                    },
                    {
                        id: 10102703,
                        content: "好吧……",
                        npc: 200006,
                    },
                    {
                        id: 10102801,
                        content: "你、你真的愿意帮我吗！呜……谢谢你，陌生人！",
                        npc: 2000111,
                    },
                    {
                        id: 10102802,
                        content: "小贼刚才是往西边去了。但是冰湖城嘛，四通八达，谁知道他到底会窜到哪儿去。等下咱俩先找找线索！",
                        npc: 2000111,
                    },
                ],
            },
            {
                id: 10020207,
                dialogues: [
                    {
                        id: 10117301,
                        content: "巴迪爷爷！您这是出来散步？",
                        npc: 200011,
                    },
                    {
                        id: 10117302,
                        content: "哦哟，这不是咱们的垃圾桶小公主吗？今天带着{性别:小弟小妹|两个小妹}一起捡啊？",
                        npc: 200054,
                    },
                    {
                        id: 10117303,
                        content: "我不是小妹！是魔王！",
                        npc: 200002,
                    },
                    {
                        id: 10117304,
                        content: "哦……那就是垃圾桶小魔王？",
                        npc: 200054,
                    },
                    {
                        id: 10117305,
                        content: "不是啦，是“光之魔王”！",
                        npc: 200002,
                    },
                    {
                        id: 10117306,
                        content: "啊哈哈哈……先别管这个了，爷爷啊，您看没看到一个黑头发、蓝衣服的卡戎男人从这里跑过去？",
                        npc: 200011,
                    },
                    {
                        id: 10117307,
                        content:
                            "刚刚确实有个小伙子跑过去了。年轻人冒冒失失的，走路也不看路，直冲着<H>雾区</>堆垃圾那块儿去了！呀，他该不会是——要抢你生意？",
                        npc: 200054,
                    },
                    {
                        id: 10117308,
                        content: "呃……算是吧！谢啦，我这就追他去。",
                        npc: 200011,
                    },
                    {
                        id: 10117101,
                        content: "咱们就先往西边找吧！",
                        npc: 200011,
                    },
                    {
                        id: 10117102,
                        content: "那小贼一头黑发，当时穿的好像是……蓝色的上衣？",
                        npc: 200011,
                    },
                    {
                        id: 10117201,
                        content: "那是……贫民窟的巴迪爷爷！我去找他打听打听！",
                        npc: 200011,
                    },
                    {
                        id: 10117801,
                        content: "原来“缄默侦探”就是玛尔洁的称号啊，还挺威风的……只可惜有点短，气势上输了一截！",
                        npc: 200002,
                    },
                    {
                        id: 10117802,
                        content: "有道理！那魔王小妹你有什么主意吗？",
                        npc: 200011,
                    },
                    {
                        id: 10117803,
                        content: "刚才那个老爷爷说的“垃圾桶公主”就挺不错的？",
                        npc: 200002,
                    },
                    {
                        id: 10117804,
                        content: "“缄默侦探☆垃圾桶公主”，气势是不是突然就上去啦！",
                        npc: 200002,
                    },
                    {
                        id: 10117805,
                        content: "啊——！不要不要，不要再提那几个字了，丢死人了！",
                        npc: 200011,
                    },
                ],
            },
            {
                id: 10020208,
                dialogues: [
                    {
                        id: 10117501,
                        content: "去吧去吧……老话怎么说的来着？“早起的鸟儿有垃圾捡！”",
                        npc: 200054,
                    },
                    {
                        id: 10117701,
                        content: "涂鸦墙边的箱子叠了两层……底层箱子被斜过来了，表面还有凌乱的成年男性脚印——哼哼，被我看穿了！",
                        npc: 200011,
                    },
                    {
                        id: 10117702,
                        content: "咳，根据证人玛尔洁的证词，今天早上她来3号大垃圾箱“进货”的时候，才刚把这边的箱子横着摆好。",
                        npc: 200011,
                    },
                    {
                        id: 10117703,
                        content:
                            "所以，“缄默侦探”玛尔洁的推理显而易见——小贼情急之下把这些箱子叠了起来，踩着它们爬上了墙！他很可能藏在天台上！",
                        npc: 200011,
                    },
                    {
                        id: 10117704,
                        content: "哦！有道理耶！我们也爬上去看看吧。",
                        npc: 200002,
                    },
                    {
                        id: 10117601,
                        content: "这一带没有人。",
                        npc: 100001,
                    },
                    {
                        id: 10117602,
                        content: "……没关系！灵敏的“侦探”嗅觉告诉我，这附近一定能找到线索！",
                        npc: 200011,
                    },
                    {
                        id: 10117402,
                        content: "他说的是3号大垃圾箱！跟我来！",
                        npc: 200011,
                    },
                    {
                        id: 10117801,
                        content: "原来“缄默侦探”就是玛尔洁的称号啊，还挺威风的……只可惜有点短，气势上输了一截！",
                        npc: 200002,
                    },
                    {
                        id: 10117802,
                        content: "有道理！那魔王小妹你有什么主意吗？",
                        npc: 200011,
                    },
                    {
                        id: 10117803,
                        content: "刚才那个老爷爷说的“垃圾桶公主”就挺不错的？",
                        npc: 200002,
                    },
                    {
                        id: 10117804,
                        content: "“缄默侦探☆垃圾桶公主”，气势是不是突然就上去啦！",
                        npc: 200002,
                    },
                    {
                        id: 10117805,
                        content: "啊——！不要不要，不要再提那几个字了，丢死人了！",
                        npc: 200011,
                    },
                    {
                        id: 10117901,
                        content: "怎么了，垃圾桶里有什么吗？",
                        npc: 200011,
                    },
                    {
                        id: 10117902,
                        content: "我只是想确认一下他有没有藏在——",
                        npc: 100001,
                    },
                    {
                        id: 10117903,
                        content: "啊——！那是……半瓶葡萄酒和一枚古董胸针？！天哪，难道你就是被垃圾桶之神眷顾的天选之人？！",
                        npc: 200011,
                    },
                    {
                        id: 10117904,
                        content: "可恶，偏偏在这个节骨眼上……你等我一下！",
                        npc: 200011,
                    },
                    {
                        id: 10117905,
                        content: "（玛尔洁从废品堆里扯出两张旧报纸，把刚找到的宝贝小心翼翼地包了起来，放在角落里。）",
                    },
                    {
                        id: 10117906,
                        content: "好嘞，这样就没问题了！等我抓完小贼再回来收货。见者有份，等小贼的事儿搞定，葡萄酒也分你一半！",
                        npc: 200011,
                    },
                    {
                        id: 10117907,
                        content: "呃……这个就不用了！",
                        npc: 100001,
                    },
                ],
            },
            {
                id: 10020209,
                dialogues: [
                    {
                        id: 10118101,
                        content: "最近这是怎么了，总有人在城里飞檐走壁。冰湖城是有什么运动赛吗？爬得快有奖那种？",
                        npc: 200055,
                    },
                    {
                        id: 10118102,
                        content: "呃……这么说来，好像确实有个皎皎前辈设过类似的挑战？",
                        npc: 200002,
                    },
                    {
                        id: 10118103,
                        content: "那你们快追吧！刚才那位选手都跑过去半天啦。",
                        npc: 200055,
                    },
                    {
                        id: 10117801,
                        content: "原来“缄默侦探”就是玛尔洁的称号啊，还挺威风的……只可惜有点短，气势上输了一截！",
                        npc: 200002,
                    },
                    {
                        id: 10117802,
                        content: "有道理！那魔王小妹你有什么主意吗？",
                        npc: 200011,
                    },
                    {
                        id: 10117803,
                        content: "刚才那个老爷爷说的“垃圾桶公主”就挺不错的？",
                        npc: 200002,
                    },
                    {
                        id: 10117804,
                        content: "“缄默侦探☆垃圾桶公主”，气势是不是突然就上去啦！",
                        npc: 200002,
                    },
                    {
                        id: 10117805,
                        content: "啊——！不要不要，不要再提那几个字了，丢死人了！",
                        npc: 200011,
                    },
                ],
            },
            {
                id: 10020210,
                dialogues: [
                    {
                        id: 10118202,
                        content: "你、你……至于追到这种地方来吗？你说你那钱本来就是拿来分给别人的，那分老子一点怎么了？",
                        npc: 200053,
                    },
                    {
                        id: 10118203,
                        content: "你有困难我可以帮你，但直接上手抢，那就吃我一铲！",
                        npc: 200011,
                    },
                    {
                        id: 10118204,
                        content: "（青年似乎找不到反驳的话，气急败坏地跳下了墙。）",
                    },
                    {
                        id: 10118201,
                        content: "啊，快看，就是前面屋顶上那家伙！",
                        npc: 200011,
                    },
                ],
            },
            {
                id: 10020211,
                dialogues: [
                    {
                        id: 10118301,
                        content: "又、又不见了？他是幽灵吗？",
                        npc: 200002,
                    },
                    {
                        id: 10118303,
                        content: "以我的推测，他一定钻进了下水道！",
                        npc: 200011,
                    },
                ],
            },
            {
                id: 10020215,
                dialogues: [
                    {
                        id: 10118701,
                        content: "乖乖站住！不许跑！",
                        npc: 200011,
                    },
                    {
                        id: 10118702,
                        content: "呼……呼……你们几个腿长的……等等我……",
                        npc: 200002,
                    },
                ],
            },
            {
                id: 10020221,
                dialogues: [
                    {
                        id: 10103701,
                        content: "这边，狩月人所有的委托都在这边的告示板上！",
                        npc: 200002,
                    },
                ],
            },
            {
                id: 10020222,
                dialogues: [
                    {
                        id: 10103801,
                        content: "哟，这不是白嘛，又在给狩月人帮忙？是不是又抓了几百个大盗，挫败了十几起惊天大阴谋呀？",
                        npc: 200065,
                    },
                    {
                        id: 10103802,
                        content: "今天我比较低调，只抓了一个小偷。",
                        npc: 200002,
                    },
                    {
                        id: 10103803,
                        content: "抓了一个？这听起来倒跟真的似的，我得见识见识。",
                        npc: 200065,
                    },
                    {
                        id: 10103804,
                        content: "之前也没说过假话！快来快来，我的小仆从，这是威尔斯大叔，这里最勤快的狩月人啦。",
                        npc: 200002,
                    },
                    {
                        id: 10103805,
                        content: "你好，威尔斯先生。",
                        npc: 100001,
                    },
                    {
                        id: 10103806,
                        content: "就是你？长得白白净净，看不出来还真有点“本事”啊？",
                        npc: 200065,
                    },
                    {
                        id: 10103807,
                        content: "过奖了，小事而已。",
                        npc: 100001,
                    },
                    {
                        id: 10103808,
                        content:
                            "小事？我跟你说，就是你们这些干小事的人太多，冰湖城才是现在这副样子。要是干什么大事，那冰湖城还不得翻了天去。",
                        npc: 200065,
                    },
                    {
                        id: 10103809,
                        content: "那我努努力，多向前辈学习——",
                        npc: 100001,
                    },
                    {
                        id: 10103810,
                        content: "学习？先消停会儿吧！好好思考，想想清楚，自己为什么会走上这条路。",
                        npc: 200065,
                    },
                    {
                        id: 10103811,
                        content: "我需要一笔钱。",
                        npc: 100001,
                    },
                    {
                        id: 10103812,
                        content: "钱？谁不缺，别人还欠着我钱呢！缺就缺，我也没去偷，没去抢。",
                        npc: 200065,
                    },
                ],
            },
            {
                id: 10020223,
                dialogues: [
                    {
                        id: 10103901,
                        content: "太好了，你的第一个委托比我想象中还要顺利呢。",
                        npc: 200006,
                    },
                    {
                        id: 10103902,
                        content: "和卡米拉说一声吧，我请客。",
                        npc: 200015,
                    },
                    {
                        id: 10104001,
                        content: "第一个任务还算利落，和威尔斯也聊的不错，你的狩月人生涯开场挺顺利的。",
                        npc: 200003,
                    },
                    {
                        id: 10104002,
                        content: "来吧，喝口热饮。本来还想请你一杯，但既然威尔斯开了口，那就记他账上吧。",
                        npc: 200003,
                    },
                    {
                        id: 10104003,
                        content: "哎，刚刚确实是我误会了这位{性别：小兄弟|小姑娘}，应该的。",
                        npc: 200065,
                    },
                    {
                        id: 10104004,
                        content: "正好我也跟{性别：他|她}讲一讲现在的行情，老实说，最近咱们这行可不太好过，稍微值点钱的委托都得用抢的。",
                        npc: 200065,
                    },
                    {
                        id: 10104005,
                        content: "今天的委托我刚看过，净是吃力不讨好的小活。除了那个烫手山芋……",
                        npc: 200065,
                    },
                ],
            },
        ],
    },
    {
        id: 100203,
        quests: [
            {
                id: 10020301,
                dialogues: [
                    {
                        id: 10104401,
                        content: "请等一下！",
                        npc: 200006,
                    },
                    {
                        id: 10104402,
                        content: "赛琪？你怎么跟上来了？",
                        npc: 100001,
                    },
                    {
                        id: 10104403,
                        content: "我来帮你们带路吧。我指的是……去格雷姆废矿的路。",
                        npc: 200006,
                    },
                    {
                        id: 10104404,
                        content: "白认识路！不过……嗯，如果有人一起的话更好了，毕竟这可是出城。",
                        npc: 200002,
                    },
                    {
                        id: 10104405,
                        content: "是啊，外乡人在城外很容易迷路的。我看到你接了恩里克叔叔……我们的委托，所以我想我还是帮下忙为好。",
                        npc: 200006,
                    },
                ],
            },
            {
                id: 10020302,
                dialogues: [
                    {
                        id: 10104501,
                        content: "呼……好久没来城外了。",
                        npc: 200006,
                    },
                    {
                        id: 10104502,
                        content: "落满雪的针叶林，望不到边的冰湖……高个子山峰被天空按住了脑袋……很喜欢。",
                        npc: 200006,
                    },
                    {
                        id: 10104503,
                        content: "白还是更喜欢城里面！如果郊外没有那些到处巡逻的秽兽就好啦。",
                        npc: 200002,
                    },
                    {
                        id: 10104504,
                        content: "里面更安全些。但是，我喜欢这里的……空气。",
                        npc: 200006,
                    },
                    {
                        id: 10104505,
                        content: "有区别吗？我闻起来都差不多耶……",
                        npc: 200002,
                    },
                    {
                        id: 10104506,
                        content: "嗯……冰湖城的空气总是带着腥味，带着哭声。",
                        npc: 200006,
                    },
                    {
                        id: 10104507,
                        content: "而这里是森林的味道，浮冰的味道，还有驶向远方的汽笛。这里偶尔能看到雪白的鹿从林间窜出——",
                        npc: 200006,
                    },
                    {
                        id: 10104508,
                        content: "而冰湖城街道的角落窜出来的，是小偷、强盗……或者呜咽的乞丐。",
                        npc: 200006,
                    },
                    {
                        id: 10104509,
                        content: "{nickname}，你呢？讲讲你的故乡吧！那座海岛是怎样的？",
                        npc: 200006,
                    },
                    {
                        id: 10104510,
                        content: "那里的“空气”是金色的砂砾，海岸的迷迭香……",
                        npc: 100001,
                    },
                    {
                        id: 10104511,
                        content: "是深夜朦胧的海雾，是我和贝……和家人每天眺望的巨大天之树。",
                        npc: 100001,
                    },
                    {
                        id: 10104512,
                        content: "嗯……那如果你什么时候回去故乡，请代我向它们问候~",
                        npc: 200006,
                    },
                    {
                        id: 10104513,
                        content: "……唔唔，你们两个的话好难懂哦……",
                        npc: 200002,
                    },
                    {
                        id: 10104514,
                        content: "等你再长大一些就明白啦。",
                        npc: 200006,
                    },
                    {
                        id: 10104515,
                        content: "……不过，皎皎之民似乎是长不大的？",
                        npc: 200006,
                    },
                    {
                        id: 10104601,
                        content: "前面就是格雷姆废矿的入口了，你们一定要小心。",
                        npc: 200006,
                    },
                    {
                        id: 10104602,
                        content: "多谢，帮大忙了。",
                        npc: 100001,
                    },
                    {
                        id: 10104603,
                        content: "你们俩回去吧。接下来，我一个人就好。",
                        npc: 100001,
                    },
                    {
                        id: 10104604,
                        content: "……唔唔……不行！",
                        npc: 200002,
                    },
                    {
                        id: 10104605,
                        content: "魔王大人才不能临阵脱逃，让小仆从看扁。赛琪，你也跟上！",
                        npc: 200002,
                    },
                    {
                        id: 10104606,
                        content: "我……？",
                        npc: 200006,
                    },
                    {
                        id: 10104607,
                        content: "对呀——和本魔王一起扫清这个怪物巢穴！赛琪，我猜你长这么大还没探险过吧？真可惜，你的人生一定是不完整的！",
                        npc: 200002,
                    },
                    {
                        id: 10104608,
                        content: "……啊……",
                        npc: 200006,
                    },
                    {
                        id: 10104609,
                        content: "……好，算我一个。",
                        npc: 200006,
                    },
                ],
            },
            {
                id: 10020304,
                dialogues: [
                    {
                        id: 10104701,
                        content: "锁住了？看我给它敲开！",
                        npc: 200002,
                    },
                    {
                        id: 10104702,
                        content: "（头槌砸门声）",
                    },
                    {
                        id: 10104703,
                        content: "……哇！",
                        npc: 200002,
                    },
                    {
                        id: 10104704,
                        content: "这种厚度的门应该是无法用蛮力打开的。",
                        npc: 100001,
                    },
                    {
                        id: 10104705,
                        content: "那我们在周围转转，看看有没有其它入口吧。",
                        npc: 200006,
                    },
                    {
                        id: 10104706,
                        content: "白，你的脑袋痛吗？我来帮你——",
                        npc: 200006,
                    },
                    {
                        id: 10104707,
                        content: "……吹一下就不疼啦。",
                        npc: 200006,
                    },
                    {
                        id: 10104708,
                        content: "呜呜……你真是个大好人。等本魔王大人彻底占领这里，就封你——",
                        npc: 200002,
                    },
                    {
                        id: 10104709,
                        content: "“温柔的绿衣法师，睿智的月石主宰，第一代格雷姆矿场大公”！",
                        npc: 200002,
                    },
                    {
                        id: 10104710,
                        content: "（之前我是下水道公爵……大公是不是比公爵还要高级一点的爵位啊？）",
                        npc: 100001,
                    },
                    {
                        id: 10104711,
                        content: "（为什么赛琪的爵位比我高？等等，怎么我又在一本正经思考了。）",
                        npc: 100001,
                    },
                ],
            },
            {
                id: 10020305,
                dialogues: [
                    {
                        id: 10104801,
                        content: "“在魔王大人白的指引下，刚刚从远方抵达冰湖城的小仆从，只一天功夫就成为了出色的‘狩月人’。”",
                        npc: 200002,
                    },
                    {
                        id: 10104802,
                        content: "本魔王的传说又可以添上新的篇章啦。",
                        npc: 200002,
                    },
                    {
                        id: 10104803,
                        content: "“狩月人”这个名字还挺特别的……狩猎月亮？",
                        npc: 100001,
                    },
                    {
                        id: 10104804,
                        content: "错了错了！狩月人这个名字和月亮没什么关系，它最早的意思其实是——“月石猎人”！",
                        npc: 200002,
                    },
                    {
                        id: 10104805,
                        content: "嗯，我听说这个职业就是起源于冰湖城。",
                        npc: 200006,
                    },
                    {
                        id: 10104806,
                        content: "似乎是因为，维德弗尼尔山一带有丰富的天之树矿脉，上面的月石可以卖出好价钱……",
                        npc: 200006,
                    },
                    {
                        id: 10104807,
                        content: "没错！所以很久很久以前，就有很多人冒险接受委托去采月石了。",
                        npc: 200002,
                    },
                    {
                        id: 10104808,
                        content: "不过大商人和帝国先后接管了这附近的矿区，普通人就没什么机会碰到月石了……",
                        npc: 200006,
                    },
                    {
                        id: 10104815,
                        content: "再后来，这附近的矿脉也渐渐枯竭掉了，比如现在这座格雷姆废矿……",
                        npc: 200006,
                    },
                    {
                        id: 10104816,
                        content: "对呀，好可惜哦！否则小仆从就能靠卖月石大赚一笔了。",
                        npc: 200002,
                    },
                    {
                        id: 10104809,
                        content: "不过呢，靠接取委托为生的狩月人，还是作为一种特色职业保留了下来，只是委托的种类呢就五花八门啦。",
                        npc: 200002,
                    },
                    {
                        id: 10104810,
                        content: "大到从秽兽的魔爪下保护城市，小到从狗嘴里抢刚出炉的面包……",
                        npc: 200002,
                    },
                    {
                        id: 10104811,
                        content: "和狗抢面包？",
                        npc: 100001,
                    },
                    {
                        id: 10104812,
                        content: "还有一些更可怕的，比如让自己讨厌的家伙再也不会出现……",
                        npc: 200002,
                    },
                    {
                        id: 10104813,
                        content: "可是，跑一趟水仙平原的功夫，面包不是早就被狗吃掉了吗？",
                        npc: 200006,
                    },
                    {
                        id: 10104814,
                        content: "你们两个能不能别再关心狗啦！",
                        npc: 200002,
                    },
                    {
                        id: 10130901,
                        content: "啊，路被那些恶心的黄色晶刺堵住啦！",
                        npc: 200002,
                    },
                    {
                        id: 10130902,
                        content: "刚才那些火药桶应该能派上用场了。",
                        npc: 100001,
                    },
                    {
                        id: 10130903,
                        content: "（离远一些，<H>用子弹射击</>引爆它吧。）",
                        npc: 100001,
                    },
                    {
                        id: 10131001,
                        content: "成功了！……啊，你们要不要紧？魔王大人你怎么蹲在地上，受伤了吗？",
                        npc: 200006,
                    },
                    {
                        id: 10131002,
                        content: "啊？！没、没事，区区区区爆炸而已！我、我是在勘探地形，嘿嘿……",
                        npc: 200002,
                    },
                    {
                        id: 10131003,
                        content: "嘘！",
                        npc: 100001,
                    },
                    {
                        id: 10131004,
                        content: "吼——",
                    },
                    {
                        id: 10131005,
                        content: "……矿坑深处好像有什么动静？",
                        npc: 200006,
                    },
                    {
                        id: 10131006,
                        content: "这么说来，刚刚的笔记还写到，废矿里可能有一种特别的秽兽出没……大家留意些，不要落单。",
                        npc: 100001,
                    },
                ],
            },
            {
                id: 10020308,
                dialogues: [
                    {
                        id: 10131101,
                        content: "快看，中间那块大晶石在发光诶！难道里面有我们要找的群星绮晶？",
                        npc: 200002,
                    },
                    {
                        id: 10131201,
                        content: "吼——",
                    },
                    {
                        id: 10131202,
                        content: "是刚才那个声音！",
                        npc: 200006,
                    },
                    {
                        id: 10131203,
                        content: "哇啊——怎么突然冲上来这么多秽兽！……呃……呃呃……",
                        npc: 200002,
                    },
                    {
                        id: 10131204,
                        content: "也许是被爆炸声引过来的？",
                        npc: 200006,
                    },
                    {
                        id: 10120102,
                        content: "从我大腿上下来，白。你这样我动不了了……你先回冰湖城吧，我不会笑话你的。",
                        npc: 100001,
                    },
                    {
                        id: 10120103,
                        content: "不不不不回去，没没没没有经历过冒冒冒险的人生一定是不不不不不完整的！",
                        npc: 200002,
                    },
                    {
                        id: 10120104,
                        content: "好呀，那我就陪着{nickname}和魔王大人一起，把人生变“完整”一点吧。",
                        npc: 200006,
                    },
                    {
                        id: 10120105,
                        content: "刚刚我应该没有拖后腿……所以接下来，我想也不会有问题的！",
                        npc: 200006,
                    },
                    {
                        id: 10120106,
                        content: "嗯，我们继续往前走吧。",
                        npc: 100001,
                    },
                    {
                        id: 10120107,
                        content: "（只是一些寻常的秽兽，远不如净界岛那一次来得凶险……）",
                        npc: 100001,
                    },
                    {
                        id: 10120108,
                        content: "（仔细回想贝蕾教过的防身技巧，谨慎地挥出每一次剑——可以做到的。）",
                        npc: 100001,
                    },
                    {
                        id: 10131301,
                        content: "亮闪闪魔弹——纯白的救赎！轰！！",
                        npc: 200002,
                    },
                    {
                        id: 10131302,
                        content: "不用“轰”了，秽兽已经被消灭啦。",
                        npc: 200006,
                    },
                    {
                        id: 10131303,
                        content: "噢，是吗！快让我鉴赏一下本大人伟大的战利品——",
                        npc: 200002,
                    },
                    {
                        id: 10131304,
                        content: "卡米拉说过，群星绮晶是“流转着星云的紫色晶体”……这个似乎只是常见的银辉石而已。",
                        npc: 100001,
                    },
                    {
                        id: 10131305,
                        content: "呜……没意思。",
                        npc: 200002,
                    },
                    {
                        id: 10131307,
                        content: "那小仆从有空拿给<H>铁匠皎皎前辈</>瞧瞧吧！至于现在，让我继续带领你们向矿坑深处进发！",
                        npc: 200002,
                    },
                    {
                        id: 10131308,
                        content: "呵呵……遵命，魔王大人。",
                        npc: 200006,
                    },
                    {
                        id: 10131401,
                        content: "这些黄色晶刺里面，竟然还裹着这么多亮晶晶的石头呀！",
                        npc: 200002,
                    },
                    {
                        id: 10131402,
                        content: "就像是被谁当成宝贝，小心翼翼地藏起来了一样……",
                        npc: 200006,
                    },
                    {
                        id: 10131403,
                        content: "哼哼~赛琪该不会也偷藏了什么宝贝？",
                        npc: 200002,
                    },
                    {
                        id: 10131404,
                        content: "嘿嘿……是秘密哦。",
                        npc: 200006,
                    },
                ],
            },
            {
                id: 10020311,
                dialogues: [
                    {
                        id: 10122901,
                        content: "小心！！",
                        npc: 200006,
                    },
                    {
                        id: 10122902,
                        content: "呼，还好没事……咦，前面有路了！",
                        npc: 200006,
                    },
                ],
            },
            {
                id: 10020314,
                dialogues: [
                    {
                        id: 10105202,
                        content: "太好了……！",
                        npc: 200006,
                    },
                    {
                        id: 10105401,
                        content: "奥特赛德？！你装什么傻，绮晶怎么会在你手里？是我家小仆从先——",
                        npc: 200002,
                    },
                    {
                        id: 10105402,
                        content: "它就在这儿，也没长嘴喊谁“主人”。咱们狩月人干活又不是排队买面包，哪有什么先来后到。",
                        npc: 200021,
                    },
                    {
                        id: 10105403,
                        content:
                            "你看着面生，新来的吧？这个道理总会有人教给你们，而我只是凑巧成为了你们的老师。要不，这颗绮晶就当交学费喽？",
                        npc: 200021,
                    },
                    {
                        id: 10105404,
                        content: "请还给我们！这颗绮晶对{nickname}、对我们都很重要！",
                        npc: 200006,
                    },
                ],
            },
            {
                id: 10020316,
                dialogues: [
                    {
                        id: 10105801,
                        content: "赛琪，过来。",
                        npc: 200005,
                    },
                    {
                        id: 10105802,
                        content: "恩里克叔叔……！",
                        npc: 200059,
                    },
                    {
                        id: 10105803,
                        content:
                            "你应该留在修普诺斯之家，而不是跟在这个来路不明的小鬼后面。你不知道{性别：他|她}是什么底细，同样地，{性别：他|她}也没{性别：他|她}想象得那么了解你。",
                        npc: 200005,
                    },
                    {
                        id: 10105804,
                        content: "告诉我，你们去了哪儿？",
                        npc: 200005,
                    },
                    {
                        id: 10105805,
                        content: "格雷姆矿坑。我……想一起帮忙找群星绮晶。",
                        npc: 200059,
                    },
                    {
                        id: 10105806,
                        content: "先别管绮晶。进修普诺斯之家的第一天，我跟你说过什么，还记得吗？",
                        npc: 200005,
                    },
                    {
                        id: 10105807,
                        content: "“不要随便走动，如果一定要去什么地方，先和您说。”",
                        npc: 200059,
                    },
                    {
                        id: 10105808,
                        content: "还记得就好。在做出决定之前，想想我跟你说的话，想想你父母为什么把你托付给我。",
                        npc: 200005,
                    },
                    {
                        id: 10105809,
                        content: "如果耽误了正事，或者被旁人看出来什么……你知道后果。",
                        npc: 200005,
                    },
                    {
                        id: 10105810,
                        content: "……对不起，让您担心了。",
                        npc: 200059,
                    },
                    {
                        id: 10105811,
                        content: "好孩子，不要再有下次了。",
                        npc: 200005,
                    },
                    {
                        id: 10105812,
                        content: "至于你……",
                        npc: 200005,
                    },
                    {
                        id: 10105813,
                        content: "管好你自己的事，少和无关的人牵扯。这对谁都好。",
                        npc: 200005,
                    },
                    {
                        id: 10105701,
                        content: "那边那个不是……恩里克吗？他怎么跑这里来了？",
                        npc: 200002,
                    },
                    {
                        id: 10105901,
                        content: "恩里克这家伙，一开口还是这么让人火大……",
                        npc: 200002,
                    },
                    {
                        id: 10105902,
                        content: "但愿他不会责骂赛琪。",
                        npc: 100001,
                    },
                    {
                        id: 10105903,
                        content: "至于是不是住在宅子里的最后一晚，得要去找奥特赛德了。",
                        npc: 100001,
                    },
                    {
                        id: 10105904,
                        content: "要绕开我说悄悄话对吧？奥特赛德事儿真多。",
                        npc: 200002,
                    },
                    {
                        id: 10105905,
                        content: "哼，我还不稀罕听呢！你走吧，我要去水仙平原玩了。",
                        npc: 200002,
                    },
                ],
            },
        ],
    },
    {
        id: 100204,
        quests: [
            {
                id: 10020401,
                dialogues: [
                    {
                        id: 10105901,
                        content: "恩里克这家伙，一开口还是这么让人火大……",
                        npc: 200002,
                    },
                    {
                        id: 10105902,
                        content: "但愿他不会责骂赛琪。",
                        npc: 100001,
                    },
                    {
                        id: 10105903,
                        content: "至于是不是住在宅子里的最后一晚，得要去找奥特赛德了。",
                        npc: 100001,
                    },
                    {
                        id: 10105904,
                        content: "要绕开我说悄悄话对吧？奥特赛德事儿真多。",
                        npc: 200002,
                    },
                    {
                        id: 10105905,
                        content: "哼，我还不稀罕听呢！你走吧，我要去水仙平原玩了。",
                        npc: 200002,
                    },
                    {
                        id: 10106001,
                        content: "“♪断翅的夜莺，不要继续哭泣……",
                        npc: 200020,
                    },
                    {
                        id: 10106004,
                        content: "奥特赛德！你今天回来得好晚，又去了哪里冒险吗？",
                        npc: 200020,
                    },
                    {
                        id: 10106005,
                        content: "雪狼出没的密林，还是沼泽女巫的塔楼？",
                        npc: 200020,
                    },
                    {
                        id: 10106006,
                        content: "我哪里都没去。今天可是菲娜小姐的生日啊，我一直待在冰湖城。",
                        npc: 200021,
                    },
                    {
                        id: 10106007,
                        content: "不，每次你都这样说，但手臂上总是会多出新的伤痕，咳、咳……",
                        npc: 200020,
                    },
                    {
                        id: 10106008,
                        content: "哎呀，那都是之前的事了，这次是真的没有。看，我这次出门啊，是为了给菲娜带这个。",
                        npc: 200021,
                    },
                    {
                        id: 10106009,
                        content: "这是……蛋糕？可是，我们家附近买不到蛋糕吧。",
                        npc: 200020,
                    },
                    {
                        id: 10106010,
                        content: "我自有办法。要知道，我可是智慧超绝的魔法师啊。别管它了，我还有一个东西给你看。",
                        npc: 200021,
                    },
                    {
                        id: 10106011,
                        content: "你闭上眼睛，从五默数到一。",
                        npc: 200021,
                    },
                    {
                        id: 10106101,
                        content: "什么时候来的？进来坐。",
                        npc: 200021,
                    },
                    {
                        id: 10106102,
                        content: "这位{性别：大哥哥|大姐姐}是……",
                        npc: 200020,
                    },
                    {
                        id: 10106103,
                        content: "算是……新结识的朋友吧。",
                        npc: 200021,
                    },
                    {
                        id: 10106201,
                        content: "…………",
                        npc: 100001,
                    },
                    {
                        id: 10106202,
                        content: "{性别：大哥哥|大姐姐}，怎么了？",
                        npc: 200020,
                    },
                    {
                        id: 10106203,
                        content: "没什么。只是味道很甜，让我想起了一个人……我的家人。她总是会在饭菜里放很多很多糖。",
                        npc: 100001,
                    },
                    {
                        id: 10106204,
                        content: "我们长大的那座小岛，最不缺鱼和盐，但是糖的价格却有些昂贵。所以小的时候，我们是从来都吃不到糖的。",
                        npc: 100001,
                    },
                    {
                        id: 10106205,
                        content: "她只是个比我年长几岁的女孩子，很小的时候，她就去隔壁的渔夫那里做帮工了。",
                        npc: 100001,
                    },
                    {
                        id: 10106206,
                        content: "有一次，那个渔夫不知从哪儿搞来了一些帝国物资，其中就有两罐糖，她便用半个月的工钱换了那么一小罐。",
                        npc: 100001,
                    },
                    {
                        id: 10106207,
                        content:
                            "那是她第一次拿到糖，她自己也不知道要怎么用，只知道那是很好很好的东西。所以，她就在炖鱼的时候，一股脑地全都倒了进去。",
                        npc: 100001,
                    },
                    {
                        id: 10106208,
                        content:
                            "等到我们都长大，到了开始能够赚更多工钱的年纪，糖就不再是那么奢侈的东西了。但是轮到她下厨的时候，她还是会习惯性地放很多糖进去。",
                        npc: 100001,
                    },
                    {
                        id: 10106209,
                        content: "天呐，我感觉我已经闻到了那股腥甜的味儿，太可怕了。她应该向你道歉，或者至少向糖和鱼道歉。",
                        npc: 200021,
                    },
                    {
                        id: 10106210,
                        content: "不，奥特赛德，你没有听懂这个故事。",
                        npc: 200020,
                    },
                    {
                        id: 10106211,
                        content:
                            "那位总是放许多糖的小姐一定有着强大的魔法。所以在{性别：大哥哥|大姐姐}眼里，和她有关的一切都是好的，哪怕是甜到无法下咽的饭菜。",
                        npc: 200020,
                    },
                    {
                        id: 10106212,
                        content: "好吧，菲娜说的都对。所以那个女孩儿现在在哪儿呢？要不你给她打包一份，让她品尝一下正常的甜食。",
                        npc: 200021,
                    },
                    {
                        id: 10106213,
                        content: "我们失散了。昨天……也许是更久之前。我不知道。",
                        npc: 100001,
                    },
                    {
                        id: 10106214,
                        content: "…………",
                        npc: 200021,
                    },
                    {
                        id: 10106215,
                        content: "那你……要去找她！因为家人是像花和树、雪和风那样，拼尽全力也要依靠在一起的人，你一定要找到她。",
                        npc: 200020,
                    },
                    {
                        id: 10106216,
                        content: "嗯，我会的。我会找到她。",
                        npc: 100001,
                    },
                    {
                        id: 10106217,
                        content: "所以，奥特赛德，我需要钱，一笔钱用来住下来，打探消息，还要另一笔钱，随时出发，找到我的家人。",
                        npc: 100001,
                    },
                    {
                        id: 10106218,
                        content: "……菲娜，准备休息吧。我和{nickname}还有其他事要聊——狩月人的杂事。",
                        npc: 200021,
                    },
                    {
                        id: 10106219,
                        content: "嗯，晚安。你们两个都晚安。",
                        npc: 200020,
                    },
                    {
                        id: 10106012,
                        content: "…………",
                        npc: 200020,
                    },
                    {
                        id: 10106013,
                        content: "……是星星。闪闪发亮的星星。",
                        npc: 200020,
                    },
                    {
                        id: 10106014,
                        content: "你看了我写的故事，对不对？",
                        npc: 200020,
                    },
                    {
                        id: 10106015,
                        content: "“夜莺喜欢看天空，但那里除了一片漆黑什么也没有。‘如果能看见星星就好了。’她悄悄许愿：‘哪怕只有一眼。’”",
                        npc: 200020,
                    },
                    {
                        id: 10106016,
                        content: "冰湖城的晚上很少放晴，所以你……变出了星空。",
                        npc: 200020,
                    },
                    {
                        id: 10106017,
                        content: "………",
                        npc: 200021,
                    },
                    {
                        id: 10106018,
                        content: "谢谢你，奥特赛德。你是最棒的魔法师。",
                        npc: 200020,
                    },
                    {
                        id: 10106019,
                        content: "咳，你的“城堡”有客人来了。我去看看。",
                        npc: 200021,
                    },
                ],
            },
            {
                id: 10020402,
                dialogues: [
                    {
                        id: 10114201,
                        content: "你们要早点休息哦。",
                        npc: 200020,
                    },
                ],
            },
            {
                id: 10020403,
                dialogues: [
                    {
                        id: 10106301,
                        content: "该谈谈正事了。我是说，今天在废矿带走群星绮晶的事。",
                        npc: 200021,
                    },
                    {
                        id: 10106302,
                        content: "不好意思啊，当时为了支开旁人和你单独谈谈，用了一些非常手段。",
                        npc: 200021,
                    },
                ],
            },
            {
                id: 10020404,
                dialogues: [
                    {
                        id: 10106401,
                        content: "早点休息吧。明天中午十二点，我在这里等你消息。",
                        npc: 200021,
                    },
                    {
                        id: 10106501,
                        content: "贝蕾……今天发生了很多、很多事。",
                        npc: 100001,
                    },
                    {
                        id: 10106502,
                        content: "你那里能看得见月亮吗，像我看到的月亮一样？",
                        npc: 100001,
                    },
                    {
                        id: 10106503,
                        content: "……明天，我们也会一起活下去的。",
                        npc: 100001,
                    },
                ],
            },
            {
                id: 10020405,
                dialogues: [
                    {
                        id: 10106601,
                        content: "（……天亮了。该动身去修普诺斯之家了。）",
                        npc: 100001,
                    },
                ],
            },
            {
                id: 10020406,
                dialogues: [
                    {
                        id: 20003601,
                        content: "……",
                        npc: 700049,
                    },
                    {
                        id: 10106802,
                        content: "绮晶带来了？",
                        npc: 200005,
                    },
                    {
                        id: 10106902,
                        content: "赛琪！",
                        npc: 100001,
                    },
                    {
                        id: 10106903,
                        content: "{nickname}，是你？！你怎么在这里？恩里克叔叔知道吗……？唉，你先跟我来。",
                        npc: 200006,
                    },
                    {
                        id: 10106904,
                        content: "艾丽莎，你等一小会儿，我很快就回来。",
                        npc: 200006,
                    },
                ],
            },
            {
                id: 10020407,
                dialogues: [
                    {
                        id: 20003501,
                        content: "……",
                        npc: 200045,
                    },
                    {
                        id: 10107001,
                        content: "恩里克叔叔平时不让外面人随便进来，你之前又顶撞过他，要是被他碰见……",
                        npc: 200006,
                    },
                    {
                        id: 10107002,
                        content:
                            "你是为了住处的事情来的吧，别着急，先在这里躲一会儿吧。我再帮你求求恩里克叔叔，他一定会允许你多住上几天的。",
                        npc: 200006,
                    },
                    {
                        id: 10107031,
                        content: "（……虽然这里有很多同龄人，但赛琪看起来依旧有些孤独。有机会的话，在离开冰湖城之前，多来陪她说说话吧。）",
                        npc: 100001,
                    },
                    {
                        id: 10107001,
                        content: "恩里克叔叔平时不让外面人随便进来，你之前又顶撞过他，要是被他碰见……",
                        npc: 200006,
                    },
                    {
                        id: 10107002,
                        content:
                            "你是为了住处的事情来的吧，别着急，先在这里躲一会儿吧。我再帮你求求恩里克叔叔，他一定会允许你多住上几天的。",
                        npc: 200006,
                    },
                ],
            },
            {
                id: 10020408,
                dialogues: [
                    {
                        id: 10107101,
                        content: "（办公室的门已经有些年头，但光洁锃亮，一丝不染。门把手拧下去纹丝不动。显然，它被反锁了。）",
                    },
                    {
                        id: 10107102,
                        content: "……不要碰那扇门。",
                        npc: 200019,
                    },
                    {
                        id: 10107103,
                        content: "办公室……是禁区。除了恩里克·埃塞尔莱德先生，任何人都不能进去。",
                        npc: 200019,
                    },
                    {
                        id: 10114301,
                        content: "如果恩里克叔叔同意的话，你可以再来找我玩吗？",
                        npc: 200006,
                    },
                ],
            },
            {
                id: 10020409,
                dialogues: [
                    {
                        id: 10107201,
                        content: "……不行，还是不够干净。还得再擦一遍……",
                        npc: 200019,
                    },
                    {
                        id: 10107301,
                        content: "……为什么？不止你离开了我，连你送我的怀表都停摆了……",
                        npc: 700049,
                    },
                    {
                        id: 10107302,
                        content: "……没关系……很快，我们就可以见面了……亨特……",
                        npc: 700049,
                    },
                ],
            },
            {
                id: 10020410,
                dialogues: [
                    {
                        id: 10107401,
                        content: "离我远一点……我什么都不知道！！",
                        npc: 700049,
                    },
                    {
                        id: 10107501,
                        content: "狩月人。",
                        npc: 200005,
                    },
                    {
                        id: 10107502,
                        content: "我分析过了，绮晶成分属实，纯度也和我之前的那一小份样本没有差别——你做得很好。",
                        npc: 200005,
                    },
                    {
                        id: 10107503,
                        content: "来，给你。三千银币，还有这封是签过字的收据，交给卡米拉女士，她会给你抵押金，一千银币。",
                        npc: 200005,
                    },
                    {
                        id: 10107504,
                        content: "至于这个是……一条项链，它的价格远不止一千银币。你拿去卖了吧，或者去典当行当了也可以。",
                        npc: 200005,
                    },
                    {
                        id: 10107505,
                        content: "好，这样交易就完成了。另外，那栋宅邸，让我再多租住几日吧。",
                        npc: 100001,
                    },
                    {
                        id: 10107506,
                        content: "…………",
                        npc: 200005,
                    },
                ],
            },
            {
                id: 10020412,
                dialogues: [
                    {
                        id: 10107801,
                        content: "调查得怎么样？",
                        npc: 200021,
                    },
                    {
                        id: 10107802,
                        content: "没能查清楚他的底细，但是也有一些收获：",
                        npc: 100001,
                    },
                    {
                        id: 10107601,
                        content: "（虽然没能进成办公室，但也得到了一些有用的消息。去找奥特赛德吧。）",
                        npc: 100001,
                    },
                ],
            },
        ],
    },
    {
        id: 100205,
        quests: [
            {
                id: 10020502,
                dialogues: [
                    {
                        id: 10108101,
                        content: "如猎犬终于走出蛰伏的巢穴，十三军团在缄默中展开了漆黑的狩猎。",
                    },
                    {
                        id: 10108102,
                        content: "而在远方的冰湖城，",
                    },
                    {
                        id: 10108103,
                        content: "一位新手也在慢慢熟悉如何成为可靠的猎人。",
                    },
                    {
                        id: 10108001,
                        content: "西比尔大人。",
                        npc: 100006,
                    },
                    {
                        id: 10108002,
                        content: "一个坏消息，和一个——呃，或许应该也算是坏消息。",
                        npc: 100006,
                    },
                    {
                        id: 10108003,
                        content: "先听更坏的。",
                        npc: 100005,
                    },
                    {
                        id: 10108004,
                        content: "留守在净界岛的分队已经在周边搜索了三天，但始终未发现零号身边那个{性别：少年|女孩}的行踪。",
                        npc: 100006,
                    },
                    {
                        id: 10108005,
                        content:
                            "我们在{性别：他|她}坠崖后即刻对附近海域进行了搜索，理论上{性别：他|她}无论是否存活，都不应该漂流到更远的地方，除非……",
                        npc: 100006,
                    },
                    {
                        id: 10108006,
                        content: "嗯？",
                        npc: 100005,
                    },
                    {
                        id: 10108007,
                        content: "……有什么人救走了{性别：他|她}。",
                        npc: 100006,
                    },
                    {
                        id: 10108008,
                        content: "……继续调查周边岛屿的居民。任何嫌疑人和目击者都不要放过。",
                        npc: 100005,
                    },
                    {
                        id: 10108009,
                        content: "已经在这么做了。我们还在持续扩大搜索范围。不过我斗胆一问——",
                        npc: 100006,
                    },
                    {
                        id: 10130101,
                        content: "如果真的得到了{性别：他|她}——也就是和鸣之力的持有者，您打算如何处置？",
                        npc: 100006,
                    },
                    {
                        id: 10130102,
                        content: "完全觉醒的和鸣之力可以对一切“骸”施加干预……但这种力量完全依赖于持有者本人的意志。",
                        npc: 100006,
                    },
                    {
                        id: 10130103,
                        content:
                            "也就是说，除非{性别：他|她}本人自愿协助，否则得到{性别：他|她}对帝国来说并无意义，甚至可能成为祸端。就像当年……",
                        npc: 100006,
                    },
                    {
                        id: 10130104,
                        content: "那就和当年一样抹除掉。无论如何，这份力量不能落入帝国之外，尤其是艾利西安。好了，另一个坏消息呢？",
                        npc: 100005,
                    },
                    {
                        id: 10108013,
                        content: "是关于您让我调查的另一件事。",
                        npc: 100006,
                    },
                    {
                        id: 10108014,
                        content: "在搜寻过程中，我在附近的荒岛遇到了乘船逃亡至此的村民——然后，我们发现了一个有趣的“小东西”。",
                        npc: 100006,
                    },
                    {
                        id: 10108015,
                        content: "就像是您正品尝着司空见惯的浓汤，却发现刚放进去的汤匙突然褪去漂亮的银，变成了可怖的漆黑——",
                        npc: 100006,
                    },
                    {
                        id: 10108016,
                        content: "挑重点说，省去那些花里胡哨的。",
                        npc: 100005,
                    },
                    {
                        id: 10108017,
                        content: "啊……是、是。那个有趣的小东西，便是<H>“时间差”</>。",
                        npc: 100006,
                    },
                    {
                        id: 10108018,
                        content:
                            "村民们告诉我，净界岛的秽兽此前一直住在山里，并没有表现出强烈的攻击性；但在我们抵达的<H>两天前</>，却突然发疯般地攻击村民。",
                        npc: 100006,
                    },
                    {
                        id: 10108019,
                        content: "“两天前”……",
                        npc: 100005,
                    },
                    {
                        id: 10108020,
                        content: "……看来您已经猜到了。这太巧合了，不是吗？因为计划临时有变，我们刚好比原定的登岛时期迟了两天。",
                        npc: 100006,
                    },
                    {
                        id: 10108021,
                        content: "而有能力操纵秽兽行刺的，只有<W>神弃者同盟</>。",
                        npc: 100006,
                    },
                    {
                        id: 10108022,
                        content: "……无论是不是同盟，十三军团都混进了不该有的东西。",
                        npc: 100005,
                    },
                    {
                        id: 10108023,
                        content: "这么多年过去，虫子们又开始不安分起来……",
                        npc: 100005,
                    },
                    {
                        id: 10108024,
                        content: "该彻底踩碎了。",
                        npc: 100005,
                    },
                    {
                        id: 10115501,
                        content: "与此同时，皇都·迪斯玛尼亚——",
                    },
                ],
            },
            {
                id: 10020503,
                dialogues: [
                    {
                        id: 10108201,
                        content: "我得先调试一下“那玩意儿”。时候还早，你先随便拿路边的野兽练练手吧。小矮子还在城里帮我们放哨，别走太远。",
                        npc: 200021,
                    },
                    {
                        id: 10108202,
                        content: "我提前布置了些陷阱。别看是废品做的，可好使了。",
                        npc: 200021,
                    },
                    {
                        id: 10108203,
                        content: "不过你省着点用，毕竟材料不太结实，一不留神踩碎了也是有可能的，哈哈……",
                        npc: 200021,
                    },
                ],
            },
            {
                id: 10020504,
                dialogues: [
                    {
                        id: 10116901,
                        content: "地上这些是……奥特赛德布置的陷阱。",
                        npc: 100001,
                    },
                    {
                        id: 10116902,
                        content: "……还挺厉害的。奥特赛德竟然还会这种手艺。",
                        npc: 100001,
                    },
                ],
            },
            {
                id: 10020505,
                dialogues: [
                    {
                        id: 10117001,
                        content: "这是怎么回事？",
                        npc: 100001,
                    },
                    {
                        id: 10117002,
                        content: "啊哈，真不巧，调试的时候弄了点动静，把这些小家伙引来了……",
                        npc: 200021,
                    },
                    {
                        id: 10117003,
                        content: "朋友，快来搭把手！",
                        npc: 200021,
                    },
                    {
                        id: 10117004,
                        content: "你这不是活该吗！……算了。",
                        npc: 100001,
                    },
                    {
                        id: 10108301,
                        content: "呼……呼……",
                        npc: 100001,
                    },
                    {
                        id: 10108302,
                        content: "不错，这几天进步很快！不过，还有提升的空间。",
                        npc: 200021,
                    },
                    {
                        id: 10108303,
                        content:
                            "比如那些大型的野兽啊秽兽啊，跑得快但体格笨重。你就可以找墙壁、树干什么的，站在前面挑衅，它冲过来就马上闪开，让它自己一头撞晕。",
                        npc: 200021,
                    },
                ],
            },
            {
                id: 10020506,
                dialogues: [
                    {
                        id: 10113501,
                        content: "秽兽？！",
                        npc: 100001,
                    },
                    {
                        id: 10113502,
                        content: "你就把这个正在嗷嗷乱叫的破机器当做你想要保护的人，把这些秽兽当做要攻击她的家伙。",
                        npc: 200021,
                    },
                    {
                        id: 10113503,
                        content: "想办法保护它，别让秽兽把它拆了。",
                        npc: 200021,
                    },
                    {
                        id: 10113504,
                        content: "你好歹等我准备好再——",
                        npc: 100001,
                    },
                    {
                        id: 10113505,
                        content: "我们狩月人就是会遇到很多突发情况嘛。别慌、别慌，我也来帮你一把就是了！",
                        npc: 200021,
                    },
                    {
                        id: 10108301,
                        content: "呼……呼……",
                        npc: 100001,
                    },
                    {
                        id: 10108302,
                        content: "不错，这几天进步很快！不过，还有提升的空间。",
                        npc: 200021,
                    },
                    {
                        id: 10108303,
                        content:
                            "比如那些大型的野兽啊秽兽啊，跑得快但体格笨重。你就可以找墙壁、树干什么的，站在前面挑衅，它冲过来就马上闪开，让它自己一头撞晕。",
                        npc: 200021,
                    },
                    {
                        id: 10113801,
                        content: "任务完成",
                    },
                    {
                        id: 10116801,
                        content: "我们开始狩猎吧！",
                        npc: 200021,
                    },
                ],
            },
            {
                id: 10020507,
                dialogues: [
                    {
                        id: 10108337,
                        content: "不错嘛，体术比我想象中精进得更快。这么快就已经是独当一面的狩月人了，唉，还是年轻人有本事。",
                        npc: 200021,
                    },
                    {
                        id: 10108338,
                        content: "走吧，太阳快下山了，该回城和小矮子会合了，不知道她那边盯梢顺不顺利。",
                        npc: 200021,
                    },
                ],
            },
        ],
    },
    {
        id: 100206,
        quests: [
            {
                id: 10020602,
                dialogues: [
                    {
                        id: 10124201,
                        content: "应该就是这个水潭了……他果然在！",
                        npc: 200002,
                    },
                ],
            },
            {
                id: 10020604,
                dialogues: [
                    {
                        id: 10108801,
                        content: "与此同时，修普诺斯之家——",
                    },
                    {
                        id: 10108801,
                        content: "与此同时，修普诺斯之家——",
                    },
                    {
                        id: 10108901,
                        content: "咳、咳！",
                        npc: 200021,
                    },
                    {
                        id: 10108902,
                        content: "真麻烦，蹭了一身灰……回去菲娜又要大惊小怪了。",
                        npc: 200021,
                    },
                    {
                        id: 10108903,
                        content: "不过还好，总算是顺利进来了。",
                        npc: 200021,
                    },
                    {
                        id: 10108914,
                        content: "恩里克叔叔，您回来了。我已经倒好了热水，请您喝了，暖暖身子……",
                    },
                    {
                        id: 10108915,
                        content: "嗯。",
                    },
                    {
                        id: 10108916,
                        content: "（糟了，恩里克回来了……！）",
                        npc: 200021,
                    },
                ],
            },
            {
                id: 10020605,
                dialogues: [
                    {
                        id: 10109001,
                        content: "……你是说，赛琪会有危险？！",
                        npc: 200002,
                    },
                    {
                        id: 10109002,
                        content: "失踪的亨特就出现在了那份名单上……我猜他的下场多半不太妙。而且，你那个叫赛琪的朋友很可能是下一个。",
                        npc: 200021,
                    },
                    {
                        id: 10109003,
                        content:
                            "啧，恩里克回来的真不是时候，如果能再多几分钟……怪我，撬烟囱锁浪费了太长时间。这**养的！我就知道他不是什么好东西。",
                        npc: 200021,
                    },
                    {
                        id: 10109004,
                        content: "这可怎么办呀？{nickname}，赛琪是个好孩子，我们得想办法救她！",
                        npc: 200002,
                    },
                    {
                        id: 10109005,
                        content: "……我现在就去修普诺斯之家。",
                        npc: 100001,
                    },
                    {
                        id: 10109006,
                        content: "不要冲动。我们还有五天时间，先回去做好准备吧。",
                        npc: 200021,
                    },
                    {
                        id: 10109007,
                        content: "不，救人早去总比晚去好。我不能再一次……看着……",
                        npc: 100001,
                    },
                    {
                        id: 20003701,
                        content: "一日后——",
                    },
                ],
            },
            {
                id: 10020607,
                dialogues: [
                    {
                        id: 10109101,
                        content: "（不要打草惊蛇，若无其事地去找赛琪吧。）",
                        npc: 100001,
                    },
                    {
                        id: 10109301,
                        content: "是你。",
                        npc: 200005,
                    },
                    {
                        id: 10109302,
                        content: "发生了什么事？赛琪怎么了？",
                        npc: 100001,
                    },
                    {
                        id: 10109303,
                        content: "她身体抱恙，要早日治疗。",
                        npc: 200005,
                    },
                    {
                        id: 10109304,
                        content: "赛琪需要一段时间休息。没什么要紧事，你这几天就不要来打扰她了。",
                        npc: 200005,
                    },
                    {
                        id: 10109305,
                        content: "赛琪，你要和我……一起走走吗？",
                        npc: 100001,
                    },
                    {
                        id: 10109306,
                        content: "我们一起去外面散散心。不要怕。",
                        npc: 100001,
                    },
                    {
                        id: 10109307,
                        content: "……{nickname}。",
                        npc: 200006,
                    },
                    {
                        id: 10109308,
                        content: "……我想，去泪湖。",
                        npc: 200006,
                    },
                    {
                        id: 10109309,
                        content: "好，我陪你。",
                        npc: 100001,
                    },
                    {
                        id: 10109310,
                        content: "恩里克叔叔，请允许我出去一会儿。请放心，我一定会回来，不会花太长时间。",
                        npc: 200006,
                    },
                    {
                        id: 10109311,
                        content: "…………",
                        npc: 200005,
                    },
                    {
                        id: 10109312,
                        content: "去吧。记住我嘱咐过你的。否则……你知道后果。",
                        npc: 200005,
                    },
                    {
                        id: 10109313,
                        content: "……我明白。",
                        npc: 200006,
                    },
                    {
                        id: 10109314,
                        content: "放老实些。如果赛琪出了什么事，你没有第二条命离开冰湖城。",
                        npc: 200005,
                    },
                    {
                        id: 10109315,
                        content: "给我记住。",
                        npc: 200005,
                    },
                    {
                        id: 10109201,
                        content: "赛琪？",
                        npc: 100001,
                    },
                ],
            },
            {
                id: 10020608,
                dialogues: [
                    {
                        id: 10114401,
                        content: "放老实点，别管与你无关的事。",
                        npc: 200005,
                    },
                ],
            },
            {
                id: 10020612,
                dialogues: [
                    {
                        id: 10110001,
                        content: "（“无法离开冰湖城”……是什么意思？）",
                        npc: 100001,
                    },
                    {
                        id: 10110002,
                        content: "（……想不明白。只能回去等赛琪的消息了。）",
                        npc: 100001,
                    },
                    {
                        id: 10125201,
                        content: "（那边那个人好像有点眼熟……是谁来着？）",
                        npc: 100001,
                    },
                ],
            },
            {
                id: 10020615,
                dialogues: [
                    {
                        id: 10110201,
                        content: "啊啊……别打了，我投降！但真的不是我干的！！",
                        npc: 200004,
                    },
                    {
                        id: 10110202,
                        content: "是你？",
                        npc: 100001,
                    },
                    {
                        id: 10110203,
                        content:
                            "行吧。您的人我放心。但千万记住，一定要看好{性别：他|她}，千万别在城里惹是生非，不然长官怪罪下来，咱俩就都有大麻烦了。",
                        npc: 200004,
                    },
                    {
                        id: 10110204,
                        content: "怎么刚好被你给逮到了……唉，{性别：大哥|大姐}你行行好，千万别说出去啊。",
                        npc: 200004,
                    },
                    {
                        id: 10110205,
                        content: "这个人是……",
                        npc: 100001,
                    },
                    {
                        id: 10110206,
                        content: "停手停手，钱袋还你！我也是好几天没吃顿饱饭了，一时糊涂才……唉，我错了我错了！",
                        npc: 200004,
                    },
                    {
                        id: 10110207,
                        content: "你处决了他？他……还罪不至死吧。",
                        npc: 100001,
                    },
                    {
                        id: 10110208,
                        content: "你小点声！都说了不是我干的，我只是把他的遗体悄悄运出来而已。",
                        npc: 200004,
                    },
                    {
                        id: 10110209,
                        content: "我叫凯文，你见过的，是冰湖城外围卫戍部队的……这个倒霉蛋是哈尔，我以前的邻居，我们打小就认识了。",
                        npc: 200004,
                    },
                    {
                        id: 10110210,
                        content:
                            "这家伙母亲去得早，打过的架不比吃过的饭少。虽然家人禁止我和卡戎来往，但我想着好歹也是一起玩到大的，所以偶尔会帮他点忙……",
                        npc: 200004,
                    },
                    {
                        id: 10110211,
                        content:
                            "后来有一天他鬼鬼祟祟地来找我。我以为他又欠了一屁股债，或者又被酒鬼老爹打了，来找我诉苦。但我没想到他告诉我，他出现了“<W>秽蚀</>”的征兆……",
                        npc: 200004,
                    },
                    {
                        id: 10110212,
                        content: "“秽蚀”到底是什么？",
                        npc: 100001,
                    },
                    {
                        id: 10110213,
                        content: "身为卡戎，不知道“秽蚀”是什么？你到底是不是帝国人啊？",
                        npc: 200004,
                    },
                    {
                        id: 10110301,
                        content: "喂，怎么这就走了？你去哪儿啊，喂！",
                        npc: 200004,
                    },
                    {
                        id: 10110302,
                        content: "你答应过不会说出去的吧？！你得说话算话——",
                        npc: 200004,
                    },
                ],
            },
            {
                id: 10020651,
                dialogues: [
                    {
                        id: 10108501,
                        content: "你们终于回来啦！",
                        npc: 200064,
                    },
                    {
                        id: 10108502,
                        content:
                            "奥特赛德真是个坏东西，非得让我在这里盯梢。本魔王的一身本事是为了带领你们打猎，才不是为了在这里盯着那个阴沉大叔！",
                        npc: 200064,
                    },
                    {
                        id: 10108503,
                        content:
                            "这不是看魔王大人您天赋异禀，更方便隐匿行踪嘛。您看我们这么五大三粗的，要是恩里克出来，随便扫一眼不就暴露了。",
                        npc: 200021,
                    },
                    {
                        id: 10108504,
                        content: "哼，居然知道夸本大人，看来你还是挺聪明——不对！你是在变着法子说我个子矮吧！！",
                        npc: 200064,
                    },
                    {
                        id: 10108505,
                        content: "没有没有，怎么会，您最高大威猛了，冰湖城门就是专门为了您才修这么高——",
                        npc: 200021,
                    },
                    {
                        id: 10108506,
                        content: "嘘！……他出来了。",
                        npc: 200021,
                    },
                    {
                        id: 10108507,
                        content: "居然真的是8点耶！如果他再转行，不如直接去广场专门报时！",
                        npc: 200064,
                    },
                    {
                        id: 10108508,
                        content: "……按原计划行事。我和白负责跟踪恩里克，奥特赛德从烟囱潜入恩里克的办公室。事成后，在奥特赛德家门口会面。",
                        npc: 100001,
                    },
                    {
                        id: 10108509,
                        content: "明白。",
                        npc: 200021,
                    },
                    {
                        id: 10110201,
                        content: "啊啊……别打了，我投降！但真的不是我干的！！",
                        npc: 200004,
                    },
                    {
                        id: 10110202,
                        content: "是你？",
                        npc: 100001,
                    },
                    {
                        id: 10110203,
                        content:
                            "行吧。您的人我放心。但千万记住，一定要看好{性别：他|她}，千万别在城里惹是生非，不然长官怪罪下来，咱俩就都有大麻烦了。",
                        npc: 200004,
                    },
                    {
                        id: 10110204,
                        content: "怎么刚好被你给逮到了……唉，{性别：大哥|大姐}你行行好，千万别说出去啊。",
                        npc: 200004,
                    },
                    {
                        id: 10110205,
                        content: "这个人是……",
                        npc: 100001,
                    },
                    {
                        id: 10110206,
                        content: "停手停手，钱袋还你！我也是好几天没吃顿饱饭了，一时糊涂才……唉，我错了我错了！",
                        npc: 200004,
                    },
                    {
                        id: 10110207,
                        content: "你处决了他？他……还罪不至死吧。",
                        npc: 100001,
                    },
                    {
                        id: 10110208,
                        content: "你小点声！都说了不是我干的，我只是把他的遗体悄悄运出来而已。",
                        npc: 200004,
                    },
                    {
                        id: 10110209,
                        content: "我叫凯文，你见过的，是冰湖城外围卫戍部队的……这个倒霉蛋是哈尔，我以前的邻居，我们打小就认识了。",
                        npc: 200004,
                    },
                    {
                        id: 10110210,
                        content:
                            "这家伙母亲去得早，打过的架不比吃过的饭少。虽然家人禁止我和卡戎来往，但我想着好歹也是一起玩到大的，所以偶尔会帮他点忙……",
                        npc: 200004,
                    },
                    {
                        id: 10110211,
                        content:
                            "后来有一天他鬼鬼祟祟地来找我。我以为他又欠了一屁股债，或者又被酒鬼老爹打了，来找我诉苦。但我没想到他告诉我，他出现了“<W>秽蚀</>”的征兆……",
                        npc: 200004,
                    },
                    {
                        id: 10110212,
                        content: "“秽蚀”到底是什么？",
                        npc: 100001,
                    },
                    {
                        id: 10110213,
                        content: "身为卡戎，不知道“秽蚀”是什么？你到底是不是帝国人啊？",
                        npc: 200004,
                    },
                    {
                        id: 10110215,
                        content: "哦对，卡米拉提到过，那也难怪吧。",
                        npc: 200004,
                    },
                    {
                        id: 10110218,
                        content: "<W>秽蚀</>是一种只在卡戎身上出现的特殊疾病，摊上就无药可救。",
                        npc: 200004,
                    },
                    {
                        id: 10110219,
                        content: "你们这群人，差不多十几岁的时候吧，都会觉醒个什么力量，但也不是每个人都那么顺利。",
                        npc: 200004,
                    },
                    {
                        id: 10110220,
                        content:
                            "总有几个倒霉蛋不知道哪根筋搭错了，变成<W>秽兽</>——但要说威力啊，外面的普通秽兽连它们一根指头都不如，卫戍部队一整支小队都未必能搞定。",
                        npc: 200004,
                    },
                    {
                        id: 10110221,
                        content: "要是秽蚀者出现在城里，那附近一大片人都要自求多福喽。",
                        npc: 200004,
                    },
                    {
                        id: 10110222,
                        content:
                            "所以你明白为什么那么多索拉人恨卡戎了吧？大家都说是因为卡戎的血管里流淌着邪恶的魔力，所以才会招惹来这种祸端。而秽蚀者，就是所有卡戎中最邪恶的。",
                        npc: 200004,
                    },
                    {
                        id: 10110223,
                        content: "这话吧，说实话我也不是那么信，但是……唉！总之，这么稀罕的事，怎么就摊在哈尔头上了呢。",
                        npc: 200004,
                    },
                    {
                        id: 10110224,
                        content:
                            "半月前那家伙慌慌张张来找我，但我哪敢收留他！包庇秽蚀者跟包庇神奇同盟一样是重罪，一不留神小命就丢了。我只能给点吃的，让他自己想办法去。",
                        npc: 200004,
                    },
                    {
                        id: 10110225,
                        content: "后来听说他偷人家东西被人抓了现行，又被发现是秽蚀者，直接送治安署去了。",
                        npc: 200004,
                    },
                    {
                        id: 10110217,
                        content: "啊啊不问了不问了，你千万别说出去啊！",
                        npc: 200004,
                    },
                    {
                        id: 10110218,
                        content: "<W>秽蚀</>是一种只在卡戎身上出现的特殊疾病，摊上就无药可救。",
                        npc: 200004,
                    },
                    {
                        id: 10110219,
                        content: "你们这群人，差不多十几岁的时候吧，都会觉醒个什么力量，但也不是每个人都那么顺利。",
                        npc: 200004,
                    },
                    {
                        id: 10110220,
                        content:
                            "总有几个倒霉蛋不知道哪根筋搭错了，变成<W>秽兽</>——但要说威力啊，外面的普通秽兽连它们一根指头都不如，卫戍部队一整支小队都未必能搞定。",
                        npc: 200004,
                    },
                    {
                        id: 10110221,
                        content: "要是秽蚀者出现在城里，那附近一大片人都要自求多福喽。",
                        npc: 200004,
                    },
                    {
                        id: 10110222,
                        content:
                            "所以你明白为什么那么多索拉人恨卡戎了吧？大家都说是因为卡戎的血管里流淌着邪恶的魔力，所以才会招惹来这种祸端。而秽蚀者，就是所有卡戎中最邪恶的。",
                        npc: 200004,
                    },
                    {
                        id: 10110223,
                        content: "这话吧，说实话我也不是那么信，但是……唉！总之，这么稀罕的事，怎么就摊在哈尔头上了呢。",
                        npc: 200004,
                    },
                    {
                        id: 10110224,
                        content:
                            "半月前那家伙慌慌张张来找我，但我哪敢收留他！包庇秽蚀者跟包庇神奇同盟一样是重罪，一不留神小命就丢了。我只能给点吃的，让他自己想办法去。",
                        npc: 200004,
                    },
                    {
                        id: 10110225,
                        content: "后来听说他偷人家东西被人抓了现行，又被发现是秽蚀者，直接送治安署去了。",
                        npc: 200004,
                    },
                    {
                        id: 10110201,
                        content: "啊啊……别打了，我投降！但真的不是我干的！！",
                        npc: 200004,
                    },
                    {
                        id: 10110202,
                        content: "是你？",
                        npc: 100001,
                    },
                    {
                        id: 10110203,
                        content:
                            "行吧。您的人我放心。但千万记住，一定要看好{性别：他|她}，千万别在城里惹是生非，不然长官怪罪下来，咱俩就都有大麻烦了。",
                        npc: 200004,
                    },
                    {
                        id: 10110204,
                        content: "怎么刚好被你给逮到了……唉，{性别：大哥|大姐}你行行好，千万别说出去啊。",
                        npc: 200004,
                    },
                    {
                        id: 10110205,
                        content: "这个人是……",
                        npc: 100001,
                    },
                    {
                        id: 10110206,
                        content: "停手停手，钱袋还你！我也是好几天没吃顿饱饭了，一时糊涂才……唉，我错了我错了！",
                        npc: 200004,
                    },
                    {
                        id: 10110207,
                        content: "你处决了他？他……还罪不至死吧。",
                        npc: 100001,
                    },
                    {
                        id: 10110208,
                        content: "你小点声！都说了不是我干的，我只是把他的遗体悄悄运出来而已。",
                        npc: 200004,
                    },
                    {
                        id: 10110209,
                        content: "我叫凯文，你见过的，是冰湖城外围卫戍部队的……这个倒霉蛋是哈尔，我以前的邻居，我们打小就认识了。",
                        npc: 200004,
                    },
                    {
                        id: 10110210,
                        content:
                            "这家伙母亲去得早，打过的架不比吃过的饭少。虽然家人禁止我和卡戎来往，但我想着好歹也是一起玩到大的，所以偶尔会帮他点忙……",
                        npc: 200004,
                    },
                    {
                        id: 10110211,
                        content:
                            "后来有一天他鬼鬼祟祟地来找我。我以为他又欠了一屁股债，或者又被酒鬼老爹打了，来找我诉苦。但我没想到他告诉我，他出现了“<W>秽蚀</>”的征兆……",
                        npc: 200004,
                    },
                    {
                        id: 10110212,
                        content: "“秽蚀”到底是什么？",
                        npc: 100001,
                    },
                    {
                        id: 10110213,
                        content: "身为卡戎，不知道“秽蚀”是什么？你到底是不是帝国人啊？",
                        npc: 200004,
                    },
                ],
            },
        ],
    },
    {
        id: 100207,
        quests: [
            {
                id: 10020701,
                dialogues: [
                    {
                        id: 10110501,
                        content: "都备妥了。",
                        npc: 200021,
                    },
                    {
                        id: 10110502,
                        content:
                            "我和内城的朋友通过气了，今夜他的马车会停在这附近。等赛琪出来，我们先送她到城外避避风头。给恩里克八个胆子，他也不敢去打劫贵族老爷的马车。",
                        npc: 200021,
                    },
                    {
                        id: 10110503,
                        content: "然后……再想办法看看接下来怎么办吧。",
                        npc: 200021,
                    },
                    {
                        id: 10110504,
                        content: "你还挺神通广大。",
                        npc: 100001,
                    },
                    {
                        id: 10110505,
                        content: "哈，总得对得起我这些年经历的**事。不过，你确定她会来？",
                        npc: 200021,
                    },
                    {
                        id: 10110506,
                        content: "……我不知道。总之，她不来的话，就按照第二计划行事。",
                        npc: 100001,
                    },
                    {
                        id: 10110507,
                        content: "直接冲进修普诺斯之家，彻底揭露恩里克的罪行——哈，听起来像是流行小说里的侠盗。",
                        npc: 200021,
                    },
                    {
                        id: 10110508,
                        content:
                            "不过，你做好心理准备。即使我们今天救了赛琪，她也……支持不了太久了。我们在废矿里看到的那家伙，就是她最终的归宿。",
                        npc: 200021,
                    },
                    {
                        id: 10110509,
                        content: "……先走一步算一步吧。",
                        npc: 100001,
                    },
                    {
                        id: 10110510,
                        content: "……唉，说起来，就算是秽蚀者，不是一直有卫戍部队处置吗？恩里克到底经历过什么，才会做到这种地步……",
                        npc: 200021,
                    },
                    {
                        id: 10110511,
                        content: "我大概……猜到了原因。",
                        npc: 100001,
                    },
                    {
                        id: 20001601,
                        content: "嗯等。",
                    },
                    {
                        id: 20001602,
                        content: "等不耐烦了。",
                    },
                    {
                        id: 20001603,
                        content: "赛琪怎么还没出来，我们去瞅瞅吧。",
                    },
                    {
                        id: 20002901,
                        content: "（已经和奥特赛德和白交代好了今天发生的所有事。）",
                    },
                    {
                        id: 20002902,
                        content: "（接下来能做的，就只有在说好的地方……耐心等待。）",
                    },
                    {
                        id: 20002901,
                        content: "（已经和奥特赛德和白交代好了今天发生的所有事。）",
                    },
                    {
                        id: 20002902,
                        content: "（接下来能做的，就只有在说好的地方……耐心等待。）",
                    },
                    {
                        id: 10115801,
                        content: "（已经和奥特赛德和白交代好了今天发生的所有事。）",
                        npc: 100001,
                    },
                    {
                        id: 10115802,
                        content: "（接下来能做的，就只有在说好的地方……耐心等待。）",
                        npc: 100001,
                    },
                    {
                        id: 10110501,
                        content: "都备妥了。",
                        npc: 200021,
                    },
                    {
                        id: 10110502,
                        content:
                            "我和内城的朋友通过气了，今夜他的马车会停在这附近。等赛琪出来，我们先送她到城外避避风头。给恩里克八个胆子，他也不敢去打劫贵族老爷的马车。",
                        npc: 200021,
                    },
                    {
                        id: 10110503,
                        content: "然后……再想办法看看接下来怎么办吧。",
                        npc: 200021,
                    },
                    {
                        id: 10110504,
                        content: "你还挺神通广大。",
                        npc: 100001,
                    },
                    {
                        id: 10110505,
                        content: "哈，总得对得起我这些年经历的**事。不过，你确定她会来？",
                        npc: 200021,
                    },
                    {
                        id: 10110506,
                        content: "……我不知道。总之，她不来的话，就按照第二计划行事。",
                        npc: 100001,
                    },
                    {
                        id: 10110507,
                        content: "直接冲进修普诺斯之家，彻底揭露恩里克的罪行——哈，听起来像是流行小说里的侠盗。",
                        npc: 200021,
                    },
                    {
                        id: 10110508,
                        content:
                            "不过，你做好心理准备。即使我们今天救了赛琪，她也……支持不了太久了。我们在废矿里看到的那家伙，就是她最终的归宿。",
                        npc: 200021,
                    },
                    {
                        id: 10110509,
                        content: "……先走一步算一步吧。",
                        npc: 100001,
                    },
                    {
                        id: 10110510,
                        content: "……唉，说起来，就算是秽蚀者，不是一直有卫戍部队处置吗？恩里克到底经历过什么，才会做到这种地步……",
                        npc: 200021,
                    },
                    {
                        id: 10110511,
                        content: "我大概……猜到了原因。",
                        npc: 100001,
                    },
                ],
            },
            {
                id: 10020702,
                dialogues: [
                    {
                        id: 10110601,
                        content: "你们终于来了！！吓死白了！",
                        npc: 200002,
                    },
                    {
                        id: 10110602,
                        content: "刚才不会是你在鬼叫吧？出什么事了？",
                        npc: 200021,
                    },
                    {
                        id: 10110603,
                        content:
                            "我不是按你们说的一直在这里观察情况嘛……然后，真的像你们说的那样，赛琪出来了！我就上去拉住她，准备带她去找你们。",
                        npc: 200002,
                    },
                    {
                        id: 10110604,
                        content:
                            "可她突然扑了过来，狠狠地抓向我……还好本大人闪得快！但是……那真的是赛琪吗？那个人一点都不像平时的她，就像是……一头野兽！",
                        npc: 200002,
                    },
                    {
                        id: 10110605,
                        content: "糟了……秽蚀已经开始了！",
                        npc: 200021,
                    },
                ],
            },
            {
                id: 10020703,
                dialogues: [
                    {
                        id: 10114601,
                        content: "拜托了，请跟我来！",
                        npc: 200019,
                    },
                    {
                        id: 10114701,
                        content: "这边，恩里克先生的办公室！",
                        npc: 200019,
                    },
                ],
            },
            {
                id: 10020704,
                dialogues: [
                    {
                        id: 10110801,
                        content: "恩里克？！",
                        npc: 200061,
                    },
                    {
                        id: 10110802,
                        content: "他还活着。白，找找附近有没有绷带，布条也可以。",
                        npc: 200061,
                    },
                    {
                        id: 10110803,
                        content: "……不用救我，这是我应得的。请你，请你……",
                        npc: 200005,
                    },
                    {
                        id: 10110804,
                        content: "没用了，他这个伤势已经没救了。让他把话说完吧。",
                        npc: 200021,
                    },
                    {
                        id: 10110805,
                        content: "你要，去……阻止赛琪。",
                        npc: 200005,
                    },
                    {
                        id: 10110806,
                        content: "阻止？",
                        npc: 200061,
                    },
                    {
                        id: 10110807,
                        content: "…………",
                        npc: 200005,
                    },
                    {
                        id: 10110808,
                        content: "修普诺斯之家，收留的是……秽蚀者……命运的弃儿……",
                        npc: 200005,
                    },
                    {
                        id: 10110809,
                        content: "等待他们的……本该是……冰冷的子弹……",
                        npc: 200005,
                    },
                    {
                        id: 10110810,
                        content: "是的。海伯利亚的卡戎之民如有任何“秽蚀”的征兆，就会被即刻带走处置，以免他们变成秽兽。等等，难道你是为了——",
                        npc: 200021,
                    },
                    {
                        id: 10110811,
                        content: "……他们的亲人……不忍……心……他们、他们……希望能以体面的方式……温柔地、由我……",
                        npc: 200005,
                    },
                    {
                        id: 10110812,
                        content: "让他们……走得……像个人。",
                        npc: 200005,
                    },
                    {
                        id: 10110813,
                        content: "就像……当年……送别海莉……",
                        npc: 200005,
                    },
                    {
                        id: 10110814,
                        content: "……难道……当年丹流城的案子，那个“遇害”的秽蚀者……是恩里克先生的女儿，海莉？",
                        npc: 200061,
                    },
                    {
                        id: 10110815,
                        content: "……连这个都……知道了啊……那起案子只是……一个绝望的父亲……最后的挣扎……",
                        npc: 200005,
                    },
                    {
                        id: 10110816,
                        content: "一直以来多有误会，恩里克先生……抱歉。",
                        npc: 200021,
                    },
                    {
                        id: 10110817,
                        content: "……不要……原谅……",
                        npc: 200005,
                    },
                    {
                        id: 10110818,
                        content: "我亲手带来……沉眠……这是我的罪，无可饶恕……",
                        npc: 200005,
                    },
                    {
                        id: 10110819,
                        content: "那赛琪她……？",
                        npc: 200061,
                    },
                    {
                        id: 10110820,
                        content: "我……群星绮晶……做了……最后的尝试……",
                        npc: 200005,
                    },
                    {
                        id: 10110821,
                        content: "仍然未能……挽救……秽蚀……",
                        npc: 200005,
                    },
                    {
                        id: 10110822,
                        content: "我本应一如既往地送别她……但那孩子实在是太特别了……",
                        npc: 200005,
                    },
                    {
                        id: 10110823,
                        content:
                            "她知道自己的结局，但还是努力地……笑着……几个月来，她像一束阳光……照进了这个……被神明抛弃的暗角……就像是……当年的……",
                        npc: 200005,
                    },
                    {
                        id: 10110824,
                        content: "我老了……我无法再次……亲手……",
                        npc: 200005,
                    },
                    {
                        id: 10110825,
                        content: "……所以你在犹豫不忍中错过了最后的时机。赛琪失去理智，袭击了你，逃了出去。",
                        npc: 200021,
                    },
                    {
                        id: 10110826,
                        content: "怎么会……是这样……！",
                        npc: 200002,
                    },
                    {
                        id: 10110827,
                        content: "你们是“骸”……你们……可以阻止她……",
                        npc: 200005,
                    },
                    {
                        id: 10110828,
                        content: "她那么善良，伤害他人，是她最不愿做的事……",
                        npc: 200005,
                    },
                ],
            },
            {
                id: 10020705,
                dialogues: [
                    {
                        id: 10114801,
                        content: "先抓紧离开这儿吧。",
                        npc: 100001,
                    },
                    {
                        id: 10114901,
                        content: "请一定要找到她，拜托了……",
                        npc: 200045,
                    },
                    {
                        id: 10115001,
                        content: "……赛琪杀了恩里克……为什么……会这样……",
                        npc: 700049,
                    },
                    {
                        id: 10115002,
                        content: "赛琪永远都在笑着……恩里克先生虽然话不多，但总是像父亲一样照料我们……他们明明都是那么好的人啊……",
                        npc: 700049,
                    },
                    {
                        id: 10115101,
                        content: "恩里克先生一直都太累了。或许对他来说，这样的结局……也不错。",
                        npc: 200019,
                    },
                    {
                        id: 10115201,
                        content: "白，还记得赛琪是往哪个方向跑的吗？",
                        npc: 100001,
                    },
                    {
                        id: 10115202,
                        content: "当然记得，我的记忆不会出错！她是往城门的方向跑的！",
                        npc: 200002,
                    },
                    {
                        id: 10115203,
                        content: "……她出城了？",
                        npc: 100001,
                    },
                    {
                        id: 10115204,
                        content: "好，我们也跟上，去城外。",
                        npc: 100001,
                    },
                    {
                        id: 10115301,
                        content: "好大的风！呜哇，感觉要被吹飞了——",
                        npc: 200002,
                    },
                    {
                        id: 10115302,
                        content: "你们两个也小心点！",
                        npc: 200002,
                    },
                    {
                        id: 10115401,
                        content: "这是最近的路，踩着浮冰过去吧。",
                        npc: 200021,
                    },
                    {
                        id: 10115402,
                        content: "这里水深，仔细点，别掉下去。",
                        npc: 200021,
                    },
                    {
                        id: 10115403,
                        content: "……赛琪，等我。",
                        npc: 100001,
                    },
                    {
                        id: 20001701,
                        content: "想要阻止秽蚀者并非易事，先做好准备再出城找赛琪吧。",
                        npc: 200021,
                    },
                    {
                        id: 10110901,
                        content: "你们……是要去找赛琪吗？",
                        npc: 200045,
                    },
                    {
                        id: 10110902,
                        content: "请你们带上这个。",
                        npc: 200045,
                    },
                    {
                        id: 10110903,
                        content:
                            "赛琪会经常送花给我们，即使我们有的人已经不太闻得出花的香味，不太看得清花的轮廓，她还是会说，花可以给人带来好运，坚持这么做。",
                        npc: 200045,
                    },
                    {
                        id: 10110904,
                        content: "……但当我想要回应的时候，已经来不及了。",
                        npc: 200045,
                    },
                    {
                        id: 10110905,
                        content: "请你们把这朵花带给她吧，这是她最喜欢的花。",
                        npc: 200045,
                    },
                    {
                        id: 10110906,
                        content: "请告诉她，修普诺斯之家的每个人，都在等着她……",
                        npc: 200045,
                    },
                    {
                        id: 10110907,
                        content: "我会的。我一定会救下她。",
                        npc: 100001,
                    },
                    {
                        id: 10110908,
                        content: "或者至少……阻止她做出违背自己心愿的事。",
                        npc: 100001,
                    },
                    {
                        id: 20002501,
                        content: "你们……要去找赛琪吗？",
                        npc: 200045,
                    },
                    {
                        id: 20002502,
                        content: "找到她的话，不要犹豫，结束她的痛苦吧，我想她也希望你们这么做……",
                        npc: 200045,
                    },
                    {
                        id: 20002401,
                        content: "……赛琪好像往城外去了。",
                        npc: 700049,
                    },
                    {
                        id: 20002402,
                        content: "应该是因为城外人比较少吧，在还有最后一点理智的时候，尽量去人少的地方去。",
                        npc: 700049,
                    },
                ],
            },
            {
                id: 10020706,
                dialogues: [
                    {
                        id: 20002001,
                        content: "……蝴蝶？冬天怎么会有蝴蝶？",
                        npc: 100001,
                    },
                    {
                        id: 20001801,
                        content: "哇……要被吹跑了！",
                        npc: 200002,
                    },
                    {
                        id: 20001802,
                        content: "白，跟在我们后面，趁着风小一点的时候一起向前。",
                        npc: 100001,
                    },
                    {
                        id: 20001803,
                        content: "风太大的时候也可以躲在石头后面，别着急。",
                        npc: 200021,
                    },
                    {
                        id: 20002101,
                        content: "这些秽兽都半死不活的，很可能是和赛琪交过手。",
                        npc: 200021,
                    },
                    {
                        id: 20002102,
                        content: "看来只要沿着它们的反方向，就能找到赛琪了……",
                        npc: 200021,
                    },
                ],
            },
            {
                id: 10020707,
                dialogues: [
                    {
                        id: 20002801,
                        content: "没事的，我们知道了赛琪去了哪里，跟上去就是。",
                        npc: 200021,
                    },
                    {
                        id: 20002802,
                        content: "嗯，没错，只要找到赛琪，就一定会有办法的！",
                        npc: 200002,
                    },
                    {
                        id: 20002803,
                        content: "谢谢你们……",
                        npc: 100001,
                    },
                ],
            },
            {
                id: 10020708,
                dialogues: [
                    {
                        id: 10111101,
                        content: "赛琪，听得见我的声音吗？",
                        npc: 100001,
                    },
                    {
                        id: 10111102,
                        content: "回答我……",
                        npc: 100001,
                    },
                    {
                        id: 10111103,
                        content: "你说过的，你明明还有那么多想做的事……",
                        npc: 100001,
                    },
                    {
                        id: 10111104,
                        content: "你会离开这里，去那些你前所未见的地方——",
                        npc: 100001,
                    },
                    {
                        id: 10111105,
                        content: "……你可以去一座小岛，在那里盖几间房子……",
                        npc: 100001,
                    },
                    {
                        id: 10111106,
                        content: "……在房子边上种满白色的花……",
                        npc: 100001,
                    },
                    {
                        id: 10111107,
                        content: "……一边用大大的帽檐遮住太阳，一边和友人说起冰湖城的雪……",
                        npc: 100001,
                    },
                    {
                        id: 10111108,
                        content: "……回答我……",
                        npc: 100001,
                    },
                ],
            },
            {
                id: 10020710,
                dialogues: [
                    {
                        id: 10111101,
                        content: "赛琪，听得见我的声音吗？",
                        npc: 100001,
                    },
                    {
                        id: 10111102,
                        content: "回答我……",
                        npc: 100001,
                    },
                    {
                        id: 10111103,
                        content: "你说过的，你明明还有那么多想做的事……",
                        npc: 100001,
                    },
                    {
                        id: 10111104,
                        content: "你会离开这里，去那些你前所未见的地方——",
                        npc: 100001,
                    },
                    {
                        id: 10111105,
                        content: "……你可以去一座小岛，在那里盖几间房子……",
                        npc: 100001,
                    },
                    {
                        id: 10111106,
                        content: "……在房子边上种满白色的花……",
                        npc: 100001,
                    },
                    {
                        id: 10111107,
                        content: "……一边用大大的帽檐遮住太阳，一边和友人说起冰湖城的雪……",
                        npc: 100001,
                    },
                    {
                        id: 10111108,
                        content: "……回答我……",
                        npc: 100001,
                    },
                ],
            },
        ],
    },
    {
        id: 100208,
        quests: [
            {
                id: 10020801,
                dialogues: [
                    {
                        id: 20002301,
                        content: "（已经失去理智的赛琪正在与秽蚀对抗……应该为她做些什么……）",
                    },
                    {
                        id: 10111201,
                        content: "赛琪，我来带你回家。",
                        npc: 100001,
                    },
                    {
                        id: 20002301,
                        content: "（已经失去理智的赛琪正在与秽蚀对抗……应该为她做些什么……）",
                    },
                ],
            },
            {
                id: 10020802,
                dialogues: [
                    {
                        id: 20002301,
                        content: "（已经失去理智的赛琪正在与秽蚀对抗……应该为她做些什么……）",
                    },
                    {
                        id: 20002301,
                        content: "（已经失去理智的赛琪正在与秽蚀对抗……应该为她做些什么……）",
                    },
                ],
            },
            {
                id: 10020803,
                dialogues: [
                    {
                        id: 20002301,
                        content: "（已经失去理智的赛琪正在与秽蚀对抗……应该为她做些什么……）",
                    },
                    {
                        id: 20002301,
                        content: "（已经失去理智的赛琪正在与秽蚀对抗……应该为她做些什么……）",
                    },
                ],
            },
            {
                id: 10020804,
                dialogues: [
                    {
                        id: 20002301,
                        content: "（已经失去理智的赛琪正在与秽蚀对抗……应该为她做些什么……）",
                    },
                    {
                        id: 20002301,
                        content: "（已经失去理智的赛琪正在与秽蚀对抗……应该为她做些什么……）",
                    },
                    {
                        id: 20002301,
                        content: "（已经失去理智的赛琪正在与秽蚀对抗……应该为她做些什么……）",
                    },
                ],
            },
            {
                id: 10020806,
                dialogues: [
                    {
                        id: 10112801,
                        content: "最后，还是……伤害了你们……对不起……",
                        npc: 200058,
                    },
                    {
                        id: 10112802,
                        content: "没关系。我们一起回家。他们要我转告你，他们都在等你。",
                        npc: 100001,
                    },
                    {
                        id: 10112803,
                        content: "……回家……",
                        npc: 200058,
                    },
                    {
                        id: 10112804,
                        content: "……但是，已经……回不去了……",
                        npc: 200058,
                    },
                    {
                        id: 10112805,
                        content: "……神通广大的奥特赛德，你不是说你的脑袋比我聪明一万倍吗，你快想想办法啊！",
                        npc: 200002,
                    },
                    {
                        id: 10112806,
                        content: "……",
                        npc: 200021,
                    },
                    {
                        id: 10112807,
                        content: "太晚了。她受了致命伤……哪怕是作为秽兽，也活不成了。",
                        npc: 200021,
                    },
                    {
                        id: 10112808,
                        content: "什么？！小仆从，你下手也太重了——",
                        npc: 200002,
                    },
                    {
                        id: 10112809,
                        content: "……不、不是{nickname}，是我自己……杀了……自己……因为，这幅样子，并不能算……活着……",
                        npc: 200058,
                    },
                    {
                        id: 10112810,
                        content: "打起精神来，赛琪。你说过要去一个盛开着繁花的温暖之地。",
                        npc: 100001,
                    },
                    {
                        id: 10112811,
                        content: "你说过的——有花的地方，就会有好事发生。",
                        npc: 100001,
                    },
                    {
                        id: 10112812,
                        content: "嗯，那里一定……很美。",
                        npc: 200058,
                    },
                    {
                        id: 10112813,
                        content: "不，我讲的不算，你得自己去看。",
                        npc: 100001,
                    },
                    {
                        id: 10112814,
                        content: "你知道……我为什么喜欢花吗？",
                        npc: 200058,
                    },
                    {
                        id: 10112815,
                        content: "因为它们的种子，会乘着轻柔的风，去向远方……翻越城墙、高山……没有什么能阻挡它们。",
                        npc: 200058,
                    },
                    {
                        id: 10130601,
                        content: "这是……长官，秽蚀者已经……！",
                        npc: 700065,
                    },
                    {
                        id: 10130602,
                        content: "……情况不太对劲。但还好，至少几位人质平安无事。",
                        npc: 100304,
                    },
                    {
                        id: 10130603,
                        content: "我是第六军团下属，科赛托斯行省卫戍部队准尉，黎瑟·费西尔。",
                        npc: 100304,
                    },
                    {
                        id: 10130604,
                        content: "秽兽异常凶险，虽然它现在停止了攻击，但很可能只是暂时休眠。你们尽快去城内避难，这里交给卫戍部队应付。",
                        npc: 100304,
                    },
                    {
                        id: 10113038,
                        content: "…………",
                        npc: 100001,
                    },
                    {
                        id: 10130605,
                        content: "……不必了，长官。您出手之前，我们就已经解决了。您也无需再浪费子弹了。",
                        npc: 200021,
                    },
                    {
                        id: 10113039,
                        content: "“已经解决”？",
                        npc: 100304,
                    },
                    {
                        id: 10130606,
                        content: "……的确如你所说。难怪这次的目标比大多数秽兽都要稳定。",
                        npc: 100304,
                    },
                    {
                        id: 10113008,
                        content: "不过……只靠你们两个么？看你们的打扮，是“狩月人”？",
                        npc: 100304,
                    },
                    {
                        id: 10113009,
                        content: "如您所见。",
                        npc: 200021,
                    },
                    {
                        id: 10113010,
                        content: "不对！长官，我看到了！虽然离得很远，但我先前探路的时候看到了，这几个卡戎……他们也会使用<W>魔法</>……",
                        npc: 700065,
                    },
                    {
                        id: 10113011,
                        content: "他们、他们没准就是秽蚀者的同伙！这些低贱的家伙，一个个净是邪恶的魔法师，没有一个好东西！我看全都得……",
                        npc: 700065,
                    },
                    {
                        id: 10113012,
                        content: "…………",
                        npc: 100304,
                    },
                    {
                        id: 10113013,
                        content: "……呃，不……长官，我、我是说他们。也、也不是所有卡戎之民都……总之我不是意有所指！",
                        npc: 700065,
                    },
                    {
                        id: 10113014,
                        content: "……惩罚一个有罪者，无需殃及众人。",
                        npc: 100304,
                    },
                    {
                        id: 10113015,
                        content: "感谢几位对军团的鼎力协助。请随我们前往治安署，我们将给予几位应有的报偿。",
                        npc: 100304,
                    },
                    {
                        id: 10113016,
                        content: "尽快将秽蚀者处理掉，以免引起行人恐慌。",
                        npc: 100304,
                    },
                    {
                        id: 10113017,
                        content: "……别碰……",
                        npc: 100001,
                    },
                    {
                        id: 10113018,
                        content: "嗯？",
                        npc: 100304,
                    },
                    {
                        id: 10113019,
                        content: "她……是为了避开人群，才会拼命往城外逃的。",
                        npc: 100001,
                    },
                    {
                        id: 10113020,
                        content: "……在最后一刻，她还在竭尽全力地……试图为人们做些什么……",
                        npc: 100001,
                    },
                    {
                        id: 10113021,
                        content: "什么叫“处理掉”……！你们怎么能——",
                        npc: 100001,
                    },
                    {
                        id: 10113022,
                        content: "你说什么？",
                        npc: 100304,
                    },
                    {
                        id: 10113023,
                        content: "你怎么了？受伤了吗？",
                        npc: 100304,
                    },
                    {
                        id: 10113024,
                        content: "没有没有没有。我的朋友只是受了小小的惊吓，我们等下去“水仙平原”喝点热饮就好。",
                        npc: 200021,
                    },
                    {
                        id: 10113025,
                        content: "报酬下次再说啦。下一份委托快到时限了，得赶时间，我们先走一步啊。",
                        npc: 200021,
                    },
                ],
            },
            {
                id: 10020807,
                dialogues: [
                    {
                        id: 10113101,
                        content: "……",
                        npc: 100001,
                    },
                    {
                        id: 10113102,
                        content: "看你好好制定了计划一计划二，我还以为你不会冲动了。结果你还是那个你——倒也不错，这才像你。",
                        npc: 200021,
                    },
                    {
                        id: 10113103,
                        content: "但是，我们已经送别了一个勇敢的朋友……我不能再看你去涉险。",
                        npc: 200021,
                    },
                    {
                        id: 10113104,
                        content: "……刚才帮我圆场，谢了。",
                        npc: 100001,
                    },
                    {
                        id: 10113106,
                        content: "没什么好谢的，在这里摸爬滚打了这么多年，我早就从刺猬变成老鼠了，每天除了活下去不做他想，你可别像我一样。",
                        npc: 200021,
                    },
                    {
                        id: 10113107,
                        content: "刺猬有刺猬的骄傲，卑躬屈膝的事还是交给老鼠干吧。",
                        npc: 200021,
                    },
                    {
                        id: 10113108,
                        content: "不过，还有另外一件重要的事。",
                        npc: 200021,
                    },
                    {
                        id: 10113109,
                        content:
                            "我从没听说有哪个秽蚀者能恢复自我，但赛琪短暂地做到了。她用最后的一点点清醒，亲手击碎了那具秽兽的躯壳，告诉大家，她不会投降。",
                        npc: 200021,
                    },
                    {
                        id: 10113110,
                        content: "她……是被你唤醒的？那时你用的魔法是……<H>和鸣之力</>。对吗？",
                        npc: 200021,
                    },
                    {
                        id: 10113111,
                        content: "……！你是怎么……",
                        npc: 100001,
                    },
                    {
                        id: 10113112,
                        content: "别紧张，我不会追问你的过去。但接下来这件事，你要牢记——",
                        npc: 200021,
                    },
                    {
                        id: 10113113,
                        content:
                            "<W>这份力量，在帝国，会为你招致灾祸。</>上个拥有这种力量的家伙把帝国搅得血雨腥风，下场也凄惨得很，被吊死在迪斯玛尼亚的广场上。",
                        npc: 200021,
                    },
                    {
                        id: 10113120,
                        content: "……务必，慎重使用你的力量。",
                        npc: 200021,
                    },
                    {
                        id: 10113114,
                        content: "…………",
                        npc: 100001,
                    },
                    {
                        id: 10113115,
                        content: "好了，{性别：难过就哭一场吧，兄弟。|想哭的话就哭一场吧，不用硬撑着。}",
                        npc: 200021,
                    },
                    {
                        id: 10113116,
                        content: "风这么大，我什么都听不到。就算我听到什么声音，也只是山雀在乱叫而已。",
                        npc: 200021,
                    },
                    {
                        id: 10113117,
                        content: "……这种事情啊，我已经见过很多次了。但我告诉自己，”你只有一个晚上可以流泪。”",
                        npc: 200021,
                    },
                ],
            },
            {
                id: 10020808,
                dialogues: [
                    {
                        id: 10125931,
                        content: "（雾海……逝去的灵魂……）",
                        npc: 100001,
                    },
                    {
                        id: 10125932,
                        content: "（世界的真相……构筑它的法则……）",
                        npc: 100001,
                    },
                    {
                        id: 10125901,
                        content: "愿你的灵魂于雾海深处获得安宁……",
                        npc: 200076,
                    },
                ],
            },
            {
                id: 10020810,
                dialogues: [
                    {
                        id: 10113201,
                        content: "你已经踏上了旅途啊。",
                        npc: 100012,
                    },
                    {
                        id: 10113202,
                        content: "也许你已经去了新的地方，结识了新的友人……",
                        npc: 100012,
                    },
                    {
                        id: 10113203,
                        content: "……",
                        npc: 100001,
                    },
                    {
                        id: 10113204,
                        content: "你有些难过。",
                        npc: 100012,
                    },
                    {
                        id: 10113205,
                        content: "……嗯。",
                        npc: 100001,
                    },
                    {
                        id: 10113206,
                        content: "我做了一个悲伤的梦——不，我也不知道那是不是梦。",
                        npc: 100001,
                    },
                    {
                        id: 10113207,
                        content: "我似乎弄丢了很重要的东西。",
                        npc: 100001,
                    },
                    {
                        id: 10113208,
                        content: "……竭尽全力想握住什么，它却像流沙一样从我们手中溜走。",
                        npc: 100012,
                    },
                    {
                        id: 10113209,
                        content: "时间，还有生命……都是如此。",
                        npc: 100012,
                    },
                    {
                        id: 10113210,
                        content: "诞生是为了毁灭，相遇是为了离别。这世界唯一永恒的东西，便是“消亡”。",
                        npc: 100012,
                    },
                    {
                        id: 10113211,
                        content: "你要……去哪里？",
                        npc: 100001,
                    },
                    {
                        id: 10113212,
                        content: "和你一样，踏上我的旅途。",
                        npc: 100012,
                    },
                    {
                        id: 10113213,
                        content: "等一下！你……到底是谁？！",
                        npc: 100001,
                    },
                    {
                        id: 10113214,
                        content: "我的名字是……",
                        npc: 100012,
                    },
                    {
                        id: 10113215,
                        content: "也许有一天，我们会在某处相见的。",
                        npc: 100012,
                    },
                    {
                        id: 10113301,
                        content: "再一次崩塌的梦里，那个声音从风中传来。",
                    },
                    {
                        id: 10113302,
                        content: "这一次，我终于可以听清。",
                    },
                    {
                        id: 10113303,
                        content: "像树木的根须汲取着每一滴水，我竭尽全力试图记住那个名字。",
                    },
                    {
                        id: 10113304,
                        content: "……那个名字……",
                    },
                ],
            },
        ],
    },
    {
        id: 100301,
        quests: [
            {
                id: 10030101,
                dialogues: [
                    {
                        id: 10030401,
                        content: "你……我这是……",
                        npc: 100001,
                    },
                    {
                        id: 10030402,
                        content: "睡了五天，运气不错。再多一天，这辈子可能都醒不过来了。",
                        npc: 200003,
                    },
                    {
                        id: 10030403,
                        content: "所以，这些天是你在……谢……",
                        npc: 100001,
                    },
                    {
                        id: 10030404,
                        content: "不用谢我。你现在可今非昔比了，因为上次群星绮晶的事，现在可有不少委托指名让你去呢。",
                        npc: 200003,
                    },
                    {
                        id: 10030405,
                        content: "可别活还没干完，人先没了。",
                        npc: 200003,
                    },
                ],
            },
            {
                id: 10030103,
                dialogues: [
                    {
                        id: 10030501,
                        content: "（咦，冰湖城多了好多气球……最近是什么节日吗？）",
                        npc: 100001,
                    },
                    {
                        id: 10030502,
                        content: "（但这么热闹的装饰，也盖不住空气里的冷清……）",
                        npc: 100001,
                    },
                    {
                        id: 10030503,
                        content: "（去找奥特赛德和白了解下昏迷这几天的情况吧。）",
                        npc: 100001,
                    },
                ],
            },
            {
                id: 10030104,
                dialogues: [
                    {
                        id: 10030701,
                        content: "太好了，看样子你已经没有大碍了。",
                        npc: 100304,
                    },
                    {
                        id: 10030702,
                        content: "长官要喝点什么吗？今天“冰湖往事”打五折哦。",
                        npc: 200002,
                    },
                    {
                        id: 10030703,
                        content: "不用。帝国军律第142条规定军人执勤期间不能饮酒，而且我也没有这个习惯。",
                        npc: 100304,
                    },
                    {
                        id: 10030704,
                        content: "我直接说正题吧。我是为了调查冰湖城外城近几日的恶性事件“卡戎狩猎”而来。",
                        npc: 100304,
                    },
                    {
                        id: 10030705,
                        content: "这是第一次询问，我需要按照惯例确认一下你的身份。可以给我看一下<H>通行证</>吗？",
                        npc: 100304,
                    },
                    {
                        id: 10030706,
                        content: "…………！",
                        npc: 100001,
                    },
                    {
                        id: 10030707,
                        content: "我急着出门，通行证还在家里，我先回去拿。",
                        npc: 100001,
                    },
                    {
                        id: 10030708,
                        content: "记错了吧？你通行证我前几天落在我家了，我正准备还给你——喏，长官，在这儿。",
                        npc: 200021,
                    },
                    {
                        id: 10030709,
                        content: "……名字，{nickname}。居住城市，科赛托斯省，冰湖城。职业，驯兽师……",
                        npc: 100304,
                    },
                    {
                        id: 10030710,
                        content: "呃，你不是狩月人吗？",
                        npc: 100304,
                    },
                    {
                        id: 10030711,
                        content: "那是过去的事了。{性别：他|她}以前是专门给有钱人养狗的，前任主人破产了吃不上饭才来干这行。",
                        npc: 200021,
                    },
                    {
                        id: 10030712,
                        content:
                            "不信你去卡米拉女士那儿问问，{性别：他|她}就是前几天才登记成狩月人的。来，{nickname}，给长官展示一下你高超的训犬技巧。",
                        npc: 200021,
                    },
                    {
                        id: 10030713,
                        content: "嘬嘬嘬。",
                        npc: 100001,
                    },
                    {
                        id: 10030714,
                        content: "不是，你对着我嘬什么啊！",
                        npc: 200021,
                    },
                    {
                        id: 10030715,
                        content: "……好，通行证我看过没问题了，谢谢配合。接下来，我们来说袭击的事吧。",
                        npc: 100304,
                    },
                    {
                        id: 10030716,
                        content:
                            "我想尽快抓住那个袭击你的凶手，还你们大家一个安全。{nickname}，你是这次连续袭击中唯一的幸存者，对我们掌握案情至关重要。只是酒馆人多眼杂——",
                        npc: 100304,
                    },
                    {
                        id: 10030717,
                        content: "哦，懂了。那我们就找个安静点的地方聊吧。",
                        npc: 200021,
                    },
                    {
                        id: 10030718,
                        content: "万分感谢，请随我来。",
                        npc: 100304,
                    },
                    {
                        id: 10030719,
                        content: "喂，发什么呆呢？",
                        npc: 200021,
                    },
                    {
                        id: 10030720,
                        content: "不会是在气通行证的事吧。那个，咳，熟人手头的通行证只有驯兽师的了，将就一下。",
                        npc: 200021,
                    },
                    {
                        id: 10030721,
                        content: "…………",
                        npc: 100001,
                    },
                    {
                        id: 10030722,
                        content: "好吧，那你八成还是在为那晚的事生黎瑟·费西尔的气喽。",
                        npc: 200021,
                    },
                    {
                        id: 10030723,
                        content: "不过，要是能跟费西尔混熟，倒不是件坏事。军团的情报网四通八达，你<H>找人</>那事，兴许会有眉目。",
                        npc: 200021,
                    },
                    {
                        id: 10030724,
                        content: "而且，你难道就不想亲手抓住那个不讲武德，背后偷袭的凶手吗？",
                        npc: 200021,
                    },
                    {
                        id: 10030725,
                        content:
                            "至于我嘛，也想快点把“卡戎狩猎”这事解决了。现在整座外城都人心惶惶的，生怕下个就是自己。我家那破门也实在是加不了更多锁了。",
                        npc: 200021,
                    },
                    {
                        id: 10030726,
                        content: "军团……贝蕾的消息……",
                        npc: 100001,
                    },
                    {
                        id: 10030727,
                        content: "……凶案……深夜袭击我的凶手……",
                        npc: 100001,
                    },
                    {
                        id: 10030728,
                        content: "唉，知道了，按你说的办吧。",
                        npc: 100001,
                    },
                ],
            },
            {
                id: 10030105,
                dialogues: [
                    {
                        id: 10030801,
                        content: "居然选了这种地方。",
                        npc: 200021,
                    },
                    {
                        id: 10030802,
                        content: "嗯，我平时累了的话，就会来这里散心。这里一般没什么人，适合聊正事。",
                        npc: 100304,
                    },
                    {
                        id: 10030803,
                        content: "“卡戎狩猎”是一起发生在冰湖城的连续凶案，想必你们已经有所耳闻了。",
                        npc: 100304,
                    },
                    {
                        id: 10030804,
                        content: "11月22日凌晨，5死1伤。11月25日凌晨，13人遇害。",
                        npc: 100304,
                    },
                    {
                        id: 10030805,
                        content: "凶案集中发生在东区，这一带居住的大多是卡戎之民，所以就有了“卡戎狩猎”这个名字。",
                        npc: 100304,
                    },
                    {
                        id: 10030806,
                        content: "这些我知道，您是要{nickname}做什么？",
                        npc: 200021,
                    },
                    {
                        id: 10030807,
                        content:
                            "我需要{nickname}提供尽可能多的案件细节。等一会儿，我会带你们去五天前{性别：他|她}遇袭的现场，那条街现在已经被军团封锁了。",
                        npc: 100304,
                    },
                    {
                        id: 10030808,
                        content:
                            "不过，你毕竟是受害者，重返现场可能会勾起你一些不好的回忆。虽然可能会降低调查效率，但如果你需要的话，我们也可以去治安署问话。",
                        npc: 100304,
                    },
                ],
            },
            {
                id: 10030106,
                dialogues: [
                    {
                        id: 10031201,
                        content: "刚才提到的“怪物的歌声”……你还能试着哼一下那首歌的旋律吗？",
                        npc: 100304,
                    },
                    {
                        id: 10031202,
                        content: "…………",
                        npc: 100001,
                    },
                    {
                        id: 10031203,
                        content: "不行，具体的旋律我哼不出来。",
                        npc: 100001,
                    },
                    {
                        id: 10031204,
                        content: "原来你也和我一样不擅长音乐。",
                        npc: 100304,
                    },
                    {
                        id: 10030901,
                        content: "队长你真了不起，军团的人都敢讹。",
                        npc: 200021,
                    },
                    {
                        id: 10030902,
                        content: "刚才不是你们说她很好说话吗？",
                        npc: 100001,
                    },
                    {
                        id: 10030903,
                        content: "那也没想到你会直接谈条件，你又不知道她脑袋里在想什么，万一……",
                        npc: 200021,
                    },
                    {
                        id: 10030904,
                        content: "我在想如何快速还原凶手特征。",
                        npc: 100304,
                    },
                    {
                        id: 10030905,
                        content: "嘘——她听到了，耳朵好尖。",
                        npc: 100001,
                    },
                    {
                        id: 10030906,
                        content: "过奖。时刻保持耳聪目明才能更好地执行任务。",
                        npc: 100304,
                    },
                    {
                        id: 10030907,
                        content: "（谁夸你了！）",
                        npc: 100001,
                    },
                    {
                        id: 10031101,
                        content: "凌晨四点到五点间……嗯，和卡米拉·斯卡雷特的证词一致。看来你的记忆很准确，并没有受到昏迷的影响。",
                        npc: 100304,
                    },
                    {
                        id: 10031102,
                        content: "那么，关于凶手的特征，你还记得多少？我想知道线索，任何线索都可以。",
                        npc: 100304,
                    },
                    {
                        id: 10031103,
                        content: "当时的袭击太突然，我没看太清楚凶手的长相。但有一点我可以确认，它……不是人。",
                        npc: 100001,
                    },
                    {
                        id: 10031104,
                        content: "我昏倒前最后一刻看到的，是一张怪物的面孔。至于到底是秽兽还是其他什么，就不清楚了。",
                        npc: 100001,
                    },
                    {
                        id: 10031105,
                        content: "嗯……怪物，这个我已经知道了。没有其他信息了吗……",
                        npc: 100304,
                    },
                    {
                        id: 10031106,
                        content: "等等，还有一件事！",
                        npc: 100001,
                    },
                    {
                        id: 10031107,
                        content: "请说！",
                        npc: 100304,
                    },
                    {
                        id: 10031108,
                        content: "歌声……",
                        npc: 100001,
                    },
                    {
                        id: 10031109,
                        content: "我记得，在这条街，我被什么东西尾随……那时，我听到的，除了它的脚步声外，还有……歌声。",
                        npc: 100001,
                    },
                    {
                        id: 10031110,
                        content: "我记得，在这条街，我被什么东西尾随……那时，我听到的，除了它的脚步声外，还有……歌声。",
                        npc: 100001,
                    },
                    {
                        id: 10031111,
                        content: "歌声？这个还没有人说过——太好了，是全新的线索！我就知道你那一下不会白挨。",
                        npc: 100304,
                    },
                    {
                        id: 10031112,
                        content: "喂，我说长官，人家经历挺痛苦的，这么激动不太好吧？",
                        npc: 200021,
                    },
                    {
                        id: 10031113,
                        content:
                            "……抱歉。刚刚我只是想，案子有了突破口，兴许就可以早点结束这场“狩猎”，还大家一个安宁了。我没有拿你的痛苦回忆取乐的意思，万分抱歉。",
                        npc: 100304,
                    },
                    {
                        id: 10031001,
                        content: "到了。{nickname}，这条街，你还记得吗？",
                        npc: 100304,
                    },
                ],
            },
            {
                id: 10030107,
                dialogues: [
                    {
                        id: 10010101,
                        content: "贝蕾，我……",
                        npc: 100001,
                    },
                    {
                        id: 10031701,
                        content: "月髓液啊……保险起见，我有个问题。",
                        npc: 100304,
                    },
                    {
                        id: 10031702,
                        content:
                            "你在遭遇凶手时，有没有闻到一股刺鼻的气味，大概像是……80%的油漆混上20%面包发霉的味道？抱歉，我可能不太擅长比喻……",
                        npc: 100304,
                    },
                    {
                        id: 10031703,
                        content: "（那是什么味道啊！）",
                        npc: 100001,
                    },
                    {
                        id: 10031704,
                        content: "嗯……虽然不知道你说的是什么味道，但这样回想起来，凶手扑过来的那一下，我好像的确被什么呛到了。",
                        npc: 100001,
                    },
                    {
                        id: 10031705,
                        content: "哦，你的意思是，这些月髓液是凶手身上的？",
                        npc: 100001,
                    },
                    {
                        id: 10031706,
                        content: "很有可能。工程炼金院生产的月髓液都混入了刺激性气体，既然你当时闻到了明显的气味，那就说明……",
                        npc: 100304,
                    },
                    {
                        id: 10031707,
                        content: "凶手身上可能沾了大量月髓液，这些蓝色的“花”就是它身上滴下来的。",
                        npc: 100304,
                    },
                    {
                        id: 10031708,
                        content: "冰湖城能接触到大量月髓液的地方无非就是那几处，再结合另一个线索，凶手的藏身地点就能大致锁定了……",
                        npc: 100304,
                    },
                    {
                        id: 10031210,
                        content: "这是……一块布？手感还挺好的。",
                        npc: 100001,
                    },
                    {
                        id: 10031211,
                        content: "（贝蕾就很喜欢这种毛茸茸的触感……）",
                        npc: 100001,
                    },
                    {
                        id: 10031212,
                        content: "我看一下……嗯，丝绒的，看花纹和折痕，这块布像是一块<H>舞台帷幕</>。",
                        npc: 100304,
                    },
                    {
                        id: 10031213,
                        content:
                            "这附近有舞台的地方，只有<H>盖雷亚剧院</>。最近那里正在为<H>银烛狂欢</>庆典做准备，人多手杂，有人不小心把废弃幕布丢掉了也不奇怪。",
                        npc: 100304,
                    },
                    {
                        id: 10031214,
                        content: "（银烛……庆典，城里那些装饰就是因为这个庆典吗？）",
                        npc: 100001,
                    },
                    {
                        id: 10031215,
                        content: "如果只有这块布也看不出什么，但是如果把这条线索和你刚才提到的另一条线索结合起来……",
                        npc: 100304,
                    },
                    {
                        id: 10031216,
                        content: "（嗯……舞台帷幕，的确和<H>那个线索</>有一定关联。）",
                        npc: 100001,
                    },
                    {
                        id: 10031301,
                        content: "垃圾桶里有个<H>断掉的风向标</>哎。唔，看起来好新好新，就这样扔了吗……好浪费哦，不如咱们带走吧！",
                        npc: 200002,
                    },
                    {
                        id: 10031302,
                        content: "你喜欢收集风向标吗？真是奇怪的爱好。我可以托我下属买个新的送你，但是这个是证物，不能交给你处置。",
                        npc: 100304,
                    },
                    {
                        id: 10031303,
                        content: "那、那个……白就是随口一说！我、我并不是喜欢风向标……",
                        npc: 200002,
                    },
                    {
                        id: 10031304,
                        content: "呜呜，头一次真的有人把白说的话当回事，好感动，呜呜呜……",
                        npc: 200002,
                    },
                    {
                        id: 10031305,
                        content: "黎瑟长官，这条街是什么时候开始封锁的？",
                        npc: 100001,
                    },
                    {
                        id: 10031306,
                        content: "“卡戎狩猎”第一起案发的次日清晨。",
                        npc: 100304,
                    },
                    {
                        id: 10031307,
                        content: "封锁得还算及时……既然是新的，这枚风向标应该也不是被谁故意丢弃在这里……",
                        npc: 100001,
                    },
                    {
                        id: 10031308,
                        content: "难道是那晚的大风？",
                        npc: 200021,
                    },
                    {
                        id: 10031309,
                        content:
                            "不，五天前的那场风暴后，治安署的确收到过很多财产损失报告，但这枚风向标并不是被吹下来的，更大的可能是被凶手<H>撞下来的</>。",
                        npc: 100304,
                    },
                    {
                        id: 10031310,
                        content: "卡米拉女士的证词说，凶手和她交手之后，跳上了<H>楼顶</>。这枚风向标，就是从那里掉下来的。",
                        npc: 100304,
                    },
                    {
                        id: 10031311,
                        content: "（楼顶吗……也顺带去看一下吧。）",
                        npc: 100001,
                    },
                    {
                        id: 10031401,
                        content: "就是这个了，缺口完全一致。底座的弯折痕迹，比起被风吹断，更像是人为撞击所致。",
                        npc: 100304,
                    },
                    {
                        id: 10031402,
                        content: "从这个弯折角度，不难推测它逃窜的方向。",
                        npc: 100304,
                    },
                    {
                        id: 10031601,
                        content: "这是……蓝色的雪？",
                        npc: 100001,
                    },
                    {
                        id: 10031602,
                        content: "我看过了，这是几滴<H>月髓液</>，它滴在雪里会像花一样晕开。",
                        npc: 100304,
                    },
                    {
                        id: 10031603,
                        content: "很漂亮，不是吗？每次看到这种蓝色的“小花”，就感觉一天的疲惫都消失了。",
                        npc: 100304,
                    },
                    {
                        id: 10031604,
                        content: "看这颜色，纯度还蛮高的啊。有月髓液泄漏了？",
                        npc: 200021,
                    },
                    {
                        id: 10031605,
                        content: "嗯……的确有可能。不过保险起见，关于月髓液这件事，我需要跟{nickname}确认一下。",
                        npc: 100304,
                    },
                ],
            },
            {
                id: 10030109,
                dialogues: [
                    {
                        id: 10032101,
                        content: "是奥特赛德啊。",
                        npc: 100313,
                    },
                    {
                        id: 10032102,
                        content: "普奇剧团长，最近过得怎么样？",
                        npc: 200021,
                    },
                    {
                        id: 10032103,
                        content: "有什么事就直说吧，你小子哪会对这种地方感兴趣。",
                        npc: 100313,
                    },
                    {
                        id: 10032104,
                        content: "哈哈，我接了个活，关于“卡戎狩猎”的。",
                        npc: 200021,
                    },
                    {
                        id: 10032105,
                        content: "哦，最近城里都在说的案子啊。要查什么你们自便，别打扰“魔笛”剧团排练就行。",
                        npc: 100313,
                    },
                    {
                        id: 10032106,
                        content: "这可是死了很多人的大案子哎，你们怎么还在排练呀！如果凶手就在你们身边，你们也会有生命危险的！",
                        npc: 200002,
                    },
                    {
                        id: 10032107,
                        content: "对演员来说，完成演出就是在诠释生命，这比生命本身更加璀璨耀眼。不让他们演出，才是要了他们的命。",
                        npc: 100313,
                    },
                    {
                        id: 10032108,
                        content: "所有人准备，今天第三场排练五分钟后开始。",
                        npc: 100313,
                    },
                    {
                        id: 10032109,
                        content: "……呜，真是一点都不肯配合呢。",
                        npc: 200002,
                    },
                    {
                        id: 10032110,
                        content: "分头问问看吧，至少她老人家没阻止我们。",
                        npc: 100001,
                    },
                    {
                        id: 10032002,
                        content: "喂，那边的朋友们，现在还不是演出时间。",
                        npc: 100313,
                    },
                ],
            },
            {
                id: 10030110,
                dialogues: [
                    {
                        id: 10032201,
                        content: "你好，请问……",
                        npc: 100001,
                    },
                    {
                        id: 10032202,
                        content: "……花冠15顶，没问题，马靴9双，没问题……好了，我这边清点完了，你是谁，什么事？",
                        npc: 100329,
                    },
                    {
                        id: 10032203,
                        content: "这块布料是剧院的吗？",
                        npc: 100001,
                    },
                    {
                        id: 10032204,
                        content:
                            "针脚不对，花纹不对，盖雷亚剧院才不会用这种劣质货。谁派你来的？你是不是哪里的小报记者，想造谣我们布景低劣？",
                        npc: 100329,
                    },
                    {
                        id: 10032205,
                        content: "啊不是不是，别激动，这是我们在“卡戎狩猎”案发现场捡到的，就问问而已。",
                        npc: 200021,
                    },
                    {
                        id: 10032206,
                        content: "……你这小报记者，是想抹黑剧院，说我们和杀人案有关？！",
                        npc: 100329,
                    },
                ],
            },
            {
                id: 10030111,
                dialogues: [
                    {
                        id: 10032401,
                        content: "哇，那个麦克风好大声！",
                        npc: 200002,
                    },
                    {
                        id: 10032402,
                        content: "所有人就位，第三场排练现在开始！",
                        npc: 100313,
                    },
                    {
                        id: 10032403,
                        content: "我看了眼点名册，大家确实都一个多月没出剧院了，冬眠的熊都比他们出门勤快。",
                        npc: 200021,
                    },
                    {
                        id: 10032404,
                        content: "嗯，而且一直集中排练的话，也没人有机会跑出去袭击……走吧，去看看黎瑟那边有没有什么进展。",
                        npc: 100001,
                    },
                    {
                        id: 10032301,
                        content:
                            "你的喉咙太紧张了，放松，将口腔打开，用气来托住你的声音，发声位置要靠后，想象将你的声音集中在后脑勺上的一点。",
                        npc: 100318,
                    },
                    {
                        id: 10032302,
                        content: "抱歉，薇奥莱塔老师。我，我再试试……",
                        npc: 100319,
                    },
                    {
                        id: 10032303,
                        content: "巡演这么久回来，这孩子还是没什么长进……果然不是谁都能像帕西法尔那样，有副天生的好嗓子。",
                        npc: 100318,
                    },
                    {
                        id: 10032304,
                        content: "喂喂，你这家伙的表情好奇怪，是不是做坏事心虚了！本魔王大人要好好审问你才行！",
                        npc: 200002,
                    },
                    {
                        id: 10032305,
                        content: "加油，加油，我可以的……这是今年最重要的演出……我们排练了这么久，一定没问题的，没问题的……",
                        npc: 100319,
                    },
                    {
                        id: 10032306,
                        content: "喂——别走啊！魔王大人在和你说话呢！",
                        npc: 200002,
                    },
                    {
                        id: 10032307,
                        content: "你还好吗？要不要休息一下？",
                        npc: 100001,
                    },
                    {
                        id: 10032308,
                        content: "不，不用……排练不能耽误……",
                        npc: 100319,
                    },
                    {
                        id: 10032309,
                        content: "真不用吗，你看起来像是刚从棺材里爬出来一样。",
                        npc: 200021,
                    },
                    {
                        id: 10032310,
                        content: "我，我好得很！大家这一个多月都这么过来的。我要抓紧时间，抓紧时间……",
                        npc: 100319,
                    },
                    {
                        id: 10032311,
                        content: "那么，有没有什么人不好好排练，半夜偷偷溜出去？",
                        npc: 100001,
                    },
                    {
                        id: 10032312,
                        content:
                            "不会的，不会的。<H>大家都把自己关在这里，连门都没出过。</>不信，你去看那边的日程表……在银烛狂欢结束前，我们要一直排练……",
                        npc: 100319,
                    },
                    {
                        id: 10032313,
                        content: "奥特赛德，银烛狂欢到底是什么？",
                        npc: 100001,
                    },
                    {
                        id: 10032314,
                        content:
                            "其实就是大家戴上面具，换上奇奇怪怪的装扮，抛下身份与种族……大家一起围聚在大剧院里，一边看庆典的表演，一边彻夜跳舞。",
                        npc: 200021,
                    },
                    {
                        id: 10032315,
                        content: "这一刻没有人管面具背后的你是索拉还是卡戎，只要一起唱，一起跳，一起喊就够了。",
                        npc: 200021,
                    },
                    {
                        id: 10032316,
                        content: "真难想象冰湖城还有这样的节日。我觉得这儿的人还挺……严肃的。",
                        npc: 100001,
                    },
                    {
                        id: 10032317,
                        content: "哈哈，人啊，不就是平时越憋得透不过气，就越想大声喊叫出来么。",
                        npc: 200021,
                    },
                ],
            },
            {
                id: 10030112,
                dialogues: [
                    {
                        id: 10032501,
                        content: "这么快就查完了吗？速度远超很多士兵了。",
                        npc: 100304,
                    },
                ],
            },
            {
                id: 10030113,
                dialogues: [
                    {
                        id: 10032601,
                        content: "这一片住着的都是渔夫，长官你要先从哪家找起？",
                        npc: 200021,
                    },
                    {
                        id: 10032603,
                        content: "喵……呜喵？",
                        npc: 100320,
                    },
                    {
                        id: 10032604,
                        content: "（这只猫一直在盯着黎瑟看……是闻到了什么特别的味道吗？）",
                        npc: 100001,
                    },
                    {
                        id: 10032605,
                        content: "黎瑟长官，那罐鱼油借用一下。",
                        npc: 100001,
                    },
                    {
                        id: 10032606,
                        content: "给，你是发现什么了吗？",
                        npc: 100304,
                    },
                    {
                        id: 10032607,
                        content: "嗯，我确认一下。",
                        npc: 100001,
                    },
                    {
                        id: 10032608,
                        content: "喵——喵喵！",
                        npc: 100320,
                    },
                    {
                        id: 10032602,
                        content: "喵——喵——",
                        npc: 100320,
                    },
                ],
            },
            {
                id: 10030114,
                dialogues: [
                    {
                        id: 10032609,
                        content: "我们跟着那只猫走吧，它似乎想带我们去什么地方。",
                        npc: 100001,
                    },
                    {
                        id: 10032610,
                        content: "真敏锐，不愧是驯兽师出身。",
                        npc: 100304,
                    },
                    {
                        id: 10032611,
                        content: "（……奥特赛德，我谢谢你。）",
                        npc: 100001,
                    },
                    {
                        id: 10032612,
                        content: "喵——喵喵喵喵！",
                        npc: 100320,
                    },
                    {
                        id: 10032613,
                        content: "猫咪消失在了前方。",
                    },
                ],
            },
            {
                id: 10030115,
                dialogues: [
                    {
                        id: 10032614,
                        content: "你这个伤害小仆从的坏家伙，居然藏在这里！",
                        npc: 200002,
                    },
                    {
                        id: 10032615,
                        content: "啊？卫戍部队的？别打我别打我，我招，我招！",
                        npc: 100314,
                    },
                    {
                        id: 10032701,
                        content: "……讲！",
                        npc: 100304,
                    },
                    {
                        id: 10032702,
                        content: "最近抓不到多少鱼，我就去偷了点月髓液卖。但也不至于这么多人抓我吧……各位长官，行行好，再给个机会吧……",
                        npc: 100314,
                    },
                ],
            },
            {
                id: 10030116,
                dialogues: [
                    {
                        id: 10032801,
                        content: "凶手的样貌，藏身处都知道了，你接下来准备怎么做？",
                        npc: 200021,
                    },
                    {
                        id: 10032802,
                        content: "我会去下水道找凶手。",
                        npc: 100304,
                    },
                    {
                        id: 10032803,
                        content:
                            "上级说过，必须找到凶手“确切的藏身地”。冰湖城下水道四通八达，我想，如果只是笼统的“下水道”这条线索，他们还是不会给我支援的。",
                        npc: 100304,
                    },
                    {
                        id: 10032804,
                        content: "但是，如果我能找到那只怪物，甚至亲自与它交手……卫戍部队就再也没有理由按兵不动了。",
                        npc: 100304,
                    },
                    {
                        id: 10032805,
                        content: "“大人们不愿播种与耕耘，只期盼在冬天过后直接收获丰厚的果实。”",
                        npc: 100304,
                    },
                    {
                        id: 10032806,
                        content: "什么？",
                        npc: 100001,
                    },
                    {
                        id: 10032807,
                        content: "啊，我只是下意识……这是歌剧《雪国的孩子》里的一段……",
                        npc: 100304,
                    },
                ],
            },
            {
                id: 10030197,
                dialogues: [
                    {
                        id: 10031901,
                        content: "以目前的线索来看，有两个地方最可疑……",
                        npc: 100304,
                    },
                    {
                        id: 10031902,
                        content: "西南方向的工厂，以及盖雷亚剧院。",
                        npc: 100001,
                    },
                    {
                        id: 10031903,
                        content: "嗯，看来你也得出了同样的结论。",
                        npc: 100304,
                    },
                    {
                        id: 10031904,
                        content: "我要多谢你，感谢你为冰湖城做出的贡献。如果不是你带来了关键情报，我们肯定没法这么快锁定位置。",
                        npc: 100304,
                    },
                    {
                        id: 10031905,
                        content: "可是有两个地方哎，我们有一，二，三，四个人！",
                        npc: 200002,
                    },
                    {
                        id: 10031906,
                        content: "我去工厂吧，我的身份调查起来更方便，而且那里有我一些老相识。",
                        npc: 100304,
                    },
                    {
                        id: 10031907,
                        content: "你该不会还在工厂做过工？",
                        npc: 200021,
                    },
                    {
                        id: 10031908,
                        content: "嗯，我小时候就去帮工了，在那里待过很长一阵子。",
                        npc: 100304,
                    },
                    {
                        id: 10031909,
                        content: "那你能混到今天这份上，也挺不容易的。只可惜……",
                        npc: 200021,
                    },
                    {
                        id: 10031910,
                        content: "算了，不说这些了，我们也动身吧，队长。",
                        npc: 200021,
                    },
                ],
            },
            {
                id: 10030198,
                dialogues: [
                    {
                        id: 10031501,
                        content: "没错，你也看出来了。它是往西南方向逃的。",
                        npc: 100304,
                    },
                    {
                        id: 10031502,
                        content: "这不是都查到了吗，那卫戍部队怎么不直接去那边搜？",
                        npc: 200021,
                    },
                    {
                        id: 10031503,
                        content: "人手不够，情报也不够。",
                        npc: 100304,
                    },
                    {
                        id: 10031504,
                        content: "西南方向那些工厂、住宅和学校我们也在逐步盘查，但范围太大了，现在还没有多少进展。",
                        npc: 100304,
                    },
                    {
                        id: 10031505,
                        content: "说来惭愧，这案子只有我和我的几个下属在调查……其中一个下属折在了它手上，就在11月25日的那一批遇害者里。",
                        npc: 100304,
                    },
                    {
                        id: 10031506,
                        content: "我们发现他的时候，他浑身上下的内脏都被踩碎了，就像被擀面杖碾过去的面团。",
                        npc: 100304,
                    },
                    {
                        id: 10031507,
                        content: "……你节哀。",
                        npc: 200021,
                    },
                    {
                        id: 10031508,
                        content: "抓到凶手，才是对所有人最好的交代。但……我们还没能找到那怪物。",
                        npc: 100304,
                    },
                    {
                        id: 10031509,
                        content:
                            "我几次向上级请求支援，但申请都被驳回了——呃，确切来说不是驳回，而是我必须调查出凶手的确切藏身地，才能得到支援。",
                        npc: 100304,
                    },
                    {
                        id: 10031510,
                        content: "我看怕不是案发地点刚好是卡戎聚居区，反正怪物也跑不到内城去，所以你上级根本懒得管？",
                        npc: 200021,
                    },
                    {
                        id: 10031511,
                        content: "我不敢妄自揣测。",
                        npc: 100304,
                    },
                    {
                        id: 10031512,
                        content: "呵。",
                        npc: 200021,
                    },
                    {
                        id: 10031513,
                        content: "那我们动作再快些吧，帮长官尽快破案。",
                        npc: 100001,
                    },
                    {
                        id: 10031514,
                        content: "万分感谢！",
                        npc: 100304,
                    },
                    {
                        id: 10031801,
                        content: "差不多就这样了吧，我看这附近也没什么其他线索了。",
                        npc: 200021,
                    },
                    {
                        id: 10031802,
                        content: "抱歉，外城发生这种恶性事件，是我们卫戍部队的失职。",
                        npc: 100304,
                    },
                    {
                        id: 10031803,
                        content: "长官，你之前不是管这一带的吧，最近刚调过来的？",
                        npc: 200021,
                    },
                    {
                        id: 10031804,
                        content: "是的，我以前在西区做其他差事。上个月我升任准尉，长官把我调到了这里，负责东区的安全。",
                        npc: 100304,
                    },
                    {
                        id: 10031805,
                        content: "难怪之前没见过！黎瑟长官给人的感觉和其他士兵不太一样呢。",
                        npc: 200002,
                    },
                    {
                        id: 10031806,
                        content: "不一样？",
                        npc: 100304,
                    },
                    {
                        id: 10031807,
                        content: "对呀对呀，卫戍部队不是从不管卡戎之民的死活嘛，但黎瑟长官看起来好像在很努力很努力地保护大家。",
                        npc: 200002,
                    },
                    {
                        id: 10031808,
                        content: "（……很努力地保护大家？）",
                        npc: 100001,
                    },
                    {
                        id: 10031809,
                        content: "秽兽异常凶险，虽然它现在停止了攻击，但很可能只是暂时休眠。你们尽快去城内避难，这里交给卫戍部队应付。",
                        npc: 100304,
                    },
                    {
                        id: 10031810,
                        content: "…………",
                        npc: 100001,
                    },
                    {
                        id: 10031811,
                        content: "（算了，先别想这些了……整理一下手头的线索吧。）",
                        npc: 100001,
                    },
                ],
            },
        ],
    },
    {
        id: 100302,
        quests: [
            {
                id: 10030202,
                dialogues: [
                    {
                        id: 10032901,
                        content: "走这边。",
                        npc: 100304,
                    },
                    {
                        id: 10032902,
                        content: "黎瑟长官对这里似乎很熟悉？",
                        npc: 100001,
                    },
                    {
                        id: 10032903,
                        content: "这些年帝国很注重各城镇地下设施的建设，卫戍部队也要出力维护。",
                        npc: 100304,
                    },
                    {
                        id: 10032904,
                        content: "刚加入卫戍部队时，我每天都被安排打扫这里。",
                        npc: 100304,
                    },
                    {
                        id: 10032905,
                        content: "天天清理下水道……卡戎就算加入军团也还是会被欺负吗？",
                        npc: 100001,
                    },
                    {
                        id: 10032906,
                        content: "偏见是根深蒂固的，但在军团至少我们还可以靠功绩来赢得尊重。",
                        npc: 100304,
                    },
                    {
                        id: 10032907,
                        content: "这也是身为“恶魔的孩子”，偿还自己罪业的方式之一。",
                        npc: 100304,
                    },
                    {
                        id: 10032908,
                        content: "等等……你们有没有听到什么声音？",
                        npc: 200021,
                    },
                ],
            },
            {
                id: 10030203,
                dialogues: [
                    {
                        id: 10033001,
                        content: "这是什么情况？",
                        npc: 100001,
                    },
                    {
                        id: 10033002,
                        content: "他和同伴被一只怪物逼进了下水道，他以为自己肯定活不成了，但那只怪物突然停止了追击。",
                        npc: 100304,
                    },
                    {
                        id: 10033003,
                        content: "他们虽然捡了一条命，但这片区域到处都是走不通的路和秽兽，就都被困在了这里。",
                        npc: 100304,
                    },
                    {
                        id: 10033004,
                        content: "怪物……卡戎狩猎的凶手？",
                        npc: 100001,
                    },
                    {
                        id: 10033005,
                        content: "很有可能。我已处理了他的伤口并呼叫了我的下属，在他们赶来前，先保障两名受困者的安全吧。",
                        npc: 100304,
                    },
                    {
                        id: 10033006,
                        content: "多谢各位长官，我，我的同伴就在前面那道锁住的门后不远。",
                        npc: 100321,
                    },
                    {
                        id: 10033007,
                        content: "咦，带上这样一个拖油瓶吗？没办法没办法，就让白来保护你吧，你可要跟紧喽。",
                        npc: 200002,
                    },
                    {
                        id: 10032909,
                        content: "救，救救我……我……不想死……",
                        npc: 100321,
                    },
                    {
                        id: 10032910,
                        content: "……呼救声！我马上过来！",
                        npc: 100304,
                    },
                    {
                        id: 10032911,
                        content: "喂，你都不确认一下是不是陷阱吗……啧，我们也快跟上去吧。",
                        npc: 200021,
                    },
                ],
            },
            {
                id: 10030206,
                dialogues: [
                    {
                        id: 10033111,
                        content: "啊，他在那台机关后面！喂喂，终于有人来救我们了！",
                        npc: 100321,
                    },
                    {
                        id: 10033112,
                        content: "呃……快，快逃，这里到处，都是秽兽……",
                        npc: 100322,
                    },
                    {
                        id: 10033113,
                        content: "撑住，我们马上过去！",
                        npc: 100304,
                    },
                ],
            },
            {
                id: 10030207,
                dialogues: [
                    {
                        id: 10033201,
                        content: "——吼！！",
                    },
                    {
                        id: 10033202,
                        content: "怪物，是那怪物的声音，它要来了！！！",
                        npc: 100321,
                    },
                    {
                        id: 10033203,
                        content: "喂，你们两个别乱跑啊，再碰到秽兽怎么办。",
                        npc: 200021,
                    },
                    {
                        id: 10033204,
                        content: "黎瑟长官，我们已经按您的吩咐，在下水道的几个出口布设了陷阱，您现在在哪儿？",
                        npc: 100344,
                    },
                    {
                        id: 10033205,
                        content: "来得正好，请优先确保两名市民的安全。我们在废水处理区发现了凶手踪迹。",
                        npc: 100304,
                    },
                    {
                        id: 10033206,
                        content: "收到。",
                        npc: 100344,
                    },
                    {
                        id: 10033301,
                        content: "——吼！！",
                    },
                    {
                        id: 10033302,
                        content: "那怪物到底藏在哪儿……",
                        npc: 100001,
                    },
                    {
                        id: 10033303,
                        content: "废水处理区与下水道其他区域相连，我们把这里的废水排出去，彻查整片区域吧。",
                        npc: 100304,
                    },
                ],
            },
            {
                id: 10030208,
                dialogues: [
                    {
                        id: 10033304,
                        content: "长官，我们来支援了。",
                        npc: 100344,
                    },
                    {
                        id: 10033305,
                        content: "两位市民呢？",
                        npc: 100304,
                    },
                    {
                        id: 10033306,
                        content: "送去医院了。我们还呼叫了上级，到这份上他们终于肯支援了。",
                        npc: 100345,
                    },
                    {
                        id: 10033307,
                        content: "这几个人就是您提到的帮手吗？",
                        npc: 100345,
                    },
                    {
                        id: 10033308,
                        content: "是的，若不是“夜航者”这样优秀的狩月人，我也找不到这里。",
                        npc: 100304,
                    },
                    {
                        id: 10033309,
                        content: "哇，好多人帮忙呀！哼哼，对付打伤{nickname}的坏家伙，必须出重拳！",
                        npc: 200002,
                    },
                    {
                        id: 10033310,
                        content: "要准备迎战了。",
                        npc: 100001,
                    },
                    {
                        id: 10033301,
                        content: "——吼！！",
                    },
                    {
                        id: 10033302,
                        content: "那怪物到底藏在哪儿……",
                        npc: 100001,
                    },
                    {
                        id: 10033303,
                        content: "废水处理区与下水道其他区域相连，我们把这里的废水排出去，彻查整片区域吧。",
                        npc: 100304,
                    },
                    {
                        id: 10033311,
                        content: "吼……！",
                        npc: 100328,
                    },
                ],
            },
            {
                id: 10030209,
                dialogues: [
                    {
                        id: 10033501,
                        content: "{nickname}！",
                        npc: 200021,
                    },
                    {
                        id: 10033502,
                        content: "我没事，黎瑟长官她……",
                        npc: 100001,
                    },
                    {
                        id: 10033503,
                        content: "没关系的，保护市民是我的责任……你们没事……就好。",
                        npc: 100304,
                    },
                    {
                        id: 10033504,
                        content: "你……",
                        npc: 100001,
                    },
                    {
                        id: 10033505,
                        content: "感谢各位对军团的协助，要不是你们，卫戍部队的伤亡恐怕会更惨重。",
                        npc: 100311,
                    },
                    {
                        id: 10033311,
                        content: "吼……！",
                        npc: 100328,
                    },
                ],
            },
            {
                id: 10030214,
                dialogues: [
                    {
                        id: 10033701,
                        content: "咦？！他们是接我们的人吗，这，这是怎么了啊！",
                        npc: 200002,
                    },
                    {
                        id: 10033702,
                        content: "……没有呼吸。",
                        npc: 100001,
                    },
                    {
                        id: 10033703,
                        content: "等等，别碰。",
                        npc: 200021,
                    },
                    {
                        id: 10033704,
                        content: "……伤口很小，血液发紫，是毒发身亡。",
                        npc: 200021,
                    },
                    {
                        id: 10033705,
                        content: "捂好口鼻，我不确定这毒会不会蔓延在空气中。",
                        npc: 200021,
                    },
                    {
                        id: 10033706,
                        content: "……<H>毒</>？",
                        npc: 100001,
                    },
                    {
                        id: 10033707,
                        content: "这群坏家伙真可恶！",
                        npc: 200002,
                    },
                    {
                        id: 10033708,
                        content: "不对，这些毒，明显<H>不是卡戎狩猎的手段</>……",
                        npc: 200021,
                    },
                    {
                        id: 10033709,
                        content: "又有其他凶手卷进来了吗……",
                        npc: 100001,
                    },
                    {
                        id: 10033710,
                        content:
                            "算了，这已经不是委托分内的事了。小矮子先和{nickname}一起去看黎瑟。我去跟卫戍部队的人说一下这里的情况，完事就去找你们。",
                        npc: 200021,
                    },
                    {
                        id: 10033711,
                        content: "好！小仆从，我们走！",
                        npc: 200002,
                    },
                    {
                        id: 10033712,
                        content: "难道……是<W>他们</>……",
                        npc: 200021,
                    },
                ],
            },
        ],
    },
    {
        id: 100303,
        quests: [
            {
                id: 10030301,
                dialogues: [
                    {
                        id: 10034301,
                        content: "我们回来了，是这个印章没错吧？",
                        npc: 200021,
                    },
                    {
                        id: 10034302,
                        content: "对！我们抓紧时间直奔主题吧。",
                        npc: 100361,
                    },
                    {
                        id: 10034303,
                        content:
                            "{nickname}{性别：先生|女士}，你家人的名字、失散的地点、外貌特征，失散时的衣服和携带的物品，请务必详细说明，不要有所遗漏。",
                        npc: 100361,
                    },
                ],
            },
            {
                id: 10030394,
                dialogues: [
                    {
                        id: 10034107,
                        content: "来看看这个。",
                        npc: 200021,
                    },
                    {
                        id: 10034108,
                        content: "为什么废弃检修间会有这么多矿灯跟矿镐？",
                        npc: 100001,
                    },
                    {
                        id: 10034109,
                        content: "格雷姆矿坑的月石快没的时候，矿工们担心未来，从矿坑顺了些东西转卖。",
                        npc: 200021,
                    },
                    {
                        id: 10034110,
                        content: "这里应该就是那群矿工藏东西的地方，后来被黎瑟发现，当成了一个隐秘的仓库。不过我要你看的不是这些。",
                        npc: 200021,
                    },
                    {
                        id: 10034223,
                        content: "锵锵——白找到印章啦！关键时刻还得靠我嘛。",
                        npc: 200002,
                    },
                    {
                        id: 10034224,
                        content: "哦？居然被你找到了，不错不错，奖励你一顶紫露花花环。",
                        npc: 200021,
                    },
                    {
                        id: 10034225,
                        content: "白可不是好敷衍的小孩子！得两顶，我一顶，{nickname}一顶，奥特赛德没有。",
                        npc: 200002,
                    },
                    {
                        id: 10034226,
                        content: "好好好，等我们忙完这阵。",
                        npc: 200021,
                    },
                    {
                        id: 10034201,
                        content: "我还好奇是哪个傻瓜在你昏迷的时候送止痛剂呢，看到这个，确实是黎瑟这种傻傻的家伙能干出来的。",
                        npc: 200021,
                    },
                    {
                        id: 10034202,
                        content: "好了，我这边就找到这些，你呢，找到印章了吗？",
                        npc: 200021,
                    },
                    {
                        id: 10034203,
                        content: "还没。但我知道了另一件事……",
                        npc: 100001,
                    },
                    {
                        id: 10034204,
                        content: "黎瑟还小的时候……她父母被秽蚀者变成的秽兽害死了，那只秽兽还杀掉了很多人。",
                        npc: 100001,
                    },
                    {
                        id: 10034205,
                        content: "秽兽异常凶险，虽然它现在停止了攻击，但很可能只是暂时休眠。你们尽快去城内避难，这里交给卫戍部队应付。",
                        npc: 100304,
                    },
                    {
                        id: 10034206,
                        content: "……保护市民……是我的责任，你们没事……就好。",
                        npc: 100304,
                    },
                    {
                        id: 10034207,
                        content: "她不想再看到任何人死在秽兽手上，也许正因为如此她才会加入卫戍部队吧。",
                        npc: 100001,
                    },
                    {
                        id: 10034208,
                        content: "…………",
                        npc: 100001,
                    },
                    {
                        id: 10034209,
                        content: "那么，那晚的事情，你是原谅她了？",
                        npc: 200021,
                    },
                ],
            },
            {
                id: 10030395,
                dialogues: [
                    {
                        id: 10034101,
                        content: "哦？看来是拿废弃检修间改的啊。",
                        npc: 200021,
                    },
                    {
                        id: 10034102,
                        content: "这不就跟白乱糟糟的房间，不是，魔王的豪华寝室差不多嘛！",
                        npc: 200002,
                    },
                    {
                        id: 10034103,
                        content: "分头找找看吧，银色的印章。",
                        npc: 100001,
                    },
                    {
                        id: 10034104,
                        content:
                            "皇帝尾戒勋章，完全由纯金打造，只会颁发给为帝国做出卓越贡献的军人。\n\n科赛托斯行省冰湖城第六军团下属卫戍部队，<H>黎瑟·费西尔</>。\n在连年、数次<H>清缴秽兽作战</>中，决策果断，作战英勇，收尾迅速。\n在维护地区治安的过程中起到了无可比拟的关键作用。\n现经军团评估，以吾皇尤里乌斯之名，授予黎瑟·费西尔帝皇尾戒勋章及准尉军衔，望广大军人以其为榜样，奋发上进，共同成长。\n荣耀尽归吾皇。",
                    },
                    {
                        id: 10034106,
                        content:
                            "压在一堆杂物下的老旧报纸，记录着很久以前的悲惨事故。\n\n<H>秽蚀者异常凶险，不要被表象欺骗！</>\n9月24日，本市发生一起极为恶劣的“秽蚀”事件，经第六军团卫戍部队调查后，得出以下结论：\n冰湖城市民费西尔夫妇于9月13日在泪湖畔公路边上偶遇一名叫做罗比·布朗的青年。因其身受重伤，费西尔夫妇将其带回家中照料。\n然而，罗比·布朗是一名秽蚀者，他躲过了帝国对潜在秽蚀者的例行盘查并潜逃至城外，且在接受费西尔夫妇帮助时，刻意掩盖了自己的秽蚀痕迹。十日后，悲剧发生：布朗蜕变成为秽兽，杀死了包括费西尔夫妇在内数十名居住在冰湖城南区的市民。第六军团下属冰湖城卫戍部队紧急出动才平息此次骚乱。\n骚乱共造成18人死亡，其中包含3名索拉之民；另有34人受伤。在此提醒各位市民谨记，不要轻易收留身份不明的卡戎之民，一旦发现秽蚀者，立即上报治安署。它们永远只是人类的敌人，无一例外。如有刻意包庇秽蚀者、隐瞒不报者，一律按照《海伯利亚刑事法典》第54条规定，处以死刑。",
                    },
                ],
            },
            {
                id: 10030396,
                dialogues: [
                    {
                        id: 10034007,
                        content: "就是这里？",
                        npc: 100001,
                    },
                    {
                        id: 10034008,
                        content: "入口应该就在这附近，找找看吧。",
                        npc: 200021,
                    },
                    {
                        id: 10034001,
                        content: "军人的秘密基地啊，会是什么样子呢，感觉很刺激！",
                        npc: 200002,
                    },
                    {
                        id: 10034002,
                        content: "钥匙上写的地方，好像是公路那个中转站附近啊。",
                        npc: 200021,
                    },
                    {
                        id: 10034003,
                        content: "居然把秘密基地建在这种地方吗……",
                        npc: 100001,
                    },
                    {
                        id: 10034004,
                        content: "大家都会钻到在一些常人无法理解的地方给自己找个独处的避风港……",
                        npc: 200021,
                    },
                    {
                        id: 10034005,
                        content: "有人是车里，有人是管道，所以把那种地方当做秘密基地很正常吧。",
                        npc: 200021,
                    },
                    {
                        id: 10034006,
                        content: "呃……很正常吧，不会只有我小时候喜欢到处乱钻吧？",
                        npc: 200021,
                    },
                ],
            },
            {
                id: 10030398,
                dialogues: [
                    {
                        id: 10033954,
                        content: "黎瑟长官！你醒啦！你、你怎么在哭？做噩梦了吗？",
                        npc: 200002,
                    },
                    {
                        id: 10033955,
                        content: "…………",
                        npc: 100360,
                    },
                    {
                        id: 10033956,
                        content: "我好像梦见……很多……从前的事……",
                        npc: 100360,
                    },
                    {
                        id: 10033957,
                        content: "小仆从、狗耳朵，快来！黎瑟长官醒啦！",
                        npc: 200002,
                    },
                    {
                        id: 10033901,
                        content: "（空气中弥漫的消毒水让鼻腔感到些许的刺激，落针可闻的房间中回荡着黎瑟平缓的呼吸。）",
                    },
                    {
                        id: 10033902,
                        content:
                            "（她的面色平静。如果不是骇人的伤口，甚至会让人误以为她只是陷入了一场宁静的梦——毕竟，她还是一个如此年轻的女孩子，本应是在可以做梦的年纪。）",
                    },
                    {
                        id: 10033903,
                        content: "看来一时半会儿是醒不了了。",
                        npc: 200021,
                    },
                    {
                        id: 10033904,
                        content: "呀！你走路怎么没声音的。",
                        npc: 200002,
                    },
                    {
                        id: 10033905,
                        content: "你来了，跟那群内城士兵说清楚情况了？",
                        npc: 100001,
                    },
                    {
                        id: 10033906,
                        content: "嗯，费半天劲可算是解释清楚了，她这咋样了？",
                        npc: 200021,
                    },
                    {
                        id: 10033907,
                        content: "说是已经脱离了危险，但……现在看起来丝毫没有要醒来的迹象。",
                        npc: 100001,
                    },
                    {
                        id: 10033908,
                        content: "会醒的。",
                        npc: 200021,
                    },
                    {
                        id: 10033909,
                        content: "咦——你居然懂医术！",
                        npc: 200002,
                    },
                    {
                        id: 10033910,
                        content: "我不太懂医术，但我懂一点人心。",
                        npc: 200021,
                    },
                    {
                        id: 10033911,
                        content: "看她的双手，那是常年高强度工作的人才会有的老茧。她是个认真的好士兵。",
                        npc: 200021,
                    },
                    {
                        id: 10033912,
                        content:
                            "而且她还是个固执的笨家伙。那双充满干劲的眼睛是我最烦的，因为这种人不知道放弃和变通，非得把自己搞得头破血流才知道疼。",
                        npc: 200021,
                    },
                    {
                        id: 10033913,
                        content: "正因如此，在解决“卡戎狩猎”之前，她是不会就此一睡不醒的。而我们现在要做的，就是好好休息，慢慢等她醒。",
                        npc: 200021,
                    },
                    {
                        id: 10033914,
                        content: "姐姐……姐姐！",
                        npc: 100357,
                    },
                    {
                        id: 10033915,
                        content: "布鲁斯……？别喊了，我再眯一会儿……",
                        npc: 100359,
                    },
                    {
                        id: 10033916,
                        content: "真是的，姐姐又在白天睡大觉——明天就要考试了！你还记得刚才我讲到哪儿了吗？",
                        npc: 100357,
                    },
                    {
                        id: 10033917,
                        content: "好像是……卡戎之民的……“罪业”？那、那是什么来着……",
                        npc: 100359,
                    },
                    {
                        id: 10033918,
                        content: "唉，一看姐姐你上课就又偷懒了。",
                        npc: 100357,
                    },
                    {
                        id: 10033919,
                        content: "嘿嘿……晚上工作太困了……这不是还有布鲁斯你给我补课嘛。",
                        npc: 100359,
                    },
                    {
                        id: 10033920,
                        content:
                            "唉，工作的话我也在一起做呀。我们总共就没两年书可读，你还不好好听讲……回到卡戎的“罪业”上来，那还得从<H>“泪湖之夜”</>说起……",
                        npc: 100357,
                    },
                    {
                        id: 10033921,
                        content:
                            "一千年前，就在我们的冰湖城，长着犄角的“恶魔”们——卡戎之民，假装和索拉之民一起在泪湖畔举行庆典，却在庆典那夜干了很坏很坏的事！在场的索拉人几乎都被杀掉了……",
                        npc: 100357,
                    },
                    {
                        id: 10038401,
                        content:
                            "那之后，卡戎之民更是在整个海伯利亚燃起战火，四处杀戮，直到帝国的缔造者——仁慈的迪斯·盖雷亚陛下结束了战争，带来了和平。",
                        npc: 100357,
                    },
                    {
                        id: 10033922,
                        content: "但因为“泪湖之夜”的过错，卡戎的后代必须用自己的人生，去偿还祖先犯下的罪。",
                        npc: 100357,
                    },
                    {
                        id: 10033923,
                        content: "可是可是，都过去这么久了……我们还是要花上一辈子去赎罪吗？",
                        npc: 100359,
                    },
                    {
                        id: 10033924,
                        content:
                            "没错，我们只能偿还……但要是能加入军团，成为海伯利亚忠诚的战士，甚至当上<H>桂冠卡戎</>，我们的生活或许……会变得不一样吧。",
                        npc: 100357,
                    },
                    {
                        id: 10033925,
                        content: "布鲁斯一定可以的！",
                        npc: 100359,
                    },
                    {
                        id: 10033926,
                        content: "有姐姐这句话，第六军团的考核感觉也没那么难了呢。",
                        npc: 100357,
                    },
                    {
                        id: 10033927,
                        content: "那么，今天的费西尔家庭小课堂就在我动听的口琴声中下课吧……咦，我的口琴呢？",
                        npc: 100357,
                    },
                    {
                        id: 10033928,
                        content: "早就说了，给口琴加一条皮绳或者链子什么的……算了，你肯定又要说太贵了不划算，之后我做一条送给你好啦。",
                        npc: 100359,
                    },
                    {
                        id: 10033953,
                        content: "嗯，布鲁斯……我会……加油。我们……一起到……城墙上……",
                        npc: 100304,
                    },
                    {
                        id: 10033929,
                        content: "工厂那边怎么说？",
                        npc: 100304,
                    },
                    {
                        id: 10033930,
                        content: "都办好啦，有第六军团的任命书，工厂主也没法像以前那样刁难我了。",
                        npc: 100358,
                    },
                    {
                        id: 10033931,
                        content: "对了姐姐，你在卫戍部队还适应吗？",
                        npc: 100358,
                    },
                    {
                        id: 10033932,
                        content: "哈哈……这才刚开始嘛，别着急。",
                        npc: 100304,
                    },
                    {
                        id: 10033933,
                        content: "那就是不太适应喽？唉，所以我说别急着加入卫戍部队，安心为明年的第六军团考核做准备多好。",
                        npc: 100358,
                    },
                    {
                        id: 10033934,
                        content: "不用啦，我各项测验都差合格线很多，资质靠努力是弥补不了的。",
                        npc: 100304,
                    },
                    {
                        id: 10033935,
                        content: "如果能在卫戍部队做出点功绩，也有机会成为桂冠卡戎吧？而且，也多少能帮到冰湖城的人们……",
                        npc: 100304,
                    },
                    {
                        id: 10033936,
                        content: "能一起通过考核自然是好，但是没那个天分的话，也不能强求。就用笨方法摸索着走走看吧。",
                        npc: 100304,
                    },
                    {
                        id: 10033937,
                        content: "姐姐，你看，那是什么？",
                        npc: 100358,
                    },
                    {
                        id: 10033938,
                        content: "是……房子？",
                        npc: 100304,
                    },
                    {
                        id: 10033939,
                        content: "这个答案太笼统了！看，看我手指指的地方。",
                        npc: 100358,
                    },
                    {
                        id: 10033940,
                        content: "……哨塔？",
                        npc: 100304,
                    },
                    {
                        id: 10033941,
                        content: "嗯嗯——确切来说，是哨塔上那盏灯。那是整座冰湖城最高的地方！",
                        npc: 100358,
                    },
                    {
                        id: 10033942,
                        content:
                            "我每次站在这儿往内城看，都觉得它那么高，那么远，那么亮。就像书本上写的灯塔，只能远远看着，但永远都摸不到。",
                        npc: 100358,
                    },
                    {
                        id: 10033943,
                        content: "但是现在，我和之前不一样了，我成“桂冠卡戎”了！之前的好多好多愿望，表演啊弹琴啊，都不再是白日做梦了！",
                        npc: 100358,
                    },
                    {
                        id: 10033944,
                        content: "我可以到内城，爬到哨塔上面，站在那盏灯下……我觉得自己就像是冰湖城的皇帝！",
                        npc: 100358,
                    },
                    {
                        id: 10033945,
                        content: "“士兵们听令——全军出击！为了海伯利亚的荣耀！”",
                        npc: 100358,
                    },
                    {
                        id: 10033946,
                        content: "小点声，不要命啦！",
                        npc: 100304,
                    },
                    {
                        id: 10033947,
                        content: "啊，对不起，我太激动了，嘿嘿……",
                        npc: 100358,
                    },
                    {
                        id: 10033948,
                        content:
                            "对了，第六军团还是蛮辛苦的，长官说入伍前三年都是封闭式训练，回不了家……如果姐姐想我的话，就经常看看内城那盏灯吧。",
                        npc: 100358,
                    },
                    {
                        id: 10033949,
                        content:
                            "我会好好在内城等你的。我会把薪水好好攒起来，让你过上好日子。到时候我们想看戏就看戏，想吃好吃的就吃好吃的……再也不会有人欺负我们了。",
                        npc: 100358,
                    },
                    {
                        id: 10033950,
                        content: "布鲁斯……",
                        npc: 100304,
                    },
                    {
                        id: 10033951,
                        content:
                            "姐、姐姐，你怎么哭了！不用担心，不用担心，等三年期满我们就能见面啦！而且，说不定……说不定你运气好，明年就成了桂冠卡戎呢！",
                        npc: 100358,
                    },
                    {
                        id: 10033952,
                        content: "到时候我们一起爬到城墙的最上面，让冰湖城的所有人都看到，我们有多了不起！",
                        npc: 100358,
                    },
                    {
                        id: 10033958,
                        content: "居然真被狗耳朵说中了，黎瑟长官和我们队长一样，生命超顽强的！",
                        npc: 200002,
                    },
                    {
                        id: 10033959,
                        content: "是你们……我记得刚才是在和布——不对，是和你们在下水道……抓……",
                        npc: 100360,
                    },
                    {
                        id: 10033960,
                        content: "怪物！那只怪物，“卡戎狩猎”的凶手……抓到了吗？",
                        npc: 100360,
                    },
                    {
                        id: 10033961,
                        content: "别急，别急，你都躺了两天了，先喝口水，吃点东西，慢慢说。",
                        npc: 200021,
                    },
                    {
                        id: 10033962,
                        content: "我来讲吧。那天你被救走之后……",
                        npc: 100001,
                    },
                    {
                        id: 10033963,
                        content: "最后还是……让它逃了吗……我——",
                        npc: 100360,
                    },
                    {
                        id: 10033964,
                        content: "别动别动别动，你不会又想自己跑一趟那个下水道吧？你们军团的人在那搜着呢，你还病着，别去添乱了。",
                        npc: 200021,
                    },
                    {
                        id: 10033965,
                        content: "嗯。你已经尽力了，接下来就交给你的同伴吧。",
                        npc: 100001,
                    },
                    {
                        id: 10033966,
                        content: "…………",
                        npc: 100360,
                    },
                    {
                        id: 10033967,
                        content: "抱歉，耽误了你们的时间，连之前答应帮你找亲人的承诺都没法立刻履行了。",
                        npc: 100360,
                    },
                    {
                        id: 10033968,
                        content: "嗯……对了。",
                        npc: 100360,
                    },
                    {
                        id: 10033969,
                        content: "这是我秘密基地的钥匙，地址就写在钥匙的背面。你们能去那帮我拿一下刻有我名字的银色印章吗？",
                        npc: 100360,
                    },
                    {
                        id: 10033970,
                        content: "虽然现在没法亲自帮你，但写几封信拜托别人还是能做到的。",
                        npc: 100360,
                    },
                ],
            },
            {
                id: 10030399,
                dialogues: [
                    {
                        id: 10033803,
                        content: "前方是内城，卡戎之民没有特殊许可禁止通行！",
                        npc: 100325,
                    },
                    {
                        id: 10033804,
                        content: "哦哦，是你们啊。别那么凶，{性别：他们|她们}刚刚给卫戍部队帮了大忙。",
                        npc: 100325,
                    },
                    {
                        id: 10033805,
                        content: "你们来内城做什么？",
                        npc: 100325,
                    },
                    {
                        id: 10033806,
                        content: "我们想看看黎瑟长官的状况。",
                        npc: 100001,
                    },
                    {
                        id: 10033807,
                        content: "听说救回来一条命，还昏迷着。真要看她的话，我带你们进去吧。低调点，跟着我。",
                        npc: 100325,
                    },
                    {
                        id: 10033802,
                        content: "小仆从小仆从，走这边。",
                        npc: 200002,
                    },
                ],
            },
        ],
    },
    {
        id: 100304,
        quests: [
            {
                id: 10030401,
                dialogues: [
                    {
                        id: 10035246,
                        content: "我们之前根据帷幕这条线索推测凶手可能与歌剧院有关，但工作人员的嫌疑已经被排除了。",
                        npc: 100001,
                    },
                    {
                        id: 10035247,
                        content: "但下水道密室的线索来看，凶手和歌剧还是有千丝万缕的联系。",
                        npc: 100001,
                    },
                    {
                        id: 10035248,
                        content: "没错，假设凶手是一位<H>歌剧爱好者</>……那么那夜你听到的旋律，很有可能是<H>歌剧唱段</>的旋律。",
                        npc: 100304,
                    },
                    {
                        id: 10035249,
                        content: "大家有谁懂歌剧？",
                        npc: 100001,
                    },
                    {
                        id: 10035250,
                        content: "这么高雅的东西就别看我啦。",
                        npc: 200021,
                    },
                    {
                        id: 10035251,
                        content: "唔，我也不会……黎瑟长官呢？",
                        npc: 200002,
                    },
                    {
                        id: 10035252,
                        content: "抱歉，我说过我五音不全……唉，如果当时布鲁斯缠着我听录音带的时候，我没有偷偷睡觉就好了。",
                        npc: 100304,
                    },
                    {
                        id: 10035253,
                        content:
                            "等等……布鲁斯……他就是个狂热歌剧迷，我记得他在秘密基地里留下了很多录音带！虽然只能用笨办法全听一遍，但，说不定能找到那首歌！",
                        npc: 100304,
                    },
                    {
                        id: 10035254,
                        content: "好家伙！谢谢布鲁斯，哥们儿帮大忙了。队长，咱们再回一趟那个秘密基地吧。",
                        npc: 200021,
                    },
                    {
                        id: 10035101,
                        content: "第二天",
                    },
                    {
                        id: 10035201,
                        content: "哇，好大的阵仗！真威风呀！",
                        npc: 200002,
                    },
                    {
                        id: 10035202,
                        content: "嘁，来的时候说那么好听，结果还是糊弄一下就交差。",
                        npc: 200021,
                    },
                    {
                        id: 10035203,
                        content: "你不去参加送行仪式吗？",
                        npc: 100001,
                    },
                    {
                        id: 10035204,
                        content: "你让我们一板一眼的小长官昧着良心宣布<H>卡戎狩猎圆满结案</>？她要能说出口，小矮子天天倒着走。",
                        npc: 200021,
                    },
                    {
                        id: 10035205,
                        content: "后边去，别挡道。",
                        npc: 100335,
                    },
                    {
                        id: 10035206,
                        content: "呜哇——",
                        npc: 200002,
                    },
                    {
                        id: 10035207,
                        content: "…………",
                        npc: 200021,
                    },
                    {
                        id: 10035208,
                        content: "……唉。",
                        npc: 100304,
                    },
                    {
                        id: 10035244,
                        content: "我们现在需要确认凶手的下落和凶手的身份，但能用的线索似乎都断掉了。",
                        npc: 100001,
                    },
                    {
                        id: 10035245,
                        content: "重新整理一下目前的线索，看看有没有什么被我们遗漏的吧。",
                        npc: 100001,
                    },
                ],
            },
            {
                id: 10030402,
                dialogues: [
                    {
                        id: 10035255,
                        content: "由冰湖城开往迪斯玛尼亚的列车将在一小时后出发。祝第十三军团返程顺利，荣耀尽归吾皇！",
                    },
                ],
            },
            {
                id: 10030403,
                dialogues: [
                    {
                        id: 10035301,
                        content: "收集这么多录音带，你弟弟是不是很富有呀！",
                        npc: 200002,
                    },
                    {
                        id: 10035302,
                        content: "不是的，那些都是他从朋友那里翻录的。",
                        npc: 100304,
                    },
                    {
                        id: 10035306,
                        content: "这些就是全部了吗？",
                        npc: 100001,
                    },
                    {
                        id: 10035307,
                        content: "没有？",
                        npc: 200021,
                    },
                    {
                        id: 10035303,
                        content: "旋律很像，但不太一样，凶手的声音更悲伤一些。",
                        npc: 100001,
                    },
                    {
                        id: 10035304,
                        content: "耳朵，我的耳朵！这也能叫歌吗！布鲁斯暗算我！",
                        npc: 100001,
                    },
                    {
                        id: 10035305,
                        content: "这个……感觉不太像。",
                        npc: 100001,
                    },
                ],
            },
            {
                id: 10030404,
                dialogues: [
                    {
                        id: 10035310,
                        content: "“……无言的白雪啊，苍穹的女儿……为那无名的孩子献上祝福……他和雪花跳起轻快的舞……”",
                        npc: 100304,
                    },
                    {
                        id: 10035311,
                        content: "……就是这个！就是这个旋律。它叫什么，唱的什么意思？",
                        npc: 100001,
                    },
                    {
                        id: 10035312,
                        content: "咦？这个吗……我没留意，下意识就哼出来了。我想一下……",
                        npc: 100304,
                    },
                    {
                        id: 10035313,
                        content:
                            "这首是布鲁斯教给我的，叫《致无名者的安魂曲》，是歌剧《雪国的孩子》里的唱段。不过我唱的歌词不太对，真正的歌词应该会更悲伤一点。",
                        npc: 100304,
                    },
                    {
                        id: 10035314,
                        content:
                            "那首歌本来好像讲的是……一只无名的妖精，为了救它的朋友而牺牲，但朋友直到最后都不知道这件事，只有白雪记住了一切。",
                        npc: 100304,
                    },
                    {
                        id: 10035315,
                        content:
                            "不过布鲁斯不喜欢这个结局，所以自作主张把歌词改成了一个快乐的版本。他熟到能把这首歌倒着演奏，所以没录过这首……",
                        npc: 100304,
                    },
                    {
                        id: 10035316,
                        content: "你是说，你听到的就是它……？",
                        npc: 100304,
                    },
                    {
                        id: 10035317,
                        content: "对，我遇袭当晚听到的就是这个旋律！",
                        npc: 100001,
                    },
                    {
                        id: 10035318,
                        content: "…………",
                        npc: 100304,
                    },
                    {
                        id: 10035319,
                        content:
                            "虽然是新的线索，但很遗憾，这条线索指向的范围太广了。《雪国的孩子》在盖雷亚剧院已经上演了几十年，曾经是非常热门的剧，所以这里很多人都会唱。",
                        npc: 100304,
                    },
                    {
                        id: 10035320,
                        content: "有一次，我和布鲁斯攒了大半年的钱，好不容易才买到那场剧的门票，却在现场被冤枉成偷了别人的票，被赶了出来。",
                        npc: 100304,
                    },
                    {
                        id: 10035321,
                        content:
                            "那夜我靠着剧院的墙坐了很久，心情糟透了。布鲁斯却像变魔术一样掏出口琴，吹起了那首歌的旋律。原来，他自己早就练会了这首曲子……",
                        npc: 100304,
                    },
                    {
                        id: 10035322,
                        content: "他吹着吹着，在墙的另一边，突然就有个男孩子跟着唱起来了。他的歌喉好动听，像云雀一样。",
                        npc: 100304,
                    },
                    {
                        id: 10035323,
                        content: "那一晚，因为有布鲁斯的口琴，还有那个陌生人的跟唱，我好开心，都快忘了自己被赶出来的事。",
                        npc: 100304,
                    },
                    {
                        id: 10035324,
                        content: "抱歉，不好意思，自顾自地说起来了。我的意思是，这首歌会的人太多了，无法成为指向性的证据。",
                        npc: 100304,
                    },
                    {
                        id: 10035325,
                        content: "那，这出戏近期会上演吗？没准我们可以蹲点试试。",
                        npc: 200021,
                    },
                    {
                        id: 10035326,
                        content: "近期吗……我不太清楚。不过据我所知，这出剧这两年已经停演了，因为一起发生在盖雷亚剧院的<H>事故</>。",
                        npc: 100304,
                    },
                    {
                        id: 10035327,
                        content: "事故？",
                        npc: 100001,
                    },
                    {
                        id: 10035328,
                        content: "嗯，之前整理案卷的时候，在笔录里看到的。倒不是什么大事，只是两年前演出现场的一起斗殴。",
                        npc: 100304,
                    },
                    {
                        id: 10035329,
                        content: "但普奇剧团长说，因为这起事故中主演受了伤，“魔笛”剧团将暂停《雪国的孩子》的后续演出。",
                        npc: 100304,
                    },
                    {
                        id: 10035330,
                        content: "我翻翻本子——嗯，还有当时抄的笔记。",
                        npc: 100304,
                    },
                    {
                        id: 10035331,
                        content:
                            "盖雷亚剧院斗殴事件\n\n时间：10月9日晚8:30\n\n报案人：莱蒂齐娅·普奇（“魔笛”剧团团长）\n\n参与斗殴双方：帕西法尔·斯诺菲尔德（主演）、苏珊娜·罗西（主演）……\n马修·伯纳德（观众）、菲利·弗兰西斯科（观众）……\n\n事件：疑似剧团成员与前排观众就剧目发生冲突？疑似观众殴打演员？（部分笔录内页被撕掉了）\n\n结论：证据不足，不予立案\n\n备注：《雪国的孩子》暂时停演，演出时间不定。\n很想和布鲁斯弥补一下当年看不成剧的遗憾，但似乎短时间内没有机会了。",
                    },
                    {
                        id: 10035332,
                        content: "不过，除了继续调查下水道之外，眼下也只有这一条新线索了……",
                        npc: 100304,
                    },
                    {
                        id: 10035333,
                        content: "你刚才提醒了我，如果《雪国的孩子》对凶手的确有特殊意义，那的确可以考虑引蛇出洞。",
                        npc: 100304,
                    },
                    {
                        id: 10035334,
                        content: "对喽。咱们去剧院问问普奇剧团长，看看她老人家能不能帮个忙，放个假消息吧。",
                        npc: 200021,
                    },
                    {
                        id: 10035335,
                        content: "愚蠢。",
                        npc: 100327,
                    },
                ],
            },
            {
                id: 10030405,
                dialogues: [
                    {
                        id: 10035407,
                        content: "别来无恙，姐姐。",
                        npc: 100327,
                    },
                    {
                        id: 10035408,
                        content: "…………？！",
                        npc: 100304,
                    },
                    {
                        id: 10035409,
                        content: "算了……我现在应该，称呼你，黎瑟长官。你，冷静点，了吗。",
                        npc: 100327,
                    },
                    {
                        id: 10035410,
                        content: "……你到底是谁？！",
                        npc: 100304,
                    },
                    {
                        id: 10035411,
                        content: "布鲁斯·费西尔。你的，弟弟。那把口琴的，主人。",
                        npc: 100327,
                    },
                    {
                        id: 10035412,
                        content: "布鲁斯？你为什么打扮成这样……你的嗓子怎么了……？",
                        npc: 100304,
                    },
                    {
                        id: 10035413,
                        content: "你不是一直在内城服役吗？为什么……你会……",
                        npc: 100304,
                    },
                    {
                        id: 10035414,
                        content: "呵……",
                        npc: 100327,
                    },
                    {
                        id: 10035415,
                        content:
                            "不对，你在说谎。我的弟弟布鲁斯热诚又善良，他视他人的痛苦为自己的痛苦，视所有同胞为手足！他不可能犯下<H>卡戎狩猎</>这种暴行！",
                        npc: 100304,
                    },
                    {
                        id: 10035401,
                        content: "……凶手果然还活着！",
                        npc: 100304,
                    },
                    {
                        id: 10035402,
                        content: "好家伙，自己找上门来了……",
                        npc: 200021,
                    },
                    {
                        id: 10035403,
                        content: "“凶手”……",
                        npc: 100327,
                    },
                    {
                        id: 10035404,
                        content: "看来，直到最后，他们也，没告诉你，真相。果然十三军团，也是，一丘之貉。",
                        npc: 100327,
                    },
                    {
                        id: 10035405,
                        content: "真相？你在说什么……",
                        npc: 100304,
                    },
                    {
                        id: 10035406,
                        content: "这怪物在拖延时间，先制服它！",
                        npc: 200021,
                    },
                ],
            },
            {
                id: 10030498,
                dialogues: [
                    {
                        id: 10034401,
                        content: "嗯，明智的选择。",
                        npc: 200022,
                    },
                    {
                        id: 10034402,
                        content: "那么狩月人，第一个任务，拿上这份清单去停车场找克莱夫，接一下我们要用的武器弹药。",
                        npc: 200022,
                    },
                    {
                        id: 10034403,
                        content: "……好。",
                        npc: 100001,
                    },
                    {
                        id: 10034404,
                        content: "等整理完报告，我便与你们会合。",
                        npc: 100304,
                    },
                ],
            },
        ],
    },
    {
        id: 100305,
        quests: [
            {
                id: 10030508,
                dialogues: [
                    {
                        id: 10036126,
                        content: "我们出来了！",
                        npc: 100327,
                    },
                    {
                        id: 10036127,
                        content: "这是炼金院的下水道……应该会有通到外面的排水口。",
                        npc: 100328,
                    },
                    {
                        id: 10036128,
                        content: "太好了……我们……自由了……",
                        npc: 100328,
                    },
                    {
                        id: 10036129,
                        content: "——呃！",
                        npc: 100328,
                    },
                    {
                        id: 10036130,
                        content: "你的伤……接下来交给我。",
                        npc: 100328,
                    },
                    {
                        id: 10036131,
                        content: "首先，要找个地方藏身……",
                        npc: 100328,
                    },
                ],
            },
            {
                id: 10030509,
                dialogues: [
                    {
                        id: 10036201,
                        content: "原来下水道那个奇怪的舞台，就是你们一点点搭起来的啊。",
                        npc: 200021,
                    },
                    {
                        id: 10036202,
                        content: "怎会……为什么……布鲁斯……你……",
                        npc: 100304,
                    },
                    {
                        id: 10036203,
                        content: "……还痛吗？",
                        npc: 100304,
                    },
                    {
                        id: 10036204,
                        content: "我……还好。",
                        npc: 100327,
                    },
                    {
                        id: 10036205,
                        content: "只可惜，命运只是，短暂地，垂怜了我们一下。逃出炼金院，不是，新生活的开始，而是，结束……",
                        npc: 100327,
                    },
                    {
                        id: 10036206,
                        content: "……逃跑时，炼金术师，新型抑制剂……毁掉了，我的，喉咙，更摧毁了……心智……",
                        npc: 100327,
                    },
                    {
                        id: 10036207,
                        content: "我们时常，发疯，失控……而我的朋友，<H>36号</>，已经先我一步……",
                        npc: 100327,
                    },
                    {
                        id: 10036208,
                        content:
                            "啧，早就知道炼金院那群炼金术师不是人，没想到这么不是人。居然和第六军团勾结，把魔法资质好的卡戎之民骗去做实验……",
                        npc: 200021,
                    },
                    {
                        id: 10036209,
                        content: "姐姐，你听好。",
                        npc: 100327,
                    },
                    {
                        id: 10036210,
                        content: "第六军团，用桂冠卡戎，欺骗我们。",
                        npc: 100327,
                    },
                    {
                        id: 10036211,
                        content: "离开，军团。",
                        npc: 100327,
                    },
                    {
                        id: 10036212,
                        content: "找个，安稳的地方，好好——",
                        npc: 100327,
                    },
                    {
                        id: 10036213,
                        content: "那你呢，你要怎么办？！",
                        npc: 100304,
                    },
                    {
                        id: 10036214,
                        content: "我……",
                        npc: 100327,
                    },
                    {
                        id: 10036215,
                        content: "五天前，下水道出口",
                    },
                    {
                        id: 10036217,
                        content: "都怪我。如果我能早点赶来，你就不会被他们……",
                    },
                    {
                        id: 10036218,
                        content: "没机会，的。我能清醒的时间，在缩短。",
                    },
                    {
                        id: 10036219,
                        content: "也可能是，如你所说，我的心，真的变成了……怪物。",
                    },
                    {
                        id: 10036220,
                        content: "你是怪物的话，那我又是什么呢？",
                    },
                    {
                        id: 10036221,
                        content: "我们追逐的，那盏灯，原来这么耀眼，高不可及啊。",
                    },
                    {
                        id: 10036222,
                        content: "高不可及的东西，让它坠落到地面来不就好了吗？",
                        npc: 100326,
                    },
                    {
                        id: 10036223,
                        content: "当心，<H>他身上有毒</>……你是谁！",
                    },
                    {
                        id: 10036224,
                        content:
                            "我有很多个名字，也有很多种身份，但这些说到底只是一个代号。而代号不管怎么变，我们这被神抛弃的本质都不会更改。",
                        npc: 100326,
                    },
                    {
                        id: 10036225,
                        content: "说到这里，聪明的你们应该知道我是谁了吧。",
                        npc: 100326,
                    },
                    {
                        id: 10036226,
                        content: "我是来向你们发出一个邀请，加入我们，将那高不可及的索拉之民拖到地上，感受卡戎的怒火。",
                        npc: 100326,
                    },
                    {
                        id: 10036227,
                        content:
                            "别急着拒绝。好好想想帝国对你们的所作所为吧！他们用美好的谎言欺骗你们，用残忍的刑罚折磨你们，用无尽的绝望笼罩你们。",
                        npc: 100326,
                    },
                    {
                        id: 10036228,
                        content: "在这条路的尽头等你们的是什么？当上“桂冠卡戎”，过上更好的生活，实现更远的梦想？",
                        npc: 100326,
                    },
                    {
                        id: 10036229,
                        content: "不！是被索拉人敲骨吸髓，被同胞中的叛徒追捕，最后死在哪个不知名的角落。",
                        npc: 100326,
                    },
                    {
                        id: 10036230,
                        content: "他们用一个简单的承诺，驱使如你，如我，如所有渴望出人头地的卡戎，一头扎进深渊。",
                        npc: 100326,
                    },
                    {
                        id: 10036231,
                        content:
                            "只要第六军团和炼金院的谎言不被戳破，就不断会有冰湖城的卡戎之民沿着军团这条路走下去，一个又一个，踏上和你们一样的悲剧。",
                        npc: 100326,
                    },
                    {
                        id: 10036232,
                        content: "…………！",
                    },
                    {
                        id: 10036233,
                        content: "我们被帝国夺走了过去，苟活在当下。未来我们也要这样毫无作为，让那群畜生碾碎我们所珍视的一切吗？",
                        npc: 100326,
                    },
                    {
                        id: 10036234,
                        content: "看啊，看看现在的你我。帝国贪求我们的力量，为我们套上镣铐，把我们变成野兽，沦为真正的恶魔。",
                        npc: 100326,
                    },
                    {
                        id: 10036235,
                        content: "如今我们好不容易挣脱了枷锁，那不正是用帝国给予我们的这副獠牙，狠狠咬向他们咽喉的时刻吗！",
                        npc: 100326,
                    },
                    {
                        id: 10036236,
                        content:
                            "让他们记住我们的存在，感受我们的痛苦，再也不敢觊觎我们珍视的东西！让他们用鲜血去忏悔，去铭记我们的存在，让整个帝国呼唤我们的名字！",
                        npc: 100326,
                    },
                    {
                        id: 10036237,
                        content: "<W>神弃者同盟</>……",
                    },
                    {
                        id: 10036238,
                        content:
                            "你们可以把它理解成报复，但我更希望你们把它理解成保护，这是只有我们“恶魔”才能做到的责任——清理内城的“垃圾”，还你们的家人一个干净的未来。",
                        npc: 100326,
                    },
                    {
                        id: 10036239,
                        content: "（神弃者同盟……）",
                        npc: 100328,
                    },
                    {
                        id: 10036240,
                        content: "我还有，未竟之事。",
                        npc: 100327,
                    },
                    {
                        id: 10036241,
                        content: "布鲁斯！",
                        npc: 100304,
                    },
                    {
                        id: 10036242,
                        content: "不要跟来。",
                        npc: 100327,
                    },
                ],
            },
        ],
    },
    {
        id: 100307,
        quests: [
            {
                id: 10030701,
                dialogues: [
                    {
                        id: 10037501,
                        content: "哨塔上的灯……熄灭了。",
                        npc: 100304,
                    },
                    {
                        id: 10037502,
                        content: "啊……是你们来了。早安。",
                        npc: 100304,
                    },
                    {
                        id: 10037503,
                        content: "那时的伤，不要紧吗？",
                        npc: 100001,
                    },
                    {
                        id: 10037504,
                        content: "没事，都过去好几天了。",
                        npc: 100304,
                    },
                    {
                        id: 10037505,
                        content:
                            "真的没事了吗，那时小仆从说太危险了，非得黑着脸不让我跟过去。但后来我听完经过，感觉怎么都不像随随便便就能没事的样子哇……",
                        npc: 200002,
                    },
                    {
                        id: 10037506,
                        content: "黎瑟……",
                        npc: 100001,
                    },
                    {
                        id: 10037507,
                        content: "不用再说了，这也是无可奈何的事。",
                        npc: 100304,
                    },
                    {
                        id: 10037508,
                        content: "这个世界本就是由众多无可奈何拼凑而成的，所以没关系。",
                        npc: 100304,
                    },
                    {
                        id: 10037509,
                        content: "我明白了。",
                        npc: 100001,
                    },
                    {
                        id: 10037510,
                        content: "话说，这枚奖章……",
                        npc: 200021,
                    },
                    {
                        id: 10037511,
                        content: "嗯，是“桂冠卡戎”的奖章。琳恩长官颁发给我的……为了奖励我在这次事件中的“卓越贡献”。",
                        npc: 100304,
                    },
                    {
                        id: 10037512,
                        content: "恭喜。",
                        npc: 200021,
                    },
                    {
                        id: 10037513,
                        content: "“恭喜”……吗。如果是过去的我，这个时候，确实会很开心吧。",
                        npc: 100304,
                    },
                    {
                        id: 10037514,
                        content:
                            "但这枚奖章对现在的我来说唯一的用处，就是让我递交辞呈的时候没被为难。它沾了太多人的血和泪水，如今已经没有意义。",
                        npc: 100304,
                    },
                    {
                        id: 10037515,
                        content: "贝蕾妮卡的确切消息，还是没有打探到。",
                        npc: 100304,
                    },
                    {
                        id: 10037516,
                        content:
                            "我打听了你后来告诉我的“零号”，但我的熟人说，十三军团的人听到这个名字立即三缄其口，讳莫如深，不肯透露她的具体消息。",
                        npc: 100304,
                    },
                    {
                        id: 10037517,
                        content:
                            "不过，有两件事姑且能从对方的反应推测出来。一是，她的确在第十三军团；二是，她很珍贵，军团不会贸然处置她。布鲁斯的事……不会轻易发生在她身上。",
                        npc: 100304,
                    },
                    {
                        id: 10037518,
                        content: "……谢谢，我稍微……安心了些。",
                        npc: 100001,
                    },
                    {
                        id: 10037519,
                        content: "对了，有另外一个消息，不知道会不会有帮助。",
                        npc: 100304,
                    },
                    {
                        id: 10037520,
                        content:
                            "一个月后，第十三军团会押解一名重要的囚犯，乘列车从冰湖城出发，前往皇都迪斯玛尼亚。第六军团也接到了协助命令。",
                        npc: 100304,
                    },
                    {
                        id: 10037521,
                        content:
                            "那名囚犯的身份是一级机密，我只知道她正在内城接受治疗，身边有最严密的防护。不过有人看到了她的背影，是一位身着黑衣、<H>二十岁出头的年轻姑娘</>。",
                        npc: 100304,
                    },
                    {
                        id: 10037522,
                        content: "这和贝蕾妮卡的信息对得上。如果真的是她，那<H>一个月后的列车</>，也许是你唯一的机会。",
                        npc: 100304,
                    },
                    {
                        id: 10037528,
                        content: "（会是贝蕾吗？她……也和我一样，被带到了冰湖城？）",
                        npc: 100001,
                    },
                    {
                        id: 10037523,
                        content: "我知道了，谢谢你的情报。这是目前唯一的线索，无论如何我都会试试看。",
                        npc: 100001,
                    },
                    {
                        id: 10037524,
                        content: "那么，你接下来准备做什么？",
                        npc: 100001,
                    },
                    {
                        id: 10037525,
                        content: "老实说，除了帮你打听贝蕾妮卡的下落以外，我也不知道……但我答应了<H>布鲁斯</>，会活下去。",
                        npc: 100304,
                    },
                    {
                        id: 10037526,
                        content: "只要活下去，总能找到一个活着的理由的，不是吗？",
                        npc: 100304,
                    },
                    {
                        id: 10037527,
                        content: "以后，麻烦各位了。",
                        npc: 100304,
                    },
                ],
            },
            {
                id: 10030702,
                dialogues: [
                    {
                        id: 10037601,
                        content:
                            "欢迎回来，你要先喝点什么还是先吃点什么呢？慰问品我都放在你左手边的柜子里喽，种类繁多任君挑选，总有一款适合你。",
                        npc: 100006,
                    },
                    {
                        id: 10037602,
                        content: "给你一枪最适合我。",
                        npc: 200022,
                    },
                    {
                        id: 10038301,
                        content: "哎呀，这不是听说你伤得不轻，特地来慰问一下嘛。",
                        npc: 100006,
                    },
                    {
                        id: 10038302,
                        content: "免了，没死就是没事。我又不是你这种娇生惯养的少爷。",
                        npc: 200022,
                    },
                    {
                        id: 10037603,
                        content: "好难过啊……明明给你提了那么好一个钓大鱼的主意却只能收到一通臭骂。",
                        npc: 100006,
                    },
                    {
                        id: 10037604,
                        content: "唉，亏我还满心期待地幻想着，善良的琳恩小姐回来以后会感谢我的出谋划策呢。",
                        npc: 100006,
                    },
                    {
                        id: 10037605,
                        content: "……“敬爱的兰迪长官，万分感谢感激感动感恩您聪慧的谋略！”……行了吧。",
                        npc: 200022,
                    },
                    {
                        id: 10037606,
                        content:
                            "虽然要抓的那个“渡鸦”死了，但顺着他身上的文件，我们一举剪除了神弃者同盟在冰湖城的势力——现在他们想要扩张到科赛托斯地区的计划彻底泡汤了。",
                        npc: 100006,
                    },
                    {
                        id: 10037607,
                        content:
                            "而且死人还有死人的用法，利用这个时间和信息差，也许能趁此机会把探子插入神弃者同盟内部呢。这可是大功一件啊。说不定过不了多久，你就成我上司了。",
                        npc: 100006,
                    },
                    {
                        id: 10037608,
                        content: "…………",
                        npc: 200022,
                    },
                    {
                        id: 10037609,
                        content: "怎么了？从回来就一直拉着脸，难不成你在老家遇到了什么老债主催你还钱？",
                        npc: 100006,
                    },
                    {
                        id: 10037623,
                        content: "没事，我累了，脑袋疼，回去睡觉了。",
                        npc: 200022,
                    },
                    {
                        id: 10037624,
                        content: "哈哈，可算等到你说“休息”了。生命在于休息，你终于听进去了上司的谆谆教诲，可喜可贺。",
                        npc: 100006,
                    },
                    {
                        id: 10037625,
                        content: "……等等，还有件事。",
                        npc: 200022,
                    },
                    {
                        id: 10037626,
                        content: "怎么还有！我的假期——",
                        npc: 100006,
                    },
                    {
                        id: 10037627,
                        content: "闭嘴，没你假期。",
                        npc: 200022,
                    },
                    {
                        id: 10037628,
                        content: "我们在二号目标的身上发现了这个——这字条皱巴巴的，上面都是一些乱七八糟啰啰嗦嗦的字。",
                        npc: 200022,
                    },
                    {
                        id: 10037629,
                        content: "这些文绉绉的东西我也看不太懂，你研究下吧，别是还有没发现的密信什么的。",
                        npc: 200022,
                    },
                    {
                        id: 10037630,
                        content: "行吧，我看看……“无言的白雪啊，苍穹的女儿”……",
                        npc: 100006,
                    },
                    {
                        id: 10037631,
                        content: "这好像是，呃，一首诗？还是什么歌的歌词？",
                        npc: 100006,
                    },
                    {
                        id: 10037610,
                        content: "西比尔军团长！",
                        npc: 200022,
                    },
                    {
                        id: 10037611,
                        content: "还有什么事？",
                        npc: 100005,
                    },
                    {
                        id: 10037612,
                        content:
                            "我汇报的另一件事，关于冰湖城佩剑炼金院和第六军团勾结，在科赛托斯省以招募考核为名的非法实验……第十三军团真的完全不打算追究吗？",
                        npc: 200022,
                    },
                    {
                        id: 10037613,
                        content: "第六军团，是第十三军团的“盟友”。",
                        npc: 100005,
                    },
                    {
                        id: 10037614,
                        content: "勾结神弃者同盟、在冰湖城犯下罪行的，是第十三军团的“敌人”。",
                        npc: 100005,
                    },
                    {
                        id: 10037615,
                        content: "但是……！",
                        npc: 200022,
                    },
                    {
                        id: 10037616,
                        content: "多漂亮啊，这枚象征着荣耀的勋章。多亏了它，你才能活着站在这里。",
                        npc: 100005,
                    },
                    {
                        id: 10037617,
                        content: "退下吧。不要忘记自己应当做什么。",
                        npc: 100005,
                    },
                    {
                        id: 10037618,
                        content: "……是……",
                        npc: 200022,
                    },
                    {
                        id: 10037619,
                        content: "琳恩。",
                        npc: 100005,
                    },
                    {
                        id: 10037620,
                        content: "我年轻的时候，也会和你有同样的想法。",
                        npc: 100005,
                    },
                    {
                        id: 10037621,
                        content: "……但是，想要成为真正的英雄，必须学会一件事。",
                        npc: 100005,
                    },
                    {
                        id: 10037622,
                        content: "——“舍弃”。",
                        npc: 100005,
                    },
                ],
            },
        ],
    },
    {
        id: 110101,
        quests: [
            {
                id: 11010106,
                dialogues: [
                    {
                        id: 11010301,
                        content: "……有没有受伤？",
                        npc: 110005,
                    },
                    {
                        id: 11010302,
                        content: "没事。",
                        npc: 110022,
                    },
                    {
                        id: 11010303,
                        content: "那就好。您被那只秽兽缠住的时候，我还以为再也……",
                        npc: 110005,
                    },
                    {
                        id: 11010304,
                        content: "……总之，没事就好。",
                        npc: 110005,
                    },
                    {
                        id: 11010305,
                        content: "不过……我们也没剩下多少人了，侥幸活下来的都伤得很重。",
                        npc: 110005,
                    },
                    {
                        id: 11010306,
                        content: "如果得空，可以请您陪伤员们说说话吗？",
                        npc: 110005,
                    },
                    {
                        id: 11010307,
                        content: "谢谢。我要回去找一件东西，就先拜托您照看他们。士兵们都很仰赖您，如果有您鼓励，他们会好受一些的。",
                        npc: 110005,
                    },
                    {
                        id: 11010308,
                        content: "你要去哪儿？",
                        npc: 110022,
                    },
                    {
                        id: 11010309,
                        content: "作战地图标记出我们现在的位置附近有几间仓库。运气好的话，里面说不定会有急救箱。",
                        npc: 110005,
                    },
                    {
                        id: 11010310,
                        content: "我已经用光了所有凝血剂和镇痛剂，但还有几位伤员没有得到救治……他们的伤情已经耽误不得了。",
                        npc: 110005,
                    },
                    {
                        id: 11010311,
                        content: "你留下，我去。",
                        npc: 110022,
                    },
                    {
                        id: 11010312,
                        content: "可，这是医务员的职责——",
                        npc: 110005,
                    },
                    {
                        id: 11010313,
                        content: "留下。你身手不算好，路上的秽兽未必应付得来。我们就剩你一个医务员了，别死在这儿。",
                        npc: 110022,
                    },
                    {
                        id: 11010314,
                        content: "…………",
                        npc: 110005,
                    },
                    {
                        id: 11010315,
                        content: "明白了……我听从您的安排。",
                        npc: 110005,
                    },
                    {
                        id: 11010316,
                        content: "对了，您的通讯器还完好吗？",
                        npc: 110005,
                    },
                    {
                        id: 11010317,
                        content: "嗯，能用。",
                        npc: 110022,
                    },
                    {
                        id: 11010318,
                        content: "好，那请您保持通讯状态，我们随时联络。",
                        npc: 110005,
                    },
                ],
            },
            {
                id: 11010107,
                dialogues: [
                    {
                        id: 11010415,
                        content: "（阿瓦尔老师……暂时还没有消息。）",
                        npc: 110022,
                    },
                    {
                        id: 11010621,
                        content: "拿到了，药品没有异样。",
                        npc: 110022,
                    },
                    {
                        id: 11010622,
                        content: "谢谢！回来时小心些，这附近恐怕还会有秽兽出没。",
                        npc: 110005,
                    },
                    {
                        id: 11010618,
                        content: "仓库的确有一些军需箱。",
                        npc: 110022,
                    },
                    {
                        id: 11010619,
                        content: "好。翻找之前，请先确认箱子周围是否设有陷阱。",
                        npc: 110005,
                    },
                ],
            },
            {
                id: 11010108,
                dialogues: [
                    {
                        id: 11010701,
                        content: "你回来了？",
                        npc: 110005,
                    },
                    {
                        id: 11010704,
                        content: "“雪狼”分队那边有消息了吗？",
                        npc: 110022,
                    },
                    {
                        id: 11010705,
                        content:
                            "还是没有。您不在的时间里，我试着分别向“雪狼”分队的阿瓦尔长官，以及总指挥部的富尔维斯长官联络，但所有的通讯频道都被切断了。",
                        npc: 110005,
                    },
                    {
                        id: 11010706,
                        content: "继续尝试联络。在此期间，先看看能不能找个更安全的地方安置伤员。",
                        npc: 110022,
                    },
                    {
                        id: 11010707,
                        content: "……我有一个提议。",
                        npc: 110005,
                    },
                    {
                        id: 11010708,
                        content: "怎么了？",
                        npc: 110022,
                    },
                    {
                        id: 11010709,
                        content: "请看这张地图。",
                        npc: 110005,
                    },
                    {
                        id: 11010710,
                        content: "虽然我们目前所在的仓储区出口已经被封闭，但还有一个地方我们没确认过……那就是<H>地下的路</>。",
                        npc: 110005,
                    },
                    {
                        id: 11010711,
                        content:
                            "帝国大多数城市和要塞都建有发达的地下水道。最近十几年里，这些地下水道又经历了整体扩建，用于遭遇空袭时避险。",
                        npc: 110005,
                    },
                    {
                        id: 11010712,
                        content:
                            "如果运气好，同盟没有在地下设伏，或许……或许我们可以试着将伤员转移到那里休整。地下水路连通着要塞外，如果救援到了，也方便接应。",
                        npc: 110005,
                    },
                    {
                        id: 11010713,
                        content: "当、当然……地下也可能有危险。如果您觉得这个提议可行，请允许我先去探探路。",
                        npc: 110005,
                    },
                    {
                        id: 11010714,
                        content: "值得一试。但你一个医务员去侦查，太冒险了。",
                        npc: 110022,
                    },
                    {
                        id: 11010715,
                        content: "现在只有我们两个可以行动了。秽兽随时可能袭击这儿，您要保护他们安全，就不能走远。",
                        npc: 110005,
                    },
                    {
                        id: 11010716,
                        content: "我……虽然不是专业的侦察兵，但多少学过一些知识，所以……",
                        npc: 110005,
                    },
                    {
                        id: 11010717,
                        content: "明白了。你谨慎行动，如果遇到敌人，务必避免正面冲突。",
                        npc: 110022,
                    },
                    {
                        id: 11010718,
                        content: "好。我会和您保持通讯，也请您继续联络大家。如果我失联半小时以上，就请您……另寻他路。",
                        npc: 110005,
                    },
                    {
                        id: 11010719,
                        content: "不要怕，达芙涅。大家活下去的希望都系在你身上了……不要怕。",
                        npc: 110005,
                    },
                    {
                        id: 11017402,
                        content: "达芙涅对伤员们进行了治疗",
                    },
                ],
            },
            {
                id: 11010109,
                dialogues: [
                    {
                        id: 11011101,
                        content: "我看过大家的情况了。",
                        npc: 110010,
                    },
                    {
                        id: 11011102,
                        content: "…………",
                        npc: 110005,
                    },
                    {
                        id: 11011103,
                        content: "怎么了？既然胳膊腿都好好的，就打起精神来！",
                        npc: 110010,
                    },
                    {
                        id: 11011105,
                        content: "……你们经历的事，我多少能猜到。牺牲的士兵，一路上我也都看见了。",
                        npc: 110010,
                    },
                    {
                        id: 11011106,
                        content: "但你们是军人。哀悼的话，留到平安下了战场之后再说。",
                        npc: 110010,
                    },
                    {
                        id: 11011107,
                        content: "所以，你们两个还好吗？",
                        npc: 110010,
                    },
                    {
                        id: 11011108,
                        content: "…………",
                        npc: 110005,
                    },
                    {
                        id: 11011109,
                        content: "当然，我们很好。只是按上头的命令办事，差点全都死在这儿而已，没什么不好，有劳长官您挂心了。",
                        npc: 110005,
                    },
                    {
                        id: 11011110,
                        content: "你这小鬼——算了。",
                        npc: 110010,
                    },
                    {
                        id: 11011111,
                        content: "{nickname2}，你来报告。",
                        npc: 110010,
                    },
                    {
                        id: 11011112,
                        content:
                            "是。“狮鹫”分队原本按照计划，与您所在的“雪狼”分队分两路向龙莎要塞发起攻势——这是您知道的。但在潜入要塞后，我们遭遇了伏击。",
                        npc: 110022,
                    },
                    {
                        id: 11011113,
                        content: "各区域间的通道被封锁，我方小部分队员失联，其余则伤亡惨重。向外的通讯也被切断了——我们被困在了这里。",
                        npc: 110022,
                    },
                    {
                        id: 11011114,
                        content: "“雪狼”分队的情况和你们差不多。情况你们自己知道，先别讲给伤员。",
                        npc: 110010,
                    },
                    {
                        id: 11011115,
                        content: "嗯……现在整个“狮鹫”分队能行动的，只剩下你们俩了吗……",
                        npc: 110010,
                    },
                    {
                        id: 11011116,
                        content:
                            "达芙涅，刚才我们打通了仓储区和加工区的通路，中间有片区域还算安全。我给出了信号，待会儿会有人护送你们过去休整。",
                        npc: 110010,
                    },
                    {
                        id: 11011117,
                        content: "{nickname2}，你跟我走，继续行动。",
                        npc: 110010,
                    },
                    {
                        id: 11011118,
                        content: "我也可以行动，请让我——唔！",
                        npc: 110005,
                    },
                    {
                        id: 11011119,
                        content: "你的腿受伤了？你……是怎么跑到这儿来的？硬撑着的？疼吗？",
                        npc: 110010,
                    },
                    {
                        id: 11011120,
                        content: "别管了。我、我还剩最后一针麻醉剂，是留给我自己的。炼金院新研究的药剂对阻断疼痛很有效，所以没关系——",
                        npc: 110005,
                    },
                    {
                        id: 11011121,
                        content: "达芙涅医务员，海伯利亚军团第12条军规是什么？",
                        npc: 110010,
                    },
                    {
                        id: 11011122,
                        content: "请别说这些！我还能——",
                        npc: 110005,
                    },
                    {
                        id: 11011123,
                        content: "达芙涅医务员，你的长官在问你话。",
                        npc: 110010,
                    },
                    {
                        id: 11011124,
                        content: "……军事行动中，应服从上级指令……",
                        npc: 110005,
                    },
                    {
                        id: 11011125,
                        content: "海伯利亚帝国十三军团医务员达芙涅·塞奥多尔。",
                        npc: 110010,
                    },
                    {
                        id: 11011126,
                        content: "……到。",
                        npc: 110005,
                    },
                    {
                        id: 11011127,
                        content: "暂停行动，原地留守。与“雪狼”分队的人员会合后，与“狮鹫”的伤员一起前往加工区休整待命。",
                        npc: 110010,
                    },
                    {
                        id: 11011128,
                        content: "…………",
                        npc: 110005,
                    },
                    {
                        id: 11011129,
                        content: "回答呢？",
                        npc: 110010,
                    },
                    {
                        id: 11011130,
                        content: "……明白……",
                        npc: 110005,
                    },
                    {
                        id: 11011131,
                        content: "{nickname2}，随我继续执行任务。",
                        npc: 110010,
                    },
                    {
                        id: 11011132,
                        content: "是。",
                        npc: 110022,
                    },
                    {
                        id: 11011016,
                        content: "阿瓦尔长官！哈、哈……你来了！你一定会带着大家……攻下这座要塞……",
                        npc: 110019,
                    },
                    {
                        id: 11011017,
                        content: "你们都是好样的，你们的勇敢对得起胸口的徽章，帝国不会让你们在这里白白流血。",
                        npc: 110010,
                    },
                    {
                        id: 11011018,
                        content: "长官，“雪狼”那边怎么样了？",
                        npc: 110013,
                    },
                    {
                        id: 11011019,
                        content: "雪狼分队一切正常。我已经联系上了总指挥官，你们尽管放心休息，接下来就交给我们。",
                        npc: 110010,
                    },
                    {
                        id: 11011020,
                        content: "阿瓦尔长官？我……在做梦吗……",
                        npc: 110027,
                    },
                    {
                        id: 11011021,
                        content: "这不是梦。坚持住，别睡着。",
                        npc: 110010,
                    },
                    {
                        id: 11017301,
                        content: "“狮鹫”该不会就剩你一个了？其他人什么情况？",
                        npc: 110010,
                    },
                    {
                        id: 11017302,
                        content: "他们在前面，大多伤得不轻。跟我来。",
                        npc: 110022,
                    },
                    {
                        id: 11011013,
                        content: "我们暂时击退了来袭的秽兽，清理出一个临时休整点，不过这边也坚持不了太久。",
                        npc: 110022,
                    },
                    {
                        id: 11011014,
                        content: "达芙涅紧急救治了伤员，但据伤情判断，他们已经暂时丧失了作战能力。",
                        npc: 110022,
                    },
                    {
                        id: 11011015,
                        content: "……好。你们也辛苦了。",
                        npc: 110010,
                    },
                    {
                        id: 11011024,
                        content: "长官，以你们的判断，这次作战还有希望吗？",
                        npc: 110026,
                    },
                    {
                        id: 11011025,
                        content: "以当前的战况来看——",
                        npc: 110022,
                    },
                    {
                        id: 11011026,
                        content: "以当前的战况来看，援军就在路上。我们很快会夺下要塞，把那群混蛋打得头破血流。",
                        npc: 110010,
                    },
                    {
                        id: 11011022,
                        content: "向您致意……长官……荣耀……尽归吾皇……",
                        npc: 110028,
                    },
                    {
                        id: 11011023,
                        content: "荣耀尽归吾皇。",
                        npc: 110010,
                    },
                ],
            },
        ],
    },
    {
        id: 110103,
        quests: [
            {
                id: 11010301,
                dialogues: [
                    {
                        id: 11017201,
                        content: "{nickname2}，你就什么都不问？",
                        npc: 110010,
                    },
                    {
                        id: 11017202,
                        content: "您刚说过，军人要无条件服从命令。",
                        npc: 110022,
                    },
                    {
                        id: 11017203,
                        content: "都这个份上了，你怎么还是老样子，像块木雕似的。",
                        npc: 110010,
                    },
                    {
                        id: 11017204,
                        content: "老师，您还说过，作战时必须集中注意力。",
                        npc: 110022,
                    },
                    {
                        id: 11017205,
                        content: "现在情况并不安全，分心批评我，会增加您的伤亡概率。",
                        npc: 110022,
                    },
                    {
                        id: 11017206,
                        content: "你这小鬼！",
                        npc: 110010,
                    },
                ],
            },
            {
                id: 11010303,
                dialogues: [
                    {
                        id: 11011201,
                        content: "他们改装了所有机关……同盟中也有了不得的工程师吗？",
                        npc: 110022,
                    },
                    {
                        id: 11011202,
                        content: "当然。早就和上头的老顽固说过，别把神弃者同盟当“野蛮人”。",
                        npc: 110010,
                    },
                    {
                        id: 11011203,
                        content: "要是同盟是野蛮人，那帝国让人家占了大半年要塞，岂不是还不如野蛮人？",
                        npc: 110010,
                    },
                    {
                        id: 11011204,
                        content: "嗯……高层太轻敌了。",
                        npc: 110022,
                    },
                    {
                        id: 11011205,
                        content: "论“指挥的艺术”，没人比富尔维斯在行。",
                        npc: 110010,
                    },
                    {
                        id: 11011206,
                        content: "让大艺术家自己去军团长办公室解释吧！看他那副伶牙俐齿还能不能哄得西比尔赦免他。",
                        npc: 110010,
                    },
                ],
            },
            {
                id: 11010305,
                dialogues: [
                    {
                        id: 11017501,
                        content: "动力室是整座要塞的“心脏”，维持要塞运转的能源都来自里面那台月髓舱。",
                        npc: 110010,
                    },
                    {
                        id: 11017502,
                        content: "但直接攻击月髓舱会引起爆炸，你得先去关掉四周的<H>髓动轮</>。",
                        npc: 110010,
                    },
                ],
            },
            {
                id: 11010306,
                dialogues: [
                    {
                        id: 11017516,
                        content: "他*的……",
                        npc: 110010,
                    },
                    {
                        id: 11017517,
                        content: "<W>警告：当前月髓舱负荷过大，有过载风险，请检查是否启动过多髓动轮。</>",
                    },
                    {
                        id: 11017518,
                        content: "过载风险？…………",
                        npc: 110010,
                    },
                    {
                        id: 11017519,
                        content: "听着，{nickname2}，你现在到动力室下层去，把所有备用髓动轮启动后，立即撤离。",
                        npc: 110010,
                    },
                    {
                        id: 11017520,
                        content: "既然常规手段解决不了月髓舱，你就让它自己搞坏自己。",
                        npc: 110010,
                    },
                    {
                        id: 11017521,
                        content: "您指的是……利用过载炸毁月髓舱？我知道了。",
                        npc: 110022,
                    },
                ],
            },
            {
                id: 11010307,
                dialogues: [
                    {
                        id: 11018202,
                        content: "维克，莫妮卡，撑住……我们很快就到。",
                        npc: 110010,
                    },
                    {
                        id: 11011302,
                        content:
                            "作战计划书上写的是，本次行动总指挥官富尔维斯上校率领人数较多的“一角鲸”部队，在通向龙莎要塞的大桥发起佯攻，以吸引神弃者同盟的关注。",
                        npc: 110010,
                    },
                    {
                        id: 11011303,
                        content:
                            "而我们“雪狼”、“狮鹫”两支小队则从要塞上方空降，兵分两路潜入，分别沿动力室一线和武器库一线快速突袭，直接拿下要塞中枢——中央控制室。",
                        npc: 110010,
                    },
                    {
                        id: 11011304,
                        content: "但是……",
                        npc: 110010,
                    },
                    {
                        id: 11011305,
                        content: "同盟预判了我们的行动。",
                        npc: 110022,
                    },
                    {
                        id: 11011306,
                        content: "嗯。可能是我们的通讯被截获了，也可能是军团内部混进来了神弃者同盟的间谍……",
                        npc: 110010,
                    },
                    {
                        id: 11011307,
                        content: "先不管到底是怎么泄露出去的，同盟的准备可做得真足。",
                        npc: 110010,
                    },
                    {
                        id: 11011308,
                        content:
                            "用要塞防御机关设伏也就算了，偏偏还引来一群秽兽……我们轻装突进，没携带针对大型秽兽的武器，大伙只能拿命硬搏。",
                        npc: 110010,
                    },
                    {
                        id: 11011309,
                        content: "既然龙莎要塞是帝国工程师设计的，您应该可以破解那些机关吧？",
                        npc: 110022,
                    },
                    {
                        id: 11011310,
                        content: "怎么，小鬼，军事学院那些日子，密码学没好好上？",
                        npc: 110010,
                    },
                    {
                        id: 11011311,
                        content: "您还记着这事啊。",
                        npc: 110022,
                    },
                    {
                        id: 11011312,
                        content: "算了算了，这次的情况就算你擅长解码也没用。全要塞的机关都被同盟改装过了，根本没时间挨个破解完。",
                        npc: 110010,
                    },
                    {
                        id: 11011313,
                        content: "不过，“先解决机关”的判断是正确的，我们接下来要去的就是<H>动力室</>。",
                        npc: 110010,
                    },
                    {
                        id: 11011314,
                        content: "强制切断动力、关停机关后，救援其他受困士兵——这就是接下来的作战目标。",
                        npc: 110010,
                    },
                    {
                        id: 11011315,
                        content: "那边的装置至少需要两个人协力，亏得我先把你捞出来了。",
                        npc: 110010,
                    },
                    {
                        id: 11011316,
                        content: "等等，有人联络……",
                        npc: 110010,
                    },
                    {
                        id: 11011317,
                        content: "喂？喂喂？听到了吗？<H>海伯利亚今日天气怎么样？</>",
                    },
                    {
                        id: 11011318,
                        content: "<H>迪斯玛尼亚今夜有雨。</>",
                        npc: 110010,
                    },
                    {
                        id: 11011319,
                        content: "阿瓦尔长官？是您吗？我是维克！",
                    },
                    {
                        id: 11011320,
                        content: "是我，报告现状。",
                        npc: 110010,
                    },
                    {
                        id: 11011321,
                        content: "与您分开后，我和莫妮卡选择了外环路线，现在已经抵达动力室附近。",
                    },
                    {
                        id: 11011322,
                        content: "动力室？你们莫非也打算——",
                        npc: 110010,
                    },
                    {
                        id: 11011323,
                        content: "我是来特地向您报告的，我们接下来会尝试关闭动力装置。",
                    },
                    {
                        id: 11011324,
                        content: "先别急，动力室很可能有陷阱。你们两个原地待命，我们再有十几分钟就能赶过去帮你们了。",
                        npc: 110010,
                    },
                    {
                        id: 11011325,
                        content: "先让我们试试吧，长官！多耽误一分钟，其他人就多一分钟危险。",
                    },
                    {
                        id: 11011326,
                        content: "你小子……",
                        npc: 110010,
                    },
                    {
                        id: 11011327,
                        content: "还有最后一件事……既然{nickname2}在您那的话，能不能告诉我“狮鹫”分队的情况怎么样？我弟弟西蒙他……",
                    },
                    {
                        id: 11011328,
                        content: "…………",
                        npc: 110022,
                    },
                    {
                        id: 11011329,
                        content: "我目前没有发现他的尸体。",
                        npc: 110022,
                    },
                    {
                        id: 11011330,
                        content: "……啊……？",
                    },
                    {
                        id: 11011331,
                        content: "咳，没事，没事。他受了些伤，在休整点躺着。医务员看着呢，别担心。",
                        npc: 110010,
                    },
                    {
                        id: 11011332,
                        content: "……明白了，多谢。",
                    },
                    {
                        id: 11011333,
                        content: "你那张嘴，以后还是别安慰人了，千万别。",
                        npc: 110010,
                    },
                    {
                        id: 11011334,
                        content: "……知道了。",
                        npc: 110022,
                    },
                    {
                        id: 11011301,
                        content: "先停下来整理一下现在的情况吧。",
                        npc: 110010,
                    },
                ],
            },
            {
                id: 11010308,
                dialogues: [
                    {
                        id: 11011501,
                        content: "辛苦你了，小鬼——不愧是你们那届最优秀的学生。",
                        npc: 110010,
                    },
                    {
                        id: 11011502,
                        content: "…………",
                        npc: 110022,
                    },
                    {
                        id: 11011503,
                        content: "好，要塞内大部分的自卫武器都被关停了，其他小队应该会好过些。",
                        npc: 110010,
                    },
                    {
                        id: 11011504,
                        content: "你还行吗？能走的话就出发，救援其他人——等下，新的联络。",
                        npc: 110010,
                    },
                ],
            },
            {
                id: 11010313,
                dialogues: [
                    {
                        id: 11011401,
                        content: "你们来了！",
                        npc: 110020,
                    },
                    {
                        id: 11011402,
                        content: "维克在下面，他想关停月髓舱，却被锁在了一扇门后面……这里的操作台被重新加密过了，我再想想办法……",
                        npc: 110020,
                    },
                    {
                        id: 11011403,
                        content: "莫妮卡，听到……吗？……",
                    },
                    {
                        id: 11011404,
                        content: "动力室……快走……啊！",
                    },
                    {
                        id: 11011405,
                        content: "……",
                    },
                    {
                        id: 11011406,
                        content: "维克？！你怎么了？维克！！！",
                        npc: 110020,
                    },
                    {
                        id: 11011407,
                        content: "你别出事！马上就解开了……马上……",
                        npc: 110020,
                    },
                    {
                        id: 11011408,
                        content: "…………",
                        npc: 110020,
                    },
                    {
                        id: 11011409,
                        content: "……解不开……怎么偏偏是现在！",
                        npc: 110020,
                    },
                    {
                        id: 11011410,
                        content: "……别慌，有我呢。我来。",
                        npc: 110010,
                    },
                    {
                        id: 11011411,
                        content: "我来处理上锁的门。{nickname2}，你去下面协助我关停动力装置，营救维克。",
                        npc: 110010,
                    },
                    {
                        id: 11011412,
                        content: "听我指示行动。我们的动作越快，战友活下来的几率就越高。明白吗？",
                        npc: 110010,
                    },
                ],
            },
            {
                id: 11010314,
                dialogues: [
                    {
                        id: 11018402,
                        content: "对。不过现在要塞的动力瘫痪了，得想个办法把这门炮运过去。",
                        npc: 110010,
                    },
                    {
                        id: 11011939,
                        content: "长官，成功在附近仓库找到了罐装月髓液，已经按您的吩咐连接上剩下的髓动轮了。",
                        npc: 110020,
                    },
                    {
                        id: 11011940,
                        content: "好……应该足够支持把这门炮运到中央控制室附近了。",
                        npc: 110010,
                    },
                ],
            },
        ],
    },
    {
        id: 110105,
        quests: [
            {
                id: 11010501,
                dialogues: [
                    {
                        id: 11018206,
                        content: "（月髓舱炸毁后，这些机关都瘫痪了。）",
                        npc: 110022,
                    },
                ],
            },
            {
                id: 11010505,
                dialogues: [
                    {
                        id: 11011601,
                        content: "……",
                        npc: 110014,
                    },
                    {
                        id: 11011602,
                        content: "……西蒙！",
                        npc: 110022,
                    },
                    {
                        id: 11011603,
                        content: "……队长，太好了，你来了……",
                        npc: 110014,
                    },
                    {
                        id: 11011604,
                        content: "快……轨道那儿……大家……被秽兽困住……快……去救……",
                        npc: 110014,
                    },
                    {
                        id: 11011605,
                        content: "你也要……小心……",
                        npc: 110014,
                    },
                    {
                        id: 11011606,
                        content: "……妈妈，秽兽在吃我的腿……好疼……",
                        npc: 110014,
                    },
                    {
                        id: 11011607,
                        content: "……我好疼，妈妈……",
                        npc: 110014,
                    },
                    {
                        id: 11011608,
                        content: "撑住！",
                        npc: 110022,
                    },
                    {
                        id: 11011609,
                        content: "…………",
                        npc: 110022,
                    },
                    {
                        id: 11011610,
                        content: "西蒙？你还活着吗？",
                        npc: 110022,
                    },
                    {
                        id: 11011611,
                        content: "…………",
                        npc: 110022,
                    },
                ],
            },
            {
                id: 11010507,
                dialogues: [
                    {
                        id: 11018301,
                        content: "坚持住，队长就快来了！",
                        npc: 110016,
                    },
                ],
            },
            {
                id: 11010509,
                dialogues: [
                    {
                        id: 11011849,
                        content: "谢谢您……",
                        npc: 110034,
                    },
                    {
                        id: 11011850,
                        content: "你在和我说话？",
                        npc: 110022,
                    },
                    {
                        id: 11011851,
                        content: "是的。您刚才没有当众搜我身。我很感激，身为帝国人的您，愿意留给一个陌生的卡戎女人一丝尊严。",
                        npc: 110034,
                    },
                    {
                        id: 11011852,
                        content: "您会因为您的善良得到报答的。",
                        npc: 110034,
                    },
                    {
                        id: 11011802,
                        content:
                            "啊，队长，我亲爱的队长！！终于找到你了！！我们的联络频段突然出现异常，这一路谁也联系不上，西蒙就跑出去求救了。",
                        npc: 110043,
                    },
                    {
                        id: 11011803,
                        content: "我刚就一直跟大家鼓劲儿，队长那么厉害心眼儿又好，肯定“唰”的一下就跑过来帮咱们了。",
                        npc: 110043,
                    },
                    {
                        id: 11011804,
                        content: "队长，你是一个人来的？你看到西蒙了吗？",
                        npc: 110016,
                    },
                    {
                        id: 11011805,
                        content: "他死了。",
                        npc: 110022,
                    },
                    {
                        id: 11011806,
                        content: "……！！他是我们几个里最机灵的，怎么……",
                        npc: 110016,
                    },
                    {
                        id: 11011807,
                        content: "现在先别想他。先战斗下去，活下去。",
                        npc: 110022,
                    },
                    {
                        id: 11011808,
                        content: "…………",
                        npc: 110016,
                    },
                    {
                        id: 11011809,
                        content: "……你说得对……他拼命跑出去求救，可不是为了让我们像废物一样在这里哭。",
                        npc: 110016,
                    },
                    {
                        id: 11011810,
                        content: "准备好了就走吧，我中途遇到了阿瓦尔长官。我们计划在4号炮台处会合。",
                        npc: 110022,
                    },
                    {
                        id: 11011811,
                        content: "4号炮台？队长你确定吗？离这里还挺远的，路上不知道有多少秽兽。就咱几个，能行吗？",
                        npc: 110043,
                    },
                    {
                        id: 11011812,
                        content: "你们还有一条路可以走……",
                        npc: 110017,
                    },
                    {
                        id: 11011813,
                        content: "住口，卡戎人。",
                        npc: 110016,
                    },
                    {
                        id: 11011814,
                        content: "他们是？",
                        npc: 110022,
                    },
                    {
                        id: 11011815,
                        content: "同盟的人，路上抓到的俘虏。",
                        npc: 110016,
                    },
                    {
                        id: 11011816,
                        content: "……我的好兄弟被你们豢养的怪物害死了。既然你提醒，那就在你身上开几个洞，给他抵命吧。",
                        npc: 110016,
                    },
                    {
                        id: 11011817,
                        content: "住手。",
                        npc: 110022,
                    },
                    {
                        id: 11011818,
                        content: "俘虏要活着带回去，交由帝国监狱审问。",
                        npc: 110022,
                    },
                    {
                        id: 11011819,
                        content: "……这位长官……",
                        npc: 110034,
                    },
                    {
                        id: 11011820,
                        content: "如果只有一个卡戎之民的性命才能平息您的愤怒，就对我开枪吧。但在此之前，恳请您听一下我的解释……",
                        npc: 110034,
                    },
                    {
                        id: 11011821,
                        content: "卡嘉，回来，别犯傻！",
                        npc: 110017,
                    },
                    {
                        id: 11011822,
                        content: "长官，我们虽然是卡戎之民，但我们不是神弃者同盟的成员。我们只是附近小镇再本分不过的普通人。",
                        npc: 110034,
                    },
                    {
                        id: 11018302,
                        content:
                            "神弃者同盟的人改造要塞要苦力，就派人到我们镇子，把我们强行绑过来。他们甚至不要索拉之民，而是专挑我们卡戎之民……",
                        npc: 110034,
                    },
                    {
                        id: 11011824,
                        content: "开什么玩笑——同盟对自己的同胞下手？",
                        npc: 110016,
                    },
                    {
                        id: 11018401,
                        content:
                            "没错，仅仅因为我们比索拉之民力气更大，更不怕严寒暑热——也许在您的眼中我们是同类，但同盟从未把我们当过“同胞”。",
                        npc: 110034,
                    },
                    {
                        id: 11011826,
                        content: "…………",
                        npc: 110022,
                    },
                    {
                        id: 11011827,
                        content: "弗兰克爷爷是我的恩人。",
                        npc: 110034,
                    },
                    {
                        id: 11011828,
                        content:
                            "几天前，我只是肚子痛歇息了一会儿，就被同盟的畜生毒打了几十鞭子。奄奄一息的时候，是爷爷给了我水和食物，还有这条破袍子。",
                        npc: 110034,
                    },
                    {
                        id: 11011829,
                        content:
                            "如果不是他好心，我那个时候就已经断气了。所以，我愿意替他抵命——请对我开枪吧。但是爷爷他是真心想帮您的，因为我们同您一样无法原谅同盟的恶行。",
                        npc: 110034,
                    },
                    {
                        id: 11011830,
                        content:
                            "地下水道四通八达，你们自己一定会迷路。爷爷经常被使唤去修理水阀，他对那边很熟悉。如果您放他一条生路，他就可以带你们去你们要去的地方。",
                        npc: 110034,
                    },
                    {
                        id: 11011831,
                        content: "行了。马尔科，放下枪——放下，这是命令。",
                        npc: 110022,
                    },
                    {
                        id: 11011832,
                        content: "莱昂，搜身。",
                        npc: 110022,
                    },
                    {
                        id: 11011833,
                        content: "来了！",
                        npc: 110043,
                    },
                    {
                        id: 11011834,
                        content: "……",
                        npc: 110022,
                    },
                    {
                        id: 11011835,
                        content:
                            "几天前，我只是肚子痛歇息了一会儿，就被同盟的畜生毒打了几十鞭子。奄奄一息的时候，是爷爷给了我水和食物，还有这条破袍子。",
                        npc: 110034,
                    },
                    {
                        id: 11011836,
                        content: "…………",
                        npc: 110022,
                    },
                    {
                        id: 11011837,
                        content: "她就算了。",
                        npc: 110022,
                    },
                    {
                        id: 11011838,
                        content: "是。",
                        npc: 110043,
                    },
                    {
                        id: 11011839,
                        content: "老人家，既然你对水道熟悉，那来带路吧。",
                        npc: 110022,
                    },
                    {
                        id: 11011840,
                        content: "你们几个盯紧他们，别让他们有小动作。发现任何异样，立即后撤。",
                        npc: 110022,
                    },
                    {
                        id: 11011801,
                        content: "队长！嗨——在这里！",
                        npc: 110015,
                    },
                ],
            },
            {
                id: 11010510,
                dialogues: [
                    {
                        id: 11017701,
                        content: "长官，请走这边……",
                        npc: 110017,
                    },
                    {
                        id: 11017702,
                        content: "长官，从这里下去，就是地下水道了。",
                        npc: 110017,
                    },
                    {
                        id: 11017703,
                        content: "卡戎人，你走前面。",
                        npc: 110016,
                    },
                    {
                        id: 11017704,
                        content: "是、是……",
                        npc: 110017,
                    },
                ],
            },
            {
                id: 11010511,
                dialogues: [
                    {
                        id: 11011928,
                        content: "这些月髓液真好看，透明的，亮晶晶的。",
                        npc: 110034,
                    },
                    {
                        id: 11011929,
                        content: "如果不是用来杀人的就好了。",
                        npc: 110034,
                    },
                    {
                        id: 11011930,
                        content: "……嗯。",
                        npc: 110022,
                    },
                    {
                        id: 11017418,
                        content: "好厉害……",
                        npc: 110034,
                    },
                    {
                        id: 11017419,
                        content: "（找到了……启动它吧。）",
                        npc: 110022,
                    },
                    {
                        id: 11017412,
                        content: "咦，被挡住了，看起来要绕一下路呢……",
                        npc: 110034,
                    },
                    {
                        id: 11017413,
                        content: "开关还打不开，先启动相连的髓动轮吧。",
                        npc: 110022,
                    },
                    {
                        id: 11017423,
                        content: "好了。",
                        npc: 110022,
                    },
                    {
                        id: 11018403,
                        content: "先启动髓动轮，恢复这一小片区域的供能吧。",
                        npc: 110010,
                    },
                    {
                        id: 11017417,
                        content: "（顺着这些线缆找到髓动轮吧。）",
                        npc: 110022,
                    },
                ],
            },
            {
                id: 11010512,
                dialogues: [
                    {
                        id: 11012001,
                        content: "干得好，出发吧。把炮台开到轰击中央控制室的最佳位置。",
                        npc: 110010,
                    },
                ],
            },
            {
                id: 11010513,
                dialogues: [
                    {
                        id: 11018409,
                        content: "（炮台可以启动了。）",
                        npc: 110022,
                    },
                ],
            },
            {
                id: 11010514,
                dialogues: [
                    {
                        id: 11012203,
                        content: "我和{nickname2}走前面，其他人小心跟上！",
                        npc: 110010,
                    },
                ],
            },
            {
                id: 11010515,
                dialogues: [
                    {
                        id: 11012801,
                        content: "您的伤没问题吗？",
                        npc: 110022,
                    },
                    {
                        id: 11012802,
                        content: "小伤而已，歇歇就行。别看那小姑娘虚张声势，其实力气跟路边野猫似的，让她拿枪都怕砸了脚……",
                        npc: 110010,
                    },
                    {
                        id: 11012803,
                        content: "哎，去哪儿了，我记得是放这里了来着……",
                        npc: 110010,
                    },
                    {
                        id: 11012804,
                        content: "您丢了什么东西吗？",
                        npc: 110022,
                    },
                    {
                        id: 11012805,
                        content: "没什么，就是一张照片。你快去审审那个女人，她好像是冲着你来的。",
                        npc: 110010,
                    },
                    {
                        id: 11012806,
                        content: "（照片？或许可以留意一下。）",
                        npc: 110022,
                    },
                    {
                        id: 11019201,
                        content: "喂，怎么了？蹲下干吗？",
                        npc: 110015,
                    },
                    {
                        id: 11019202,
                        content: "我跟你说少在这装可怜啊，我可不吃这一套！跟我走！",
                        npc: 110015,
                    },
                    {
                        id: 11012303,
                        content: "我亲爱的长官，别急，请让我稍微准备一下——",
                        npc: 110034,
                    },
                    {
                        id: 11012304,
                        content: "嗯，准备好啦！",
                        npc: 110034,
                    },
                    {
                        id: 11018701,
                        content: "这小姑娘是神弃者同盟的，看管好她！",
                        npc: 110010,
                    },
                ],
            },
            {
                id: 11010516,
                dialogues: [
                    {
                        id: 11012811,
                        content: "对了，我刚才捡到了这个……",
                        npc: 110022,
                    },
                    {
                        id: 11012812,
                        content: "哦！居然给你捡到了，谢啦。",
                        npc: 110010,
                    },
                    {
                        id: 11012813,
                        content: "原来达芙涅她是您的……",
                        npc: 110022,
                    },
                    {
                        id: 11012814,
                        content: "啊，哦，她是从前邻居家的小姑娘啊，哈哈……",
                        npc: 110010,
                    },
                    {
                        id: 11012815,
                        content: "……算了，不瞒你了。达芙涅是我女儿，你没猜错。",
                        npc: 110010,
                    },
                    {
                        id: 11012816,
                        content:
                            "说起来还挺不好意思的，这是我跟那孩子一起拍的最后一张照片……那之后没多久，她母亲就带着她离开了。“塞奥多尔”这个姓氏，是她母亲的。",
                        npc: 110010,
                    },
                    {
                        id: 11012817,
                        content: "不过这件事你别说出去啊，我们就是为了不让人知道达芙涅是我女儿，才离婚的。",
                        npc: 110010,
                    },
                    {
                        id: 11012818,
                        content:
                            "当年首席炼金术师很喜欢达芙涅，说她会成为未来帝国最优秀的炼金术师。那时她早已宣布不再招收学生，却为这孩子破例了。",
                        npc: 110010,
                    },
                    {
                        id: 11012819,
                        content: "因为达芙涅是个天才？",
                        npc: 110022,
                    },
                    {
                        id: 11012820,
                        content:
                            "她确实在炼金术上很有天赋，但佩剑炼金院那种地方，最不缺的就是天才。首席炼金术师说，达芙涅是特别的，因为她拥有一些其他炼金术师没有的东西。",
                        npc: 110010,
                    },
                    {
                        id: 11012821,
                        content: "这些话我也没听太明白，但有一点是明确的，达芙涅有很好的前程。所以，绝对不能有一个卡戎父亲阻碍她的道路。",
                        npc: 110010,
                    },
                    {
                        id: 11012834,
                        content: "可老师是<H>桂冠卡戎</>——和其他卡戎之民不一样。",
                        npc: 110022,
                    },
                    {
                        id: 11012835,
                        content: "也没什么不一样的。时代变了，现在从元老院和军团内部，到处都有人质疑桂冠卡戎的忠诚。",
                        npc: 110010,
                    },
                    {
                        id: 11012836,
                        content:
                            "指不定哪天一纸敕令下来，我们这些人就要回老家喽。如果真有这么一天，达芙涅的前程也可能受牵连……她母亲是这么想的。",
                        npc: 110010,
                    },
                    {
                        id: 11012822,
                        content: "达芙涅知道吗？",
                        npc: 110022,
                    },
                    {
                        id: 11012823,
                        content: "不知道。她打小心思就单纯，也很黏我，怎么能告诉她这个。",
                        npc: 110010,
                    },
                    {
                        id: 11012824,
                        content:
                            "所以我就装作是一个抛妻弃女的坏父亲，她走在路上叫我爸爸，我就会跟她说，“闭嘴，叫什么爸爸、套什么近乎呢，叫长官。”",
                        npc: 110010,
                    },
                    {
                        id: 11012825,
                        content: "可她还是太懂事了，连骂我的话都骂不出口，只能和自己闹别扭。",
                        npc: 110010,
                    },
                    {
                        id: 11012809,
                        content: "这是，年轻时的老师和……达芙涅？",
                        npc: 110022,
                    },
                    {
                        id: 11012810,
                        content: "把照片交还给阿瓦尔老师吧。",
                        npc: 110022,
                    },
                    {
                        id: 11012466,
                        content: "我说了，悄悄话只有一句。呵呵……一路顺风，我的长官。",
                        npc: 110009,
                    },
                    {
                        id: 11012701,
                        content: "看来富尔维斯的援军短时间内是等不来了。",
                        npc: 110010,
                    },
                    {
                        id: 11012702,
                        content: "最终目标中央控制室就在前面了。要继续前进吗？同盟的“信使”大概就在里面……",
                        npc: 110016,
                    },
                    {
                        id: 11012703,
                        content: "而她这样的埋伏，前面不知道还有多少。",
                        npc: 110016,
                    },
                    {
                        id: 11012704,
                        content: "嗯，可能会死。你，或者我，或者我们全部。",
                        npc: 110022,
                    },
                    {
                        id: 11012705,
                        content: "…………",
                        npc: 110010,
                    },
                    {
                        id: 11012706,
                        content:
                            "十三军团剩下的士兵们，前面是中央控制室，龙莎要塞的中枢，这次任务的最终目标……也是建立功勋，将荣耀献给海伯利亚的机会。",
                        npc: 110010,
                    },
                    {
                        id: 11012707,
                        content: "但是很抱歉，我不会把最大的功劳让给你们。",
                        npc: 110010,
                    },
                    {
                        id: 11012708,
                        content: "……啊？",
                        npc: 110015,
                    },
                    {
                        id: 11012709,
                        content: "这次行动到现在，我们功劳与危险并存，而且危险总是更多一些。",
                        npc: 110010,
                    },
                    {
                        id: 11012710,
                        content:
                            "你们还年轻，未来的路很长，也会有很多很多沐浴荣光的机会。所以，这功劳可不能让你们抢走。还是让我一个人去，再添一枚勋章吧。",
                        npc: 110010,
                    },
                    {
                        id: 11012711,
                        content: "你们据守炮台，如果我失联，就继续炮击中央控制室，切勿冒进，继续等待后续支援。",
                        npc: 110010,
                    },
                    {
                        id: 11012712,
                        content: "长官，您一个人办不到的……这不是您的本意。",
                        npc: 110016,
                    },
                    {
                        id: 11012713,
                        content: "什么本意不本意的，这是命令。",
                        npc: 110010,
                    },
                    {
                        id: 11012714,
                        content: "嘁，装模作样。",
                        npc: 110009,
                    },
                    {
                        id: 11012715,
                        content:
                            "我知道你们担心什么，但这种场面我见得多了。长官耍着帅，一副好像这次真的要死了的样子，那时候我也像你们这样垂着眼泪，一副没出息的样子。",
                        npc: 110010,
                    },
                    {
                        id: 11012716,
                        content: "但长官最后还是好好地回来了。所以说，别担心。想想你们的母亲，她正在壁炉边一边织毛衣，一边等你们回家。",
                        npc: 110010,
                    },
                    {
                        id: 11012717,
                        content:
                            "长官，我总受你照顾，刚刚你还救了我一命。就算我妈妈在这里，她也会说，“跟上你的长官，不要惧怕死亡。你是海伯利亚的战士，当以生命守卫帝国的一切。”",
                        npc: 110020,
                    },
                    {
                        id: 11012718,
                        content: "没有人怕死，我怕的是——毫无意义的死。",
                        npc: 110010,
                    },
                    {
                        id: 11012719,
                        content: "不会毫无意义的。只要我们前进一步，战线就向前推进了一步。",
                        npc: 110022,
                    },
                    {
                        id: 11012720,
                        content: "更何况，既然前面对我们来说是“未知”的，那便意味着——“生还”也是一种可能。",
                        npc: 110022,
                    },
                    {
                        id: 11012721,
                        content: "我是“狮鹫”小队的成员，我听{nickname2}队长的。",
                        npc: 110016,
                    },
                    {
                        id: 11012722,
                        content: "我这次听清了！我也听{nickname2}队长的！",
                        npc: 110015,
                    },
                    {
                        id: 11012723,
                        content: "…………",
                        npc: 110010,
                    },
                    {
                        id: 11012724,
                        content: "……如果有{nickname2}，以{性别2：他|她}刚才的实力，的确……胜利并非没有希望。",
                        npc: 110010,
                    },
                    {
                        id: 11012725,
                        content: "嗯。准备好，我们就出发吧。",
                        npc: 110022,
                    },
                    {
                        id: 11012726,
                        content: "嗬，还学会和你的长官抢话了。",
                        npc: 110010,
                    },
                    {
                        id: 11012727,
                        content: "或者我们也可以等一下再出发，先撬开这女人的嘴——",
                        npc: 110016,
                    },
                    {
                        id: 11012728,
                        content: "这是打算再审问我？",
                        npc: 110009,
                    },
                    {
                        id: 11012729,
                        content: "不。我们见识过这小姑娘的精明狡猾，她提供的情报只会干扰我们的判断。",
                        npc: 110010,
                    },
                    {
                        id: 11012730,
                        content:
                            "这样吧，我们分两队行动。我和{nickname2}先行侦查，其他人做好准备，收到进攻信号马上进发，收到后退信号就退守4号炮台。莱昂留下看守犯人。",
                        npc: 110010,
                    },
                    {
                        id: 11012731,
                        content: "是！",
                    },
                    {
                        id: 11012732,
                        content: "走吧，不知道神弃者同盟还准备了什么惊喜等着我们。",
                        npc: 110010,
                    },
                    {
                        id: 11012468,
                        content: "但是很遗憾，我现在心情不太好，不想说了。",
                        npc: 110009,
                    },
                    {
                        id: 11012808,
                        content: "嗯？地上那个好像就是……",
                        npc: 110022,
                    },
                ],
            },
            {
                id: 11010518,
                dialogues: [
                    {
                        id: 11011701,
                        content: "…………",
                        npc: 110022,
                    },
                    {
                        id: 11011702,
                        content: "通讯器的呼叫音",
                    },
                    {
                        id: 11011703,
                        content: "…………",
                        npc: 110022,
                    },
                    {
                        id: 11011704,
                        content: "通讯器的呼叫音",
                    },
                ],
            },
            {
                id: 11010519,
                dialogues: [
                    {
                        id: 11018001,
                        content: "等一下。",
                        npc: 110010,
                    },
                    {
                        id: 11018002,
                        content: "接下来的任务容不得出任何错，我们还是得排除风险——小姑娘和老人家不能跟着了。",
                        npc: 110010,
                    },
                    {
                        id: 11018003,
                        content: "……为什么？刚才您也看到了，到处都是秽兽，如果在这里和你们分开，我和爷爷一定会没命的！",
                        npc: 110034,
                    },
                    {
                        id: 11018004,
                        content: "长官，我帮过您的！您想，我刚刚给您带路，帮您顺利会合……求求您……求求您不要抛下我们！",
                        npc: 110034,
                    },
                ],
            },
            {
                id: 11010520,
                dialogues: [
                    {
                        id: 11011705,
                        content: "……喂？",
                        npc: 110005,
                    },
                    {
                        id: 11011706,
                        content: "喂？我是“狮鹫”分队医务员达芙涅·塞奥多尔。",
                        npc: 110005,
                    },
                    {
                        id: 11011707,
                        content: "……{nickname2}？是你吗？为什么不说话？你受伤了？",
                        npc: 110005,
                    },
                    {
                        id: 11011708,
                        content: "你在哪儿？我马上申请赶过去……",
                        npc: 110005,
                    },
                    {
                        id: 11011709,
                        content: "我……只是想听听你们的声音。我没事，你们还好吗？",
                        npc: 110022,
                    },
                    {
                        id: 11011710,
                        content: "“雪狼”的残兵和我们会合了，我们这里暂时还算安稳。你那边呢？",
                        npc: 110005,
                    },
                    {
                        id: 11011711,
                        content: "……我……也很好。我继续执行任务了，再见。",
                        npc: 110022,
                    },
                    {
                        id: 11011712,
                        content: "请多保重……我们会在迪斯玛尼亚平安重逢。",
                        npc: 110005,
                    },
                ],
            },
            {
                id: 11010521,
                dialogues: [
                    {
                        id: 11017707,
                        content: "各位长官……冷凝机的蒸汽很危险，千万不要久留。",
                        npc: 110017,
                    },
                ],
            },
            {
                id: 11010522,
                dialogues: [
                    {
                        id: 11017710,
                        content: "秽、秽兽……！",
                        npc: 110034,
                    },
                    {
                        id: 11017711,
                        content: "平民都退到我身后去。",
                        npc: 110022,
                    },
                    {
                        id: 11017705,
                        content: "这股热气是……",
                        npc: 110034,
                    },
                    {
                        id: 11017706,
                        content: "当心！前面有一台冷凝机，靠太近的话会受伤的！",
                        npc: 110034,
                    },
                ],
            },
            {
                id: 11010523,
                dialogues: [
                    {
                        id: 11017712,
                        content: "谢谢您救了我们！原来也不是所有帝国士兵都……",
                        npc: 110034,
                    },
                    {
                        id: 11017713,
                        content: "啊，抱歉！我是说，我曾经以为帝国士兵都和同盟的家伙一样蛮横粗暴，但现在我知道了，不是我想的那样！",
                        npc: 110034,
                    },
                ],
            },
            {
                id: 11010526,
                dialogues: [
                    {
                        id: 11011901,
                        content: "……你说什么？支援延误？",
                        npc: 110010,
                    },
                    {
                        id: 11011902,
                        content: "“一角鲸”分队在大桥这边遇到些同盟的小花招，现在我们被耽搁在这儿了。",
                        npc: 110011,
                    },
                    {
                        id: 11011903,
                        content: "你让我用这点残兵强攻中央控制室？富尔维斯，你做什么梦呢，那里可是有<H>雾影会</>的<H>信使</>守着！",
                        npc: 110010,
                    },
                    {
                        id: 11011904,
                        content:
                            "我管他什么信使还是信差，军团平时养着你们这些“骸”，不就是用在这种关键时刻的？更何况，你那边不还有一个实力堪比“骸”的{nickname2}？",
                        npc: 110011,
                    },
                    {
                        id: 11011905,
                        content: "中央控制室就在前面，距离你们在的那个4号炮台只有不到五十米了。",
                        npc: 110011,
                    },
                    {
                        id: 11011906,
                        content: "再前进这五十米，我们就可以将胜利献给陛下了！这有什么难？",
                        npc: 110011,
                    },
                    {
                        id: 11011907,
                        content: "…………",
                        npc: 110010,
                    },
                    {
                        id: 11011908,
                        content: "{nickname2}？还顺利吗？",
                        npc: 110010,
                    },
                    {
                        id: 11011909,
                        content: "西蒙阵亡，其他几个救下来了。",
                        npc: 110022,
                    },
                    {
                        id: 11011910,
                        content: "我们还遇到了几个被同盟掳来的卡戎难民，是他们带我们来这儿的。",
                        npc: 110022,
                    },
                    {
                        id: 11011911,
                        content: "难民？会不会是同盟的人假扮的？",
                        npc: 110010,
                    },
                    {
                        id: 11011912,
                        content:
                            "所以我让士兵们看好他们了。如果他们是平民，那么跟着我们比乱转更安全；如果他们是同盟的人，就刚好一并带回皇都。",
                        npc: 110022,
                    },
                    {
                        id: 11011913,
                        content: "如果他们是敌人，那带上他们，埋伏在暗的同盟成员也会适当顾虑同伴的性命。嗯，你很周全。",
                        npc: 110010,
                    },
                    {
                        id: 11011914,
                        content: "至于这边……支援在路上出了些状况，上头的命令是，“任务继续”。",
                        npc: 110010,
                    },
                    {
                        id: 11011915,
                        content: "我听到了。",
                        npc: 110022,
                    },
                    {
                        id: 11011916,
                        content:
                            "……往好处想，任务也到最后了。揍扁所有拦路的，想办法打开中央控制室的大门，把秘钥放进控制台，回收权限，一切就结束了。",
                        npc: 110010,
                    },
                    {
                        id: 11011936,
                        content: "不过麻烦的是，中央控制室的门没法从外侧打开……",
                        npc: 110010,
                    },
                    {
                        id: 11011937,
                        content: "所以您在调试这门炮……",
                        npc: 110022,
                    },
                    {
                        id: 11018402,
                        content: "对。不过现在要塞的动力瘫痪了，得想个办法把这门炮运过去。",
                        npc: 110010,
                    },
                    {
                        id: 11011939,
                        content: "长官，成功在附近仓库找到了罐装月髓液，已经按您的吩咐连接上剩下的髓动轮了。",
                        npc: 110020,
                    },
                    {
                        id: 11011940,
                        content: "好……应该足够支持把这门炮运到中央控制室附近了。",
                        npc: 110010,
                    },
                    {
                        id: 11017714,
                        content: "前面那个是……阿瓦尔长官！",
                        npc: 110015,
                    },
                    {
                        id: 11017715,
                        content: "（好，总算是平安会合了。）",
                        npc: 110022,
                    },
                ],
            },
            {
                id: 11010527,
                dialogues: [
                    {
                        id: 11017420,
                        content: "他们管这里叫“模拟战场”，说什么……“这次的主题是冰湖城防卫战”。",
                        npc: 110034,
                    },
                    {
                        id: 11017421,
                        content: "听说那个冰湖城，到处都是冰天雪地的。我还没见过雪呢……真想去看看！",
                        npc: 110034,
                    },
                    {
                        id: 11017422,
                        content: "……我是说，如果，我能活着回家。",
                        npc: 110034,
                    },
                ],
            },
            {
                id: 11010528,
                dialogues: [
                    {
                        id: 11018404,
                        content: "这门炮调校得差不多，模拟战场区域的供能也恢复了。",
                        npc: 110010,
                    },
                    {
                        id: 11018405,
                        content: "走吧，去控制台开门。我也一起。",
                        npc: 110010,
                    },
                ],
            },
        ],
    },
    {
        id: 110107,
        quests: [
            {
                id: 11010704,
                dialogues: [
                    {
                        id: 11013401,
                        content: "……权限覆盖完毕……",
                    },
                    {
                        id: 11013402,
                        content: "……当前权限：阿瓦尔·赫德兰……",
                    },
                    {
                        id: 11013403,
                        content:
                            "尊敬的阿瓦尔·赫德兰中校，下午好！海伯利亚军团箴言第十六条：当敌人在你的射程内，别忘了你也在敌人的射程内。",
                    },
                    {
                        id: 11013404,
                        content: "……搞定了。",
                        npc: 110010,
                    },
                    {
                        id: 11013405,
                        content: "嗨，打了半辈子仗了，头一次这么汗流浃背的！哈哈，我还担心再也见不到达芙涅和克劳迪娅了。",
                        npc: 110010,
                    },
                    {
                        id: 11013406,
                        content: "怪事，都拿到操作权限了，这门还是打不开……",
                        npc: 110010,
                    },
                    {
                        id: 11013408,
                        content: "…………",
                        npc: 110022,
                    },
                    {
                        id: 11013702,
                        content: "法露茜，你留下，处理干净。",
                        npc: 110011,
                    },
                    {
                        id: 11013703,
                        content: "是。",
                        npc: 110012,
                    },
                    {
                        id: 11019301,
                        content: "…………",
                    },
                    {
                        id: 11019302,
                        content: "法露茜……直接……毁……制室……",
                        npc: 110011,
                    },
                    {
                        id: 11019303,
                        content: "是。",
                        npc: 110012,
                    },
                    {
                        id: 11019304,
                        content: "…………",
                    },
                    {
                        id: 11013705,
                        content: "……小型录音设备……{性别2：他|她}还带了这个？",
                        npc: 110012,
                    },
                    {
                        id: 11013706,
                        content:
                            "尊敬的阿瓦尔·赫德兰中校，您尚未输入指令。海伯利亚军团箴言第十七条：服从命令，信任战友，才会在战场上活得更久。",
                    },
                    {
                        id: 11018819,
                        content: "不愧是我们的阿瓦尔，真的活着走到了这里。",
                        npc: 110011,
                    },
                    {
                        id: 11013601,
                        content: "富尔维斯……真有你的。",
                        npc: 110010,
                    },
                    {
                        id: 11013602,
                        content: "这些伪证都是你搞出来的吧？我还以为你们这些元老院贵族不会染指这种下三滥的招数，看来是我看走眼了。",
                        npc: 110010,
                    },
                    {
                        id: 11013603,
                        content: "我和那些老顽固不一样，对实用主义者来说，办法能用就行。",
                        npc: 110011,
                    },
                    {
                        id: 11013604,
                        content: "这——不是那个你很得意的学生吗？你做的？",
                        npc: 110011,
                    },
                    {
                        id: 11013605,
                        content: "呵，因为我想和你谈笔交易。这里的事只有我们两个知道，不需要多余的耳朵。",
                        npc: 110010,
                    },
                    {
                        id: 11013606,
                        content: "…………",
                        npc: 110012,
                    },
                    {
                        id: 11013607,
                        content: "出去吧，法露茜。没事，现在整座要塞都在我们手里——他不敢动手。",
                        npc: 110011,
                    },
                    {
                        id: 11013608,
                        content: "是，我在门外随时待命。",
                        npc: 110012,
                    },
                    {
                        id: 11013420,
                        content: "<W>还有人想要你的命，那家伙就藏在你们军团的人之中。</>",
                        npc: 110009,
                    },
                    {
                        id: 11013421,
                        content: "（……那个女人，卡嘉，说过这样的话……）",
                        npc: 110022,
                    },
                    {
                        id: 11013422,
                        content:
                            "（中央控制室的录音和文件、卡嘉最后的话……以及眼前的阿瓦尔·赫德兰，曾经教授我体术和战斗技巧，和我一起一步步走到这里的老师。）",
                        npc: 110022,
                    },
                    {
                        id: 11013410,
                        content: "（我应该……相信谁？）",
                        npc: 110022,
                    },
                    {
                        id: 11013409,
                        content:
                            "（这份录音，这份文件……以及眼前的阿瓦尔·赫德兰，曾经教授我体术和战斗技巧，和我一起一步步走到这里的老师。）",
                        npc: 110022,
                    },
                    {
                        id: 11013410,
                        content: "（我应该……相信谁？）",
                        npc: 110022,
                    },
                ],
            },
            {
                id: 11010705,
                dialogues: [
                    {
                        id: 11012915,
                        content: "小心点，里面可能还有敌人。",
                        npc: 110010,
                    },
                ],
            },
        ],
    },
    {
        id: 110108,
        quests: [
            {
                id: 11010801,
                dialogues: [
                    {
                        id: 11014601,
                        content: "达芙涅·塞奥多尔和不知名同伙躲进了地下水道，现在在1号储水池附近。",
                        npc: 110012,
                    },
                    {
                        id: 11014602,
                        content: "向1号储水池放水，逼他们出来！",
                        npc: 110012,
                    },
                    {
                        id: 11014603,
                        content: "还是被发现了……我们得在这里被淹没之前离开！",
                        npc: 110005,
                    },
                ],
            },
            {
                id: 11010804,
                dialogues: [
                    {
                        id: 11015101,
                        content: "暂时安全了……",
                        npc: 110005,
                    },
                    {
                        id: 11015102,
                        content: "前面应该是出口。但……",
                        npc: 110005,
                    },
                    {
                        id: 11015103,
                        content: "他们肯定在那里设了埋伏。",
                        npc: 110022,
                    },
                    {
                        id: 11015104,
                        content:
                            "您伤得很重，我们……会有胜算吗……而且，就算跑出要塞，军团也不会放过我们……等待我们的，会是无休止的追捕和刺杀……",
                        npc: 110005,
                    },
                    {
                        id: 11015131,
                        content: "您与他都不知道……我想要的，从来都不是一个用自己的身躯为我遮风挡雨的人。我真正的愿望是……",
                        npc: 110005,
                    },
                    {
                        id: 11015132,
                        content: "如果遮风挡雨的伞小到只能庇护一人，请让我和你们一起走进雨里。",
                        npc: 110005,
                    },
                    {
                        id: 11015133,
                        content: "我，想要的是，<H>和您一起</>活下去。",
                        npc: 110005,
                    },
                    {
                        id: 11015134,
                        content: "达芙涅……",
                        npc: 110022,
                    },
                    {
                        id: 11015135,
                        content: "我们再一起想想吧……一定有办法，一定还有办法的！",
                        npc: 110005,
                    },
                    {
                        id: 11015136,
                        content: "现在的情况是，富尔维斯要灭我们的口，他的手段是给我们扣上间谍的帽子，借军团同僚的手诛杀我们……",
                        npc: 110005,
                    },
                    {
                        id: 11015137,
                        content: "“狮鹫”、“雪狼”两支先遣小队仅剩我们二人，整座要塞的士兵全受富尔维斯和他的副官法露茜调遣……整座要塞的士兵……",
                        npc: 110005,
                    },
                    {
                        id: 11015138,
                        content: "等等，我想到了……！父亲和我讲过，“以退为进，险中求胜”……",
                        npc: 110005,
                    },
                    {
                        id: 11015139,
                        content: "我们还有一个选择……“自投罗网”。",
                        npc: 110005,
                    },
                    {
                        id: 11015201,
                        content: "于是，我牵起了她的手，朝着透过门缝的那一隙阳光走去。",
                        npc: 110022,
                    },
                    {
                        id: 11015202,
                        content: "就像是，正踏入一座光辉璀璨的坟墓——",
                        npc: 110022,
                    },
                    {
                        id: 11015203,
                        content: "我们用尽最后的力气甩开追兵，一路找到刚抵达要塞的西比尔军团长。",
                        npc: 110022,
                    },
                    {
                        id: 11015204,
                        content: "再后来，正如达芙涅猜测的那样，我们被押送到了这里。",
                        npc: 110022,
                    },
                ],
            },
            {
                id: 11010809,
                dialogues: [
                    {
                        id: 11018905,
                        content: "莱昂，马尔科，还有……莫妮卡……",
                        npc: 110022,
                    },
                    {
                        id: 11018906,
                        content: "……都是被一发子弹击中的，没有挣扎或抵抗痕迹。",
                        npc: 110005,
                    },
                    {
                        id: 11018907,
                        content: "他们是被信任的人杀害的……看血迹，是我们被困在中央控制室的时候……富尔维斯这混蛋……",
                        npc: 110022,
                    },
                    {
                        id: 11018908,
                        content: "…………",
                        npc: 110022,
                    },
                    {
                        id: 11018909,
                        content: "走吧，达芙涅。我们必须活着离开这里。",
                        npc: 110022,
                    },
                    {
                        id: 11014301,
                        content: "你去哪儿？",
                        npc: 110005,
                    },
                    {
                        id: 11014302,
                        content: "地下水道。",
                        npc: 110022,
                    },
                    {
                        id: 11014303,
                        content: "要塞里都是富尔维斯的人，我们只能去下面碰碰运气。",
                        npc: 110022,
                    },
                    {
                        id: 11014304,
                        content: "……我知道了。",
                        npc: 110005,
                    },
                    {
                        id: 11014305,
                        content: "要小心这里的士兵。这里很可能已经没有“战友”，只有“敌人”了。",
                        npc: 110005,
                    },
                ],
            },
            {
                id: 11010812,
                dialogues: [
                    {
                        id: 11014401,
                        content: "哈、哈、哈……",
                        npc: 110005,
                    },
                    {
                        id: 11014402,
                        content: "说实在的，我……我现在脑袋很乱，很乱。",
                        npc: 110005,
                    },
                    {
                        id: 11014403,
                        content:
                            "他死了，父……阿瓦尔长官。死了。外边的士兵，海伯利亚的士兵，要杀掉我。他们说，我是间谍。我不知道……我不知道……",
                        npc: 110005,
                    },
                    {
                        id: 11014404,
                        content: "我请求您……请求您告诉我……我可以信任您……只要您这么说，我就会相信。",
                        npc: 110005,
                    },
                ],
            },
        ],
    },
    {
        id: 110109,
        quests: [
            {
                id: 11010904,
                dialogues: [
                    {
                        id: 11016501,
                        content: "…………！！",
                        npc: 110022,
                    },
                    {
                        id: 11016502,
                        content: "……怎么突然醒了？我正问到最关键的部分！",
                        npc: 110039,
                    },
                    {
                        id: 11016503,
                        content: "没关系，典狱长大人。我还记得我在梦中对你说了什么。",
                        npc: 110022,
                    },
                    {
                        id: 11016504,
                        content: "我会将那天的真相原原本本地告诉你，也希望你听过之后，能凭借你心中的那份“正义”做出选择。",
                        npc: 110022,
                    },
                    {
                        id: 11016505,
                        content: "你说吧。",
                        npc: 110039,
                    },
                    {
                        id: 11016506,
                        content: "那天……",
                        npc: 110022,
                    },
                    {
                        id: 11016601,
                        content: "让我们好好谈一谈吧。",
                        npc: 110010,
                    },
                    {
                        id: 11016602,
                        content: "我长话短说。我们没有多少时间了，如果接下来还是联络不上外面，我就用这把枪向你射击，而你要做的是——装死。",
                        npc: 110010,
                    },
                    {
                        id: 11016603,
                        content: "为了把戏做足，我会打得更真一点。虽然不是要害，但可能会很疼。你一定要忍住，别出声。",
                        npc: 110010,
                    },
                    {
                        id: 11016604,
                        content: "您要做什么？",
                        npc: 110022,
                    },
                    {
                        id: 11016605,
                        content: "我们被困在这道门里，和外面的通讯全被切断了。富尔维斯就在路上……算算时间，这会儿他应该已经把持了整座要塞。",
                        npc: 110010,
                    },
                    {
                        id: 11016606,
                        content: "死人才不会辩解，富尔维斯一定会要我的命。你和我一起行动，又目睹了他构陷的经过，他想必也不会让你活着回去。",
                        npc: 110010,
                    },
                    {
                        id: 11016607,
                        content: "…………！！",
                        npc: 110022,
                    },
                    {
                        id: 11016608,
                        content: "没关系，有我呢。",
                        npc: 110010,
                    },
                    {
                        id: 11016609,
                        content: "……如果我“杀了你”，假借内讧向他投诚，他就有可能放松警惕，放过你……这是能让你活下去的唯一方式了。",
                        npc: 110010,
                    },
                    {
                        id: 11016610,
                        content: "不……老师，等他们打开门，我们就一起杀出去！",
                        npc: 110022,
                    },
                    {
                        id: 11016622,
                        content: "那以你估计，经过这一路的消耗，再加上坐困在此的形势，你我现在和富尔维斯的亲兵硬碰硬，有几成胜算？",
                        npc: 110010,
                    },
                    {
                        id: 11016623,
                        content: "对方合围的话……胜算接近于零。但大不了就是一死——",
                        npc: 110022,
                    },
                    {
                        id: 11016624,
                        content: "死很容易，带着使命活下去却很难。但，{nickname2}，我命令你这么做，这个任务也只有你能完成。",
                        npc: 110010,
                    },
                    {
                        id: 11016625,
                        content: "至于我……呵，我这条命比你想象中宝贵，还有别的用呢。",
                        npc: 110010,
                    },
                    {
                        id: 11016612,
                        content:
                            "等会儿我会试着先和富尔维斯谈判。当然，多半是谈不拢的，所以别抱希望。我去和他谈判，只是为了一个重要的东西——",
                        npc: 110010,
                    },
                    {
                        id: 11016613,
                        content: "“证据”。",
                        npc: 110010,
                    },
                    {
                        id: 11016614,
                        content: "这是录音设备，你贴身带着。它会成为你日后扳倒富尔维斯的铁证。",
                        npc: 110010,
                    },
                    {
                        id: 11016615,
                        content: "决不能让士兵们冤屈的哭号，永远在龙莎要塞上空徘徊。",
                        npc: 110010,
                    },
                    {
                        id: 11016616,
                        content: "……老师……",
                        npc: 110022,
                    },
                    {
                        id: 11016617,
                        content: "别苦着脸，笑一个！战士哪怕面对千万发炮弹，也要笑着一步步向前啊。",
                        npc: 110010,
                    },
                    {
                        id: 11016618,
                        content: "…………",
                        npc: 110010,
                    },
                    {
                        id: 11016619,
                        content: "……{nickname2}，我引以为傲的学生啊……抱歉，连累你卷进了这种事。",
                        npc: 110010,
                    },
                    {
                        id: 11016620,
                        content:
                            "但你一定要活下去，原原本本地将这里的真相带给军团长，带给陛下。你要让全帝国的人知道，这里的每一个士兵，都为了他们的信条与使命，战至最后一刻。",
                        npc: 110010,
                    },
                    {
                        id: 11016621,
                        content: "……荣耀尽归吾皇。",
                        npc: 110010,
                    },
                    {
                        id: 11016701,
                        content: "……这就是那天在中央控制室发生的事。",
                        npc: 110022,
                    },
                    {
                        id: 11016702,
                        content:
                            "阿瓦尔老师在最后一刻，面对比他强大千万倍的阴谋和子弹，用自己的生命留下了决定性的证据——这便是他坚守正义的方式。",
                        npc: 110022,
                    },
                    {
                        id: 11016703,
                        content: "只可惜他还是低估了敌人的缜密。我半昏迷时，隐约感觉到，富尔维斯的副官法露茜带走了那支录音设备。",
                        npc: 110022,
                    },
                    {
                        id: 11016704,
                        content: "醒来后，富尔维斯已经接管了整座要塞，此时和他们硬拼只会让我和达芙涅送命……真相也将石沉大海。",
                        npc: 110022,
                    },
                    {
                        id: 11019102,
                        content: "所以，我们选择用这种方式来见你。",
                        npc: 110022,
                    },
                    {
                        id: 11019103,
                        content:
                            "富尔维斯陷害阿瓦尔真正的目的，是排除帝国高层的卡戎之民。你明白，如果他的计划得逞，对帝国，以及对<H>你本人</>而言又意味着什么。",
                        npc: 110022,
                    },
                    {
                        id: 11016706,
                        content: "海尔法典狱长，你言必称正义，我想你应该明白应当怎么坚守你的正义了。去抓捕法露茜吧，你想要的真相就在那里。",
                        npc: 110022,
                    },
                    {
                        id: 11019104,
                        content:
                            "幸运的话，你会得到一份决定性的证据。即使证据不幸被销毁，她的证言也有极大价值。请让我和她在你的主持下当面对质。",
                        npc: 110022,
                    },
                    {
                        id: 11016707,
                        content: "海伯利亚是一架巨大的机器，它需要能让每颗螺钉都正确运转的规律。",
                        npc: 110039,
                    },
                    {
                        id: 11016708,
                        content:
                            "我的职责便是保护这条规律，保护海伯利亚订下的“正义”。如果有人想要利用我的手摧毁这条规律，我便会让他付出应有的代价。",
                        npc: 110039,
                    },
                    {
                        id: 11016709,
                        content: "我会去调查法露茜。但如果你在用谎言拖延时间，想必你清楚后果。",
                        npc: 110039,
                    },
                    {
                        id: 11016710,
                        content: "…………",
                        npc: 110022,
                    },
                ],
            },
            {
                id: 11010905,
                dialogues: [
                    {
                        id: 11016801,
                        content: "{nickname2}，海尔法典狱长吩咐了，带塞奥多尔小姐过来。",
                        npc: 110021,
                    },
                    {
                        id: 11016802,
                        content: "审讯的时候，她一直请求见你。",
                        npc: 110021,
                    },
                    {
                        id: 11016825,
                        content: "还有一句话，是他最后对我说的——",
                        npc: 110040,
                    },
                    {
                        id: 11016826,
                        content: "“有机会的话，请你找到达芙涅。如果她还活着，带她一起……逃出去。等安全了，告诉她——”",
                        npc: 110040,
                    },
                    {
                        id: 11016827,
                        content: "“对不起，我的女儿。其实我一直等着，你再叫我一声‘爸爸’，像小时候一样。”",
                        npc: 110010,
                    },
                    {
                        id: 11016828,
                        content: "……他……怎么还留着这张呢……",
                        npc: 110041,
                    },
                    {
                        id: 11016829,
                        content: "明明……我都已经长这么大了……",
                        npc: 110041,
                    },
                    {
                        id: 11016830,
                        content: "好了，达芙涅小姐，你们通过了典狱长的又一次考验，可以请你先离开了。",
                        npc: 110021,
                    },
                    {
                        id: 11016831,
                        content: "你在偷听？",
                        npc: 110040,
                    },
                    {
                        id: 11016832,
                        content: "是典狱长的命令。把你们单独关在一起，监听你们到底在谈些什么。",
                        npc: 110021,
                    },
                    {
                        id: 11016833,
                        content: "“如果是犯人的话，现在很可能在串通口供”……我明白了，谢谢海尔法大人给我们这个自证的机会。",
                        npc: 110041,
                    },
                    {
                        id: 11016834,
                        content: "也许……我们很快就能走出这里了。",
                        npc: 110041,
                    },
                ],
            },
            {
                id: 11010906,
                dialogues: [
                    {
                        id: 11017101,
                        content: "还好、还好。要是再来晚一点，恐怕和你这次会面就是在墓园了。",
                        npc: 110018,
                    },
                    {
                        id: 11017102,
                        content:
                            "我说朋友，你这次是真的闯了大祸了。你知道见皇兄一面有多难，而我又极少染指政客们的事。不过你还算走运，今早皇兄为别的事情召见我，我才求来这一纸特赦令。",
                        npc: 110018,
                    },
                    {
                        id: 11017103,
                        content: "不过总算，又可以呼吸自由的空气了——想去哪儿？美术馆、歌剧院？凯旋大街的酒馆？还是随便在絮语河岸吹吹风？",
                        npc: 110018,
                    },
                    {
                        id: 11017104,
                        content: "……谢谢……不过，先不用了。",
                        npc: 110022,
                    },
                    {
                        id: 11017105,
                        content: "……你……脸色好差。看来他们没少折磨你。等下随我去我的居所吧，我安排我的医生为你诊治。",
                        npc: 110018,
                    },
                    {
                        id: 11017106,
                        content:
                            "千年后的今天，海伯利亚的监狱居然还在用原始野蛮、毫无人道主义可言的刑罚……那些谄媚的作家笔下“最伟大、最繁荣的时代”，简直就是最拙劣的喜剧。",
                        npc: 110018,
                    },
                    {
                        id: 11017107,
                        content: "先别说这个了……达芙涅呢？",
                        npc: 110022,
                    },
                    {
                        id: 11017108,
                        content: "放心。我听闻你一直在护着她，这份特赦令自然也会庇护她。",
                        npc: 110018,
                    },
                    {
                        id: 11017112,
                        content: "还有一件事……",
                        npc: 110022,
                    },
                    {
                        id: 11017114,
                        content:
                            "富尔维斯的副官法露茜。我认为她的失踪没那么简单——她是这个案子真相的关键。如果可以，我想拜托你帮忙调查她的下落，无论生死。",
                        npc: 110022,
                    },
                    {
                        id: 11017115,
                        content: "富尔维斯失踪的副官……？好，我记下了。",
                        npc: 110018,
                    },
                    {
                        id: 11017109,
                        content: "那就好……抱歉，现在的我，暂时还没法报答你。",
                        npc: 110022,
                    },
                    {
                        id: 11017110,
                        content: "报答——嗯……那来给我当半年保镖如何？",
                        npc: 110018,
                    },
                    {
                        id: 11017111,
                        content: "保镖？",
                        npc: 110022,
                    },
                    {
                        id: 11019105,
                        content: "嗯。等你休息好了，我再仔细说给你听。",
                        npc: 110018,
                    },
                    {
                        id: 11019106,
                        content: "我讨厌这座监狱里的血腥味儿，准备好了我们就走吧。",
                        npc: 110018,
                    },
                    {
                        id: 11016901,
                        content: "你们走不出这里了。",
                        npc: 110032,
                    },
                    {
                        id: 11016902,
                        content: "…………？！",
                        npc: 110041,
                    },
                    {
                        id: 11016903,
                        content: "上头加急走完了所有审核流程，到我手里的，只有一张要你们命的纸。",
                        npc: 110032,
                    },
                    {
                        id: 11016904,
                        content: "典狱长大人，这不对——这不符合审判的流程！",
                        npc: 110041,
                    },
                    {
                        id: 11016905,
                        content: "看看这份文件吧，最后这串签名。连最高法务大臣都签了，西比尔也拦不下。你们真是卷进了了不得的事。",
                        npc: 110032,
                    },
                    {
                        id: 11016906,
                        content: "法露茜呢？只要能找到法露茜，找到那支录音设备，真相就……！",
                        npc: 110040,
                    },
                    {
                        id: 11016907,
                        content: "她失踪了。",
                        npc: 110032,
                    },
                    {
                        id: 11016908,
                        content:
                            "在龙莎一役的一场爆炸中，她不慎跌落到要塞外。士兵们在河岸发现了她染血的配枪。虽然军团仍在搜寻她的下落，但依照目前推测，她很可能已经死亡。",
                        npc: 110032,
                    },
                    {
                        id: 11016909,
                        content: "……典狱长大人，您真的相信这种巧合吗？",
                        npc: 110041,
                    },
                    {
                        id: 11016910,
                        content: "…………",
                        npc: 110032,
                    },
                    {
                        id: 11017001,
                        content: "维吉尔亲王殿下！这是审讯犯人的肮脏地方，请您留步！",
                    },
                ],
            },
            {
                id: 11010909,
                dialogues: [
                    {
                        id: 11019123,
                        content: "（弗莱格桑省……）",
                        npc: 110022,
                    },
                    {
                        id: 11019124,
                        content: "（那里有我连典狱长都没有告诉的……<H>那个东西</>……）",
                        npc: 110022,
                    },
                    {
                        id: 11019125,
                        content: "（<H>第二新枝计划的另一个关键……零号的触媒</>。）",
                        npc: 110022,
                    },
                    {
                        id: 11019107,
                        content: "五日后",
                    },
                    {
                        id: 11019108,
                        content: "皇都·迪斯玛尼亚 皇家大剧院",
                    },
                    {
                        id: 11019109,
                        content:
                            "刚才这出《雪国的孩子》是作曲家卡瓦拉多西的手笔，故事改编自流传于他家乡冰湖城的精怪传说……{nickname2}，你在听吗？",
                        npc: 110018,
                    },
                    {
                        id: 11019110,
                        content: "啊？嗯，在听，你是说有精怪？在冰湖城？",
                        npc: 110022,
                    },
                    {
                        id: 11019111,
                        content: "……好吧，你还是忧思重重，我本想你能来这儿能稍微散散心。",
                        npc: 110018,
                    },
                    {
                        id: 11019112,
                        content: "上次你说的“保镖”是怎么回事？我想知道接下来的安排。我……还有一件事必须去做。",
                        npc: 110022,
                    },
                    {
                        id: 11019113,
                        content: "我正打算今天和你聊这个。接下来我要去一趟弗莱格桑省的丹流城，大概半年的时间。这半年就由你来担任我的近卫。",
                        npc: 110018,
                    },
                    {
                        id: 11017113,
                        content: "你短期可能回不了军团了。你的嫌疑并未真的洗清，现在回军团只怕身份会尴尬。",
                        npc: 110018,
                    },
                    {
                        id: 11019115,
                        content: "五天前皇兄召我会面，就是要我以皇室的名义去丹流城访问。我便和他说，想将你作为近卫带在身边，他同意了。",
                        npc: 110018,
                    },
                    {
                        id: 11019116,
                        content: "你要我离开皇都，去丹流城？",
                        npc: 110022,
                    },
                    {
                        id: 11017116,
                        content:
                            "嗯。想想那份文件上的一串签名吧——迪斯玛尼亚不知道有多少人在看不见的暗角窥视着你。你的武器可以杀死秽兽，却挡不住来自背后的子弹。",
                        npc: 110018,
                    },
                    {
                        id: 11017117,
                        content:
                            "我知道你在担心什么。西比尔·梅森和达芙涅有些故交，且在这起事件中，她明显更相信你们无辜，所以她至少会保证达芙涅的安全。",
                        npc: 110018,
                    },
                    {
                        id: 11019119,
                        content: "我明白了。那就按你说的吧，刚好我要找的东西也顺路。需要我向你宣誓效忠之类的吗，亲王殿下？",
                        npc: 110022,
                    },
                    {
                        id: 11017119,
                        content: "……哈，你知道我最厌恶那些老家伙的繁文缛节。不过，你总算有心情开玩笑了，这很好。",
                        npc: 110018,
                    },
                    {
                        id: 11019121,
                        content: "简单做些准备吧，我们三日后出发。",
                        npc: 110018,
                    },
                    {
                        id: 11019122,
                        content: "好。",
                        npc: 110022,
                    },
                ],
            },
        ],
    },
    {
        id: 120001,
        quests: [
            {
                id: 12000101,
                dialogues: [
                    {
                        id: 12000401,
                        content: "让我看看——帮人找走丢的猫，抓偷蜡烛的小贼，疏通堵塞的烟囱……怎么都是些让人提不起劲的小委托。",
                        npc: 200002,
                    },
                    {
                        id: 12000402,
                        content: "喂，卡米拉，什么时候再来一发像群星绮晶那样的大单子呀？",
                        npc: 200002,
                    },
                    {
                        id: 12000403,
                        content: "停、停——再叽叽喳喳个没完，酒客们都要被你烦跑了。今天的损失就从你的生活费里扣吧。",
                        npc: 200003,
                    },
                    {
                        id: 12000404,
                        content:
                            "——呜呜不要！是{nickname}说，最近的委托都太小了，那一点点报酬都不够{性别：他|她}这个冉冉升起的冰湖之星·{性别：狩月之王|狩月女王}塞牙缝的！",
                        npc: 200002,
                    },
                ],
            },
            {
                id: 12000102,
                dialogues: [
                    {
                        id: 12000505,
                        content: "…………",
                    },
                    {
                        id: 12000501,
                        content: "门票只有两张！小仆从，你是要陪魔王大人一起去，还是找黎瑟陪我呀？",
                        npc: 200002,
                    },
                    {
                        id: 12000502,
                        content: "还用问吗，当然是我去。",
                        npc: 100001,
                    },
                    {
                        id: 12000503,
                        content: "这么干脆！我还以为小仆从会大度地说“那我这张就让给黎瑟吧”。",
                        npc: 200002,
                    },
                    {
                        id: 12000504,
                        content: "黎瑟现在的样子，还是不要勾起她的伤心回忆为好。等过些日子她心情平复了，再找她吧。",
                        npc: 100001,
                    },
                    {
                        id: 12001901,
                        content: "假装这里非常热闹、节日氛围",
                    },
                ],
            },
            {
                id: 12000103,
                dialogues: [
                    {
                        id: 12000601,
                        content:
                            "以薇奥莱塔女士的美妙歌喉，那清澈饱满的高音，充满艺术性的花腔，一定能完美诠释妖精的角色，让这部经久不衰的歌剧达到新的高峰！",
                        npc: 220003,
                    },
                    {
                        id: 12000602,
                        content: "是吗……依我看，这里的歌剧班底是一年不如一年了，也就是勉强能入耳的水平。",
                        npc: 220004,
                    },
                    {
                        id: 12000603,
                        content: "那你还场场不落地买票？",
                        npc: 220003,
                    },
                    {
                        id: 12000604,
                        content: "能不能听，总要实际到场后才好评价。毕竟也只能指着这些乐趣活了。",
                        npc: 220004,
                    },
                    {
                        id: 12000605,
                        content: "爸爸，莉莉马上就能听到大姐姐们施展声音的魔法了！",
                        npc: 220005,
                    },
                    {
                        id: 12000606,
                        content: "能和爸爸一起看歌剧，结束后还要去吃大餐，今天就是莉莉最幸福的一天！",
                        npc: 220005,
                    },
                    {
                        id: 12000607,
                        content: "喂，你听说了吗？前几天的银烛狂欢，有人在剧院当场行凶，直接惊动了军团老爷耶！",
                        npc: 220006,
                    },
                    {
                        id: 12000608,
                        content: "究竟是闹鬼、神弃者、还是“卡戎狩猎”的怪物复活了……想一探究竟的人，全被下封口令了！",
                        npc: 220006,
                    },
                    {
                        id: 12004101,
                        content: "……哇，好多人哦。大家都是来看剧的吗？",
                        npc: 200002,
                    },
                    {
                        id: 12004102,
                        content: "他们好像在聊一些很有意思的事情，小仆从，我们去听听看吧。",
                        npc: 200002,
                    },
                ],
            },
            {
                id: 12000104,
                dialogues: [
                    {
                        id: 12000711,
                        content: "男孩气冲冲地走了。仿佛为了展示自己的怒气，离去时，他重重地用肩膀撞了你们一下。",
                    },
                    {
                        id: 12000712,
                        content: "……痛！",
                        npc: 200002,
                    },
                    {
                        id: 12000713,
                        content: "明明是他主动拦下我们的，简直莫名其妙！",
                        npc: 200002,
                    },
                    {
                        id: 12000714,
                        content: "小仆从，我们赶紧去检票吧，不然赶不上开场了！",
                        npc: 200002,
                    },
                    {
                        id: 12000701,
                        content: "票，内部优惠，要不？",
                        npc: 220007,
                    },
                ],
            },
        ],
    },
    {
        id: 120002,
        quests: [
            {
                id: 12000201,
                dialogues: [
                    {
                        id: 12001101,
                        content: "在你们面前，检票员慢条斯理地戴上了单片眼镜。翻来覆去地打量手上两张单薄的票。",
                    },
                    {
                        id: 12000901,
                        content: "尊敬的先生，请拿好您的票。您的座位在进去后左手边的位置，愿您度过美妙的一天。",
                        npc: 220010,
                    },
                    {
                        id: 12000902,
                        content: "给你！这是白和小仆从的票。",
                        npc: 200002,
                    },
                    {
                        id: 12000903,
                        content: "哪来的卡戎崽种，滚出去，别把这里的地毯弄脏了。",
                        npc: 220010,
                    },
                    {
                        id: 12000715,
                        content: "…………",
                        npc: 220014,
                    },
                    {
                        id: 12000801,
                        content: "她在这边站了好久……是在等什么人吗？",
                        npc: 200002,
                    },
                    {
                        id: 12001102,
                        content: "哈……给我找着了。",
                        npc: 220010,
                    },
                    {
                        id: 12001103,
                        content: "以为用墨水描了日期就能用过期票混进去吗？成天把脑筋动在这种小偷小摸的事情上，逃不过我的眼睛！",
                        npc: 220010,
                    },
                    {
                        id: 12001104,
                        content: "在确凿证据前，你们哑口无言。",
                    },
                    {
                        id: 12001105,
                        content: "不对啊，小仆从。这个票面上的图画，和白刚刚拿着的那张不一样！",
                        npc: 200002,
                    },
                    {
                        id: 12001106,
                        content: "难道是……刚刚那个男孩离开时，把我们的票偷换了？！",
                        npc: 100001,
                    },
                    {
                        id: 12001107,
                        content: "他应该还没走远！我们找他说理去！",
                        npc: 200002,
                    },
                    {
                        id: 12001108,
                        content: "还想找借口逃跑？偷鸡摸狗的小鬼——不许走，我要把你们扭送进治安署去！",
                        npc: 220010,
                    },
                ],
            },
            {
                id: 12000202,
                dialogues: [
                    {
                        id: 12001310,
                        content: "女士，多谢你刚才出手帮助。",
                        npc: 100001,
                    },
                    {
                        id: 12001311,
                        content: "呵呵……不用这么拘谨。你可以直接称呼我的名字。",
                        npc: 210004,
                    },
                    {
                        id: 12001312,
                        content: "……止流女士？",
                        npc: 100001,
                    },
                    {
                        id: 12001313,
                        content: "女士是帝国常用的敬称吧？我至今听不惯。",
                        npc: 210004,
                    },
                    {
                        id: 12001314,
                        content: "我常年行南闯北经商，手中姑且也是有些铺子。你若是执意要加个后缀，不如叫我掌柜，听着顺耳些。",
                        npc: 210004,
                    },
                    {
                        id: 12001315,
                        content: "那……止流掌柜，您应该是在等什么人吧？我们在这儿，会不会打扰到您？",
                        npc: 100001,
                    },
                    {
                        id: 12001316,
                        content: "原来你在意的是这个呀，真可爱。",
                        npc: 210004,
                    },
                    {
                        id: 12001317,
                        content: "没关系的。那个人，大概是不会赴约了。",
                        npc: 210004,
                    },
                    {
                        id: 12001318,
                        content: "一个人观剧，也有几分冷清。今天能有你们陪着，这间包厢热闹了不少，我反而应该向你们道谢才是。",
                        npc: 210004,
                    },
                    {
                        id: 12001319,
                        content: "小仆从，竟然有人会辜负这么有钱又出手大方的漂亮姐姐，还让她伤心……真是太没眼光了！",
                        npc: 200002,
                    },
                    {
                        id: 12001320,
                        content: "在我的家乡，人与人之间的相遇相识被称为“缘分”。缘分来之不易，既然出现了就不如珍惜，你觉得呢？",
                        npc: 210004,
                    },
                    {
                        id: 12010801,
                        content: "你们来了？玩得怎么样？",
                        npc: 210004,
                    },
                    {
                        id: 12010802,
                        content: "嗯，大家都很热情好客。华胥的风光和人们，都和冰湖城大不一样……",
                        npc: 100001,
                    },
                    {
                        id: 12010803,
                        content: "刚刚这里发生的事情我们都看到了！不愧是止流姐姐，三下五除二就把那些人摆平了！",
                        npc: 200002,
                    },
                    {
                        id: 12010804,
                        content: "呵呵，做生意就是琢磨如何和人打交道。这种小场面，我早就习以为常了。反倒是在冰湖城和你们结交，更为难得。",
                        npc: 210004,
                    },
                    {
                        id: 12010805,
                        content: "好啦，该切入正题了。我这次雇佣你们，是为了解决<H>烛阴之灾</>而做准备。至于这烛阴之灾是何物……",
                        npc: 210004,
                    },
                    {
                        id: 12010806,
                        content: "我们已经有所了解啦！",
                        npc: 200002,
                    },
                    {
                        id: 12010807,
                        content: "哦？说来听听。",
                        npc: 210004,
                    },
                    {
                        id: 12010808,
                        content: "过来的路上，我们遭遇了玄色狴犴的袭击。幸好有位过路的行商相助，我们击退了它，没有受伤。",
                        npc: 100001,
                    },
                    {
                        id: 12010809,
                        content:
                            "行商姐姐告诉我们，就是这个什么烛阴之灾，会诞生很多像玄色狴犴一样的坏东西，然后它们四处咬人，让大家的日子很难过！",
                        npc: 200002,
                    },
                    {
                        id: 12010810,
                        content: "不错。玄色狴犴出现之前，你们可曾看到或听到什么异象？",
                        npc: 210004,
                    },
                    {
                        id: 12010811,
                        content: "好像……从虚空中传来过某种异兽吼叫的声音。",
                        npc: 100001,
                    },
                    {
                        id: 12010812,
                        content: "是了。那便是数载前被封印的恶蛟，如今正在复苏中的<H>烛阴</>发出的嘶吼。",
                        npc: 210004,
                    },
                    {
                        id: 12010813,
                        content:
                            "烛阴是华胥远古传说中，与白龙神君相敌对的恶神。它失智、狂乱的力量泄露而出，使恶兽横行。部分区域受其影响，也变得草木不生。",
                        npc: 210004,
                    },
                    {
                        id: 12010814,
                        content: "百年之前，在烟津渡区域，烛阴之灾初显端倪。时人只能仓皇应对，损失惨重，集结了众多人力物力才将其降服。",
                        npc: 210004,
                    },
                    {
                        id: 12010815,
                        content: "如今，烛阴再度从封印中复苏。这次，我打算未雨绸缪，早做准备，避免重蹈上次的覆辙。",
                        npc: 210004,
                    },
                    {
                        id: 12010816,
                        content: "哇，对手真的是一条龙耶，魔王大人已经热血沸腾起来了！那需要我和小仆从做什么呢？",
                        npc: 200002,
                    },
                    {
                        id: 12010817,
                        content: "华胥禁武。纵是走南闯北的织星客，也少有人精通防身的一招半式。",
                        npc: 210004,
                    },
                    {
                        id: 12010818,
                        content:
                            "所以，这次我要委托你们的，便是孤身深入已彻底浊化的尘漠石海，将其中的<W>三片烛阴鳞</>取来，好为重新封印这个孽兽做准备。",
                        npc: 210004,
                    },
                    {
                        id: 12010819,
                        content: "止流掌柜，可以问您一个问题吗？",
                        npc: 100001,
                    },
                    {
                        id: 12010820,
                        content: "这么重要的任务，您为何放心交给我一个名不经传的外来者去完成？",
                        npc: 100001,
                    },
                    {
                        id: 12010821,
                        content: "我只是一个涉世未深的狩月人。比我身手更好的想必还有很多。",
                        npc: 100001,
                    },
                    {
                        id: 12010822,
                        content: "那时候在剧院，当我触碰香炉时，烟迹像是被吸引了一样，朝我倾斜……您委托我，和这件事有关系吗？",
                        npc: 100001,
                    },
                    {
                        id: 12010823,
                        content: "……你却是敏锐。",
                        npc: 210004,
                    },
                    {
                        id: 12010824,
                        content:
                            "相信有人告诫过你了吧，你的能力很特殊，也很珍贵。而珍贵之物往往会引来觊觎。稍有不慎，就会为持有者招致灾难。",
                        npc: 210004,
                    },
                    {
                        id: 12010825,
                        content: "烛阴鳞并非常规手段可以采摘。需要一种高浓度活性物质与之共鸣，软化其束缚。",
                        npc: 210004,
                    },
                    {
                        id: 12010826,
                        content:
                            "我此次前往冰湖城，本是为了试试帝国炼金院的高纯度月髓液是否可以生效，却无意间发现了你的存在——弥足珍贵的“和鸣者”。",
                        npc: 210004,
                    },
                    {
                        id: 12010827,
                        content: "我需要借助你的能力去软化烛阴鳞。当然，你随时拥有拒绝的权利。一切还是以你的安危为最优先。",
                        npc: 210004,
                    },
                    {
                        id: 12010828,
                        content: "不。止流掌柜，感谢您的答案。这个任务，我接下了。",
                        npc: 100001,
                    },
                    {
                        id: 12010829,
                        content: "……你有没有想过，我对你伸出援手，或许也是看到了你的价值，从而别有用心？",
                        npc: 210004,
                    },
                    {
                        id: 12010830,
                        content: "我想过，但这改变不了您帮助过我的事实。况且，我也有自己的私心。",
                        npc: 100001,
                    },
                    {
                        id: 12010831,
                        content: "我在寻找自己的家人，但我一个人的力量过于渺小。为了达到这个目的，我会抓住一切可以凭借的外力。",
                        npc: 100001,
                    },
                    {
                        id: 12010832,
                        content: "如果帮助您可以换取未来某些时刻的援手，我想这是一笔相当划算的交易。",
                        npc: 100001,
                    },
                    {
                        id: 12010833,
                        content: "更何况，您当初帮我解围之时，我对您而言只是一个随处可见的路人。您帮了我，我也想为您做点什么。",
                        npc: 100001,
                    },
                    {
                        id: 12010834,
                        content: "呵呵……话都被你说尽了，我却没什么可说的了。看来假以时日，你也会成为一个优秀的“商人”。",
                        npc: 210004,
                    },
                    {
                        id: 12010835,
                        content: "在你出发前，那边桌子上有给你准备的盘缠。随意花，不够了再来向我要。",
                        npc: 210004,
                    },
                    {
                        id: 10010101,
                        content: "贝蕾，我……",
                        npc: 100001,
                    },
                ],
            },
            {
                id: 12000203,
                dialogues: [
                    {
                        id: 12001324,
                        content: "演出即将开始。还在走动的客人请尽快入座。",
                    },
                    {
                        id: 12001325,
                        content: "接下来，请您欣赏盖雷亚歌剧团带来的精彩表演——",
                    },
                    {
                        id: 12001326,
                        content: "很久以前，雪国城堡里，冰霜的妖精被两个孩子唤醒……",
                    },
                    {
                        id: 12001327,
                        content: "渺小的妖精飞向巨兽……",
                    },
                    {
                        id: 12001328,
                        content: "但巨兽稍稍用力，就折断了它的四肢……",
                    },
                    {
                        id: 12001329,
                        content: "它听到心脏的声音，第一次鼓动着，呐喊着它的命运——",
                    },
                    {
                        id: 12001370,
                        content: "……",
                    },
                    {
                        id: 12001330,
                        content: "……",
                        npc: 220041,
                    },
                ],
            },
            {
                id: 12000204,
                dialogues: [
                    {
                        id: 12001338,
                        content: "站住，我们老大让你们先别走。",
                        npc: 220017,
                    },
                    {
                        id: 12001339,
                        content: "什么人？说话好凶……这是对光之魔王大人应该有的态度吗！",
                        npc: 200002,
                    },
                    {
                        id: 12001340,
                        content: "魔王大人……什么乱七八糟的，让一边去！",
                        npc: 220017,
                    },
                    {
                        id: 12001341,
                        content: "止流女士是吧？我们老大和你有约，清场之前，还需要你在这里等待片刻了。",
                        npc: 220017,
                    },
                    {
                        id: 12001342,
                        content: "……一场歌剧都演完了，人还没来。这就是帝国的待客礼仪吗？",
                        npc: 220014,
                    },
                    {
                        id: 12001343,
                        content: "我是可以有耐心陪你们候着。但这两位小朋友呢，能否让他们先离场？",
                        npc: 220014,
                    },
                    {
                        id: 12001344,
                        content: "老子传达的不够清楚吗？散场结束前，一个都不能走！",
                        npc: 220017,
                    },
                    {
                        id: 12001345,
                        content: "…………",
                        npc: 220014,
                    },
                    {
                        id: 12001348,
                        content: "对不住啊，止流老板。人多嘈杂的环境我不习惯。清净了，才好谈事。",
                        npc: 220018,
                    },
                    {
                        id: 12001349,
                        content: "呵，好一个下马威。辩解还是不必了，我要的货呢？",
                        npc: 220014,
                    },
                    {
                        id: 12001350,
                        content: "你要的月髓液，我带来了。",
                        npc: 220018,
                    },
                    {
                        id: 12001351,
                        content: "白对这个人有点印象……卡米拉和我说过，他是这一片臭名昭著的地下军火商。他卖的东西货不对板，还老是想黑吃黑！",
                        npc: 200002,
                    },
                    {
                        id: 12001352,
                        content: "我再确认一下。我要的可不是大街上随处可见的普通货色，而是95%以上纯度的月髓原液，没错吧？",
                        npc: 220014,
                    },
                    {
                        id: 12001353,
                        content: "符不符合要求，你可以自行检查——但话说在前头，我们这里的规矩是先交钱，再验货。请先付钱吧，女士。",
                        npc: 220018,
                    },
                    {
                        id: 12001401,
                        content: "还有两位小朋友在，别让他们受了伤才好。",
                        npc: 220014,
                    },
                    {
                        id: 12001346,
                        content: "观剧的人流逐渐离场，只留下你们和眼前的男子在此对峙。",
                        npc: 100001,
                    },
                    {
                        id: 12001347,
                        content: "空荡荡的剧院中，逐渐传来了清脆的脚步声。",
                        npc: 100001,
                    },
                ],
            },
            {
                id: 12000205,
                dialogues: [
                    {
                        id: 12011201,
                        content: "呸、呸！好的不灵坏的灵，小仆从简直是乌鸦嘴——",
                        npc: 200002,
                    },
                    {
                        id: 12011202,
                        content: "又是玄色狴犴，它们的数量怎么越来越多了！",
                        npc: 100001,
                    },
                    {
                        id: 12011301,
                        content: "留神——",
                    },
                    {
                        id: 12001501,
                        content: "停手，女士，停手！",
                        npc: 220017,
                    },
                    {
                        id: 12001502,
                        content:
                            "兄弟们只是出来讨点生计。您看……这月髓液就作为见面礼送给您了，以您的大度和慷慨，想必是不会和我们这些小人物计较吧！",
                        npc: 220018,
                    },
                    {
                        id: 12001503,
                        content: "呵，现在倒是愿意交出来了？",
                        npc: 220014,
                    },
                    {
                        id: 12001504,
                        content: "算了，与你们多费口舌不过是浪费时间罢了。",
                        npc: 220014,
                    },
                    {
                        id: 12001505,
                        content: "{nickname}，可以请你帮我把货物递过来吗？我需要准备检验的工具。",
                        npc: 220014,
                    },
                ],
            },
            {
                id: 12000206,
                dialogues: [
                    {
                        id: 12011601,
                        content: "前方恐有玄色狴犴蛰伏，由我开路。请两位紧随我身后。",
                        npc: 210007,
                    },
                    {
                        id: 12001506,
                        content: "止流从怀中取出一样小巧玲珑的物品，并点燃了它。你依稀在书上看过它的描述，这或许是一只镂空香炉？",
                    },
                    {
                        id: 12001507,
                        content: "香炉的烟杳杳升起，烟迹笔直地伸向空中，然后消失于无形。",
                    },
                    {
                        id: 12001508,
                        content:
                            "这香是我们华胥特有的珍贵物产。它对存在于月髓原液中的某种特殊物质有极高的亲和力，只需碰到一星半点，烟迹就会发生变化。",
                        npc: 220014,
                    },
                    {
                        id: 12001509,
                        content: "……看这烟迹，他带来的货连最次的次品都不如。",
                        npc: 220014,
                    },
                    {
                        id: 12001510,
                        content: "高纯度月髓原液是军方管制物资，哪能让我们这些人随随便便接触到……",
                        npc: 220018,
                    },
                    {
                        id: 12001511,
                        content: "还以为有什么自己的特殊门路，结果不过如此。让我白跑一趟。",
                        npc: 220014,
                    },
                    {
                        id: 12001512,
                        content: "好啦，{nickname}，多谢你帮忙。可以把它的盖子拧上了。",
                        npc: 220014,
                    },
                    {
                        id: 12001513,
                        content: "容器的盖子有点滑手。操作时，你不小心碰到了止流手上的香炉，差点将它撞掉。",
                    },
                    {
                        id: 12001514,
                        content: "对不起，止流掌柜……！",
                        npc: 100001,
                    },
                    {
                        id: 12001515,
                        content: "小仆从，香的烟迹会被你吸引耶……难、难道？",
                        npc: 200002,
                    },
                    {
                        id: 12001516,
                        content: "…………",
                        npc: 100001,
                    },
                ],
            },
            {
                id: 12000207,
                dialogues: [
                    {
                        id: 12001517,
                        content: "哇……白完全搞错了！原来止流姐姐不是被心上人抛弃了，而是来和人接头交易。好险好险，还好刚刚没说出来。",
                        npc: 200002,
                    },
                    {
                        id: 12001518,
                        content: "{nickname}，本来只是想请你看一场歌剧。没想到连累你卷进了麻烦，实在抱歉……",
                        npc: 220014,
                    },
                    {
                        id: 12001519,
                        content: "没关系没关系，我们小仆从本来就是走到哪儿麻烦就跟到哪儿的体质！",
                        npc: 200002,
                    },
                    {
                        id: 12001520,
                        content: "……白，我谢谢你。",
                        npc: 100001,
                    },
                    {
                        id: 12001521,
                        content: "呵呵……那就后会有期了。",
                        npc: 220014,
                    },
                    {
                        id: 12001522,
                        content: "……对了，我对这附近不太熟悉。你们知道，有一家叫做水仙平原的酒馆该怎么走吗？",
                        npc: 220014,
                    },
                    {
                        id: 12001523,
                        content: "这白可太熟了！我们来给你带路！",
                        npc: 200002,
                    },
                    {
                        id: 12001310,
                        content: "女士，多谢你刚才出手帮助。",
                        npc: 100001,
                    },
                    {
                        id: 12001311,
                        content: "呵呵……不用这么拘谨。你可以直接称呼我的名字。",
                        npc: 210004,
                    },
                    {
                        id: 12001312,
                        content: "……止流女士？",
                        npc: 100001,
                    },
                    {
                        id: 12001313,
                        content: "女士是帝国常用的敬称吧？我至今听不惯。",
                        npc: 210004,
                    },
                    {
                        id: 12001314,
                        content: "我常年行南闯北经商，手中姑且也是有些铺子。你若是执意要加个后缀，不如叫我掌柜，听着顺耳些。",
                        npc: 210004,
                    },
                    {
                        id: 12001315,
                        content: "那……止流掌柜，您应该是在等什么人吧？我们在这儿，会不会打扰到您？",
                        npc: 100001,
                    },
                    {
                        id: 12001316,
                        content: "原来你在意的是这个呀，真可爱。",
                        npc: 210004,
                    },
                    {
                        id: 12001317,
                        content: "没关系的。那个人，大概是不会赴约了。",
                        npc: 210004,
                    },
                    {
                        id: 12001318,
                        content: "一个人观剧，也有几分冷清。今天能有你们陪着，这间包厢热闹了不少，我反而应该向你们道谢才是。",
                        npc: 210004,
                    },
                    {
                        id: 12001319,
                        content: "小仆从，竟然有人会辜负这么有钱又出手大方的漂亮姐姐，还让她伤心……真是太没眼光了！",
                        npc: 200002,
                    },
                    {
                        id: 12001320,
                        content: "在我的家乡，人与人之间的相遇相识被称为“缘分”。缘分来之不易，既然出现了就不如珍惜，你觉得呢？",
                        npc: 210004,
                    },
                ],
            },
            {
                id: 12000209,
                dialogues: [
                    {
                        id: 12001524,
                        content: "回来了？剧看得还满意吗？",
                        npc: 200003,
                    },
                    {
                        id: 12001525,
                        content: "卡米拉——猜猜白和{nickname}带了什么人回来？你绝对想不到！",
                        npc: 200002,
                    },
                    {
                        id: 12001526,
                        content: "……怎么是你？",
                        npc: 200003,
                    },
                    {
                        id: 12001527,
                        content: "没想到你们竟然误打误撞走在了一起。",
                        npc: 200003,
                    },
                    {
                        id: 12001528,
                        content: "他俩姑且都算是我的人，没给你添什么麻烦吧？",
                        npc: 200003,
                    },
                    {
                        id: 12001529,
                        content: "怎么会呢？都是很可爱的小朋友。",
                        npc: 210004,
                    },
                    {
                        id: 12001530,
                        content: "这就是你说的“难得的大客户”是吧，哼哼——你们聊你们聊，成熟又可靠的白要自己玩去了！",
                        npc: 200002,
                    },
                    {
                        id: 12001531,
                        content: "你这趟前来冰湖城，事办的怎么样了？",
                        npc: 200003,
                    },
                    {
                        id: 12001532,
                        content: "出发前，我曾卜上一卦。",
                        npc: 210004,
                    },
                    {
                        id: 12001533,
                        content: "卦象曰，由颐，厉吉，利涉大川。意思是过程看似凶险波折，但最终还是能够导向好的结果。",
                        npc: 210004,
                    },
                    {
                        id: 12001534,
                        content: "看来你有所收获，内情我就不多过问了。接下来呢，你有什么打算？",
                        npc: 200003,
                    },
                    {
                        id: 12001535,
                        content: "回程的商船几日后才会启程。在这期间，我打算顺带收购一批其他材料。或许需要在你这里叨扰一阵了。",
                        npc: 210004,
                    },
                    {
                        id: 12001536,
                        content: "说到这里……你有办事利索的狩月人能够推荐给我吗？",
                        npc: 210004,
                    },
                    {
                        id: 12001537,
                        content: "办事利索的狩月人？喏，他们俩随你差遣。正巧，他们早上还在和我抱怨没活可干呢。",
                        npc: 200003,
                    },
                    {
                        id: 12001538,
                        content: "他俩看着或许有些不靠谱，狩猎的手艺还算勉勉强强。",
                        npc: 200003,
                    },
                    {
                        id: 12001539,
                        content: "——你说谁看起来不靠谱啦？别以为白听不见！",
                        npc: 200002,
                    },
                    {
                        id: 12001540,
                        content: "呵呵，{nickname}，真好，看来我们的缘分还未中断……接下来几日，就拜托你了。",
                        npc: 210004,
                    },
                ],
            },
        ],
    },
    {
        id: 120003,
        quests: [
            {
                id: 12000301,
                dialogues: [
                    {
                        id: 12001541,
                        content: "…………哼！",
                        npc: 200002,
                    },
                    {
                        id: 12001542,
                        content: "今天这是怎么了，气鼓鼓的一张脸。",
                        npc: 100001,
                    },
                    {
                        id: 12001543,
                        content:
                            "哈哈，你来之前，咱们的小白和老约翰突然对当今陛下是谁争执了起来，被激得打起了赌，最后毫无意外地输了十个铜币。",
                        npc: 220019,
                    },
                    {
                        id: 12001544,
                        content: "……呜，怎么能这样看不起本魔王！不信你看这张报纸——这里写得清清楚楚，是“克拉伏瓦皇帝陛下”！",
                        npc: 200002,
                    },
                    {
                        id: 12001545,
                        content: "（白不由分说，把手里的报纸塞到你的怀里。）",
                    },
                    {
                        id: 12001546,
                        content: "哈哈哈哈……小白，你仔细看看标题，那是人家的连载小说啊！",
                        npc: 220019,
                    },
                    {
                        id: 12001547,
                        content: "（你随手翻开了眼前的报纸。突然，角落里的一则寻物启事牢牢地吸引住了你的视线。）",
                    },
                    {
                        id: 12001548,
                        content: "……！",
                        npc: 100001,
                    },
                    {
                        id: 12001549,
                        content: "《寻物启事》",
                    },
                    {
                        id: 12001556,
                        content: "我弄丢了一把剑，那是一把很珍贵的剑，我和我的至亲走散了，失散时{性别：他|她}身上正带着这把剑。",
                    },
                    {
                        id: 12001557,
                        content: "请知道这把剑消息的人于今日午夜在广场前的红色电话亭处进行归还，必有重酬……",
                    },
                    {
                        id: 12001550,
                        content: "小仆从，你在盯着看什么呀？让白也瞧瞧！",
                        npc: 200002,
                    },
                    {
                        id: 12001551,
                        content: "咦，这把剑瞅着怎么有点眼熟？好像在哪里见过的样子……",
                        npc: 200002,
                    },
                    {
                        id: 12001552,
                        content: "剑上的纹路……啊，白想起来了，这不是小仆从的那把“稀世神兵”嘛！",
                        npc: 200002,
                    },
                    {
                        id: 12001553,
                        content:
                            "今日午夜归还……发布这则寻物启事的人怎么这么傻，万一没被看到，这个人岂不是要在电话亭里枯等一夜。你说是吧，小仆从？",
                        npc: 200002,
                    },
                    {
                        id: 12001554,
                        content: "……小仆从，你怎么突然这么安静？喂、喂……你怎么了？",
                        npc: 200002,
                    },
                    {
                        id: 12001555,
                        content: "呃、哦……我突然有点不舒服，先回去休息了……",
                        npc: 100001,
                    },
                ],
            },
            {
                id: 12000302,
                dialogues: [
                    {
                        id: 12012101,
                        content: "两位小朋友，迷路啦？这里可不是你们该来的地方。快回去找你们的妈妈吧。",
                        npc: 210008,
                    },
                    {
                        id: 12012102,
                        content: "白和{nickname}才不是什么小朋友！放轻松，大家都是自己人。",
                        npc: 200002,
                    },
                    {
                        id: 12012103,
                        content: "自己人……我瞅着怎么面生呢？",
                        npc: 210008,
                    },
                    {
                        id: 12012104,
                        content:
                            "不是说，佩着挂坠从洞窟里走出来，就能成为自己人了嘛？我和你讲，现在洞窟里漫山遍野的都是玄色狴犴，我们费了好大的劲才过来呢。",
                        npc: 200002,
                    },
                    {
                        id: 12012105,
                        content: "理是这个理。恕我眼拙，您二位的挂坠在哪儿……？",
                        npc: 210008,
                    },
                    {
                        id: 12012106,
                        content: "咦——它怎么不见了？！！",
                        npc: 200002,
                    },
                    {
                        id: 12012107,
                        content: "难道是刚刚和煜明一起对付狴犴时，不小心落在了某处……",
                        npc: 100001,
                    },
                    {
                        id: 12012108,
                        content: "煜明？这名字我听过——这不是鹰爪孙吗？！",
                        npc: 210008,
                    },
                    {
                        id: 12012109,
                        content: "哎哟喂，是我有眼不识泰山了。不知两位是哪路人马，有这兴致过来。莫非是——钓鱼执法？！",
                        npc: 210008,
                    },
                    {
                        id: 12012110,
                        content: "我们这里都是小本生意，没什么值得您惦记的。",
                        npc: 210008,
                    },
                    {
                        id: 12012111,
                        content: "您误会了。我们是百年春止流掌柜的朋友，受托来这里办事。",
                        npc: 100001,
                    },
                    {
                        id: 12012112,
                        content: "您认识止流止掌柜，我还认识这朗朗青天白龙神君呢！仅凭一张嘴说的，谁不会？",
                        npc: 210008,
                    },
                    {
                        id: 12012113,
                        content: "不用再多废话了。兄弟们，风紧，扯乎——",
                        npc: 210008,
                    },
                    {
                        id: 12012114,
                        content: "怎、怎么办，小仆从？感觉今天做什么都不顺利，这就是华胥俗称的“点背”嘛！",
                        npc: 200002,
                    },
                    {
                        id: 12012115,
                        content: "只能在这附近转转，看看有没有机会见到那位虬先生了。",
                        npc: 100001,
                    },
                    {
                        id: 12012201,
                        content: "你——简直欺人太甚！！",
                        npc: 210011,
                    },
                    {
                        id: 12012202,
                        content: "小仆从，对面好像起了什么争执！我们赶紧过去看看热闹！",
                        npc: 200002,
                    },
                ],
            },
            {
                id: 12000303,
                dialogues: [
                    {
                        id: 12001701,
                        content: "痛痛痛痛痛……",
                        npc: 200002,
                    },
                    {
                        id: 12001702,
                        content: "……白，你怎么在这里？",
                        npc: 100001,
                    },
                    {
                        id: 12001703,
                        content: "白怎么会在这里……啊，对了！",
                        npc: 200002,
                    },
                    {
                        id: 12001704,
                        content: "想偷偷溜出去是吧？一切都瞒不过魔王大人锃亮的眼睛！",
                        npc: 200002,
                    },
                    {
                        id: 12001705,
                        content: "看你今天一整天魂都丢了的样子，连晚饭都没吃几口，白一眼就看穿了。",
                        npc: 200002,
                    },
                    {
                        id: 12001706,
                        content: "想丢下本魔王大人自己一个人去冒险？没门！",
                        npc: 200002,
                    },
                    {
                        id: 12001707,
                        content: "……我不是故意不带你。只是，这次可能会惹到海伯利亚的士兵，我不能为了自己的事把你卷进去。",
                        npc: 100001,
                    },
                    {
                        id: 12001708,
                        content: "那个……好像咱们也不是第一次招惹海伯利亚的士兵了吧？",
                        npc: 200002,
                    },
                    {
                        id: 12001709,
                        content: "呃，好像也是。",
                        npc: 100001,
                    },
                    {
                        id: 12001710,
                        content: "总之！你是我罩着的人，小仆从的事情，当然也是本魔王的事情。",
                        npc: 200002,
                    },
                ],
            },
            {
                id: 12000304,
                dialogues: [
                    {
                        id: 12001720,
                        content: "夜间的冰湖城广场空无一人。",
                    },
                    {
                        id: 12001721,
                        content: "一阵阴森的风吹过，纷纷吹起了广场上的垃圾。",
                    },
                    {
                        id: 12001722,
                        content: "呼……呀！有鬼！",
                        npc: 200002,
                    },
                    {
                        id: 12001723,
                        content: "什么嘛，原来只是垃圾……谁随手乱扔，素质这么低！该让垃圾桶公主好好教育他一顿！",
                        npc: 200002,
                    },
                    {
                        id: 12001724,
                        content: "你还好吗，白？你是不是困了？",
                        npc: 100001,
                    },
                    {
                        id: 12001725,
                        content: "为了把你抓个正着，白今天可是强忍着瞌睡，在门口等了好久好久——",
                        npc: 200002,
                    },
                    {
                        id: 12001726,
                        content: "好好，那还真是多谢你了。",
                        npc: 100001,
                    },
                    {
                        id: 12001727,
                        content: "小仆从，你快看！红色电话亭里好像站着一个人影，那是你要找的人吗？",
                        npc: 200002,
                    },
                    {
                        id: 12001728,
                        content: "背影看起来很像她……但是，我不敢确定……",
                        npc: 100001,
                    },
                    {
                        id: 12001729,
                        content: "总之，本次冒险的目的地正式宣布为眼前的红色电话亭啦。是不是你在找的人，去看看就知道了！",
                        npc: 200002,
                    },
                    {
                        id: 12001730,
                        content: "准备好了吗？要上了哟！",
                        npc: 200002,
                    },
                    {
                        id: 12001720,
                        content: "夜间的冰湖城广场空无一人。",
                    },
                    {
                        id: 12001721,
                        content: "一阵阴森的风吹过，纷纷吹起了广场上的垃圾。",
                    },
                    {
                        id: 12001722,
                        content: "呼……呀！有鬼！",
                        npc: 200002,
                    },
                    {
                        id: 12001723,
                        content: "什么嘛，原来只是垃圾……谁随手乱扔，素质这么低！该让垃圾桶公主好好教育他一顿！",
                        npc: 200002,
                    },
                    {
                        id: 12001724,
                        content: "你还好吗，白？你是不是困了？",
                        npc: 100001,
                    },
                    {
                        id: 12001725,
                        content: "为了把你抓个正着，白今天可是强忍着瞌睡，在门口等了好久好久——",
                        npc: 200002,
                    },
                    {
                        id: 12001726,
                        content: "好好，那还真是多谢你了。",
                        npc: 100001,
                    },
                    {
                        id: 12001727,
                        content: "小仆从，你快看！红色电话亭里好像站着一个人影，那是你要找的人吗？",
                        npc: 200002,
                    },
                    {
                        id: 12001728,
                        content: "背影看起来很像她……但是，我不敢确定……",
                        npc: 100001,
                    },
                    {
                        id: 12001729,
                        content: "总之，本次冒险的目的地正式宣布为眼前的红色电话亭啦。是不是你在找的人，去看看就知道了！",
                        npc: 200002,
                    },
                    {
                        id: 12001730,
                        content: "准备好了吗？要上了哟！",
                        npc: 200002,
                    },
                ],
            },
            {
                id: 12000305,
                dialogues: [
                    {
                        id: 12001737,
                        content: "英格丽德，汇报执勤情况。",
                        npc: 220023,
                    },
                    {
                        id: 12001738,
                        content: "截止目前，未出现符合目标特征的对象。汇报完毕。",
                        npc: 220022,
                    },
                    {
                        id: 12001739,
                        content: "了解。还有其他异常吗？",
                        npc: 220023,
                    },
                    {
                        id: 12001740,
                        content: "四分钟前，有一个皎皎之民来讨要硬币，被我呵斥走了。",
                        npc: 220022,
                    },
                    {
                        id: 12001741,
                        content: "——你说什么？你就放那个皎皎走了？！",
                        npc: 220023,
                    },
                    {
                        id: 12001742,
                        content: "……有、有问题吗，长官？目标是外表年龄约十八岁的卡戎{性别：少年|少女}，应当不可能伪装成皎皎族……",
                        npc: 220022,
                    },
                    {
                        id: 12001743,
                        content:
                            "愚蠢！一个大活人是不可能变成皎皎，但{性别：他|她}难道就不能找个帮手？目标可能正躲在附近，伺机观察这里的情况。",
                        npc: 220023,
                    },
                    {
                        id: 12001744,
                        content: "全体听令，立马封锁广场周围区域，控制住每一个活物！今晚，连一只夜鸮也不许飞出冰湖城的城墙！",
                        npc: 220023,
                    },
                    {
                        id: 12001785,
                        content: "皎皎气呼呼地跑走了。",
                    },
                    {
                        id: 12012701,
                        content: "有朋自远方来，幸甚至哉。",
                        npc: 210012,
                    },
                    {
                        id: 12012702,
                        content: "你们黑市人，平时就是这样行事吗？",
                        npc: 100001,
                    },
                    {
                        id: 12012703,
                        content: "小友恰好撞见了比较极端的个例，但我并不打算否认这种生存之道。",
                        npc: 210012,
                    },
                    {
                        id: 12012704,
                        content: "竟然承认了……无耻！",
                        npc: 200002,
                    },
                    {
                        id: 12012705,
                        content: "哈哈……要说到礼义廉耻，我倒是有一个问题想要请教。",
                        npc: 210012,
                    },
                    {
                        id: 12012706,
                        content: "昔日华胥一隅，有群羊，又有一猛虎。猛虎捕食群羊，羔羊为虎所食，不得安生。",
                        npc: 210012,
                    },
                    {
                        id: 12012707,
                        content: "此时一侠义之士路过，羔羊便向那侠士哭求，请他垂怜庇护，令羊群免受求生之苦。",
                        npc: 210012,
                    },
                    {
                        id: 12012708,
                        content:
                            "侠士可怜羔羊羸弱，便回应羊群祈愿，尽逐当地猛兽。又去了羔羊顶角，使它们不至于误伤同类。侠义之士离去后，羊群睦然而居，繁衍壮大。",
                        npc: 210012,
                    },
                    {
                        id: 12012709,
                        content: "然，多年后一日，羊群中再次闯入一只新的猛虎。羊群折了角，逃跑的功夫又日久生疏，最后全数夭于虎口。",
                        npc: 210012,
                    },
                    {
                        id: 12012710,
                        content: "这个故事里，你们认为何者犯了<H>最大的错误</>呢？",
                        npc: 210012,
                    },
                    {
                        id: 12001731,
                        content: "……什么人？！",
                        npc: 220022,
                    },
                    {
                        id: 12001732,
                        content: "大姐姐，可以借我一枚硬币吗？",
                        npc: 200002,
                    },
                    {
                        id: 12001733,
                        content: "我想买一杯热腾腾的蜂蜜牛奶，但是出门时摔了一跤……硬币滚进下水道里了。",
                        npc: 200002,
                    },
                    {
                        id: 12001734,
                        content: "去去去，哪里跑来的皎皎之民。",
                        npc: 220022,
                    },
                    {
                        id: 12001735,
                        content: "我在执行公务，别碍事！",
                        npc: 220022,
                    },
                    {
                        id: 12001736,
                        content: "……什么嘛，姐姐真小气。不给就不给，我去别的地方找硬币！",
                        npc: 200002,
                    },
                ],
            },
            {
                id: 12000306,
                dialogues: [
                    {
                        id: 12001745,
                        content: "怎么样，小仆从？——要是没有英勇又机智的本魔王大人，你就要踩进他们准备的陷阱中啦。",
                        npc: 200002,
                    },
                ],
            },
            {
                id: 12000307,
                dialogues: [
                    {
                        id: 12013201,
                        content: "你……扶疏姐姐，你怎么了？！",
                        npc: 200002,
                    },
                    {
                        id: 12013202,
                        content: "……无妨。",
                        npc: 210013,
                    },
                    {
                        id: 12013203,
                        content: "以自身气血化如甘霖，引渡患者体内病秽伤痛凝成的浊气，则为<H>枯荣</>。",
                        npc: 210013,
                    },
                    {
                        id: 12013204,
                        content: "自烛阴之灾以来，伤者众多，我连日使用枯荣之法，气血周转不济，从而失态了，请二位勿要介怀。",
                        npc: 210013,
                    },
                    {
                        id: 12013205,
                        content: "自身气血……小仆从，这又是什么意思？",
                        npc: 200002,
                    },
                    {
                        id: 12013206,
                        content: "扶疏，你的意思是……枯荣之法就是以命换命？",
                        npc: 100001,
                    },
                    {
                        id: 12013207,
                        content: "你的家人……不会很担心吗？",
                        npc: 100001,
                    },
                    {
                        id: 12013208,
                        content: "……",
                        npc: 210013,
                    },
                    {
                        id: 12013209,
                        content: "家中传下了排浊化清的秘法，只要休憩片刻就好。",
                        npc: 210013,
                    },
                    {
                        id: 12013210,
                        content: "哎呀气死我了，那个叫煜明的家伙也是，华胥的卡戎怎么都不把自己的身体当一回事……简直是一个模子刻出来的！",
                        npc: 200002,
                    },
                    {
                        id: 12013211,
                        content: "枯荣流转，月盈而亏。祛除病痛，自然也要付出等量的代价。",
                        npc: 210013,
                    },
                    {
                        id: 12013212,
                        content: "…………",
                        npc: 100001,
                    },
                    {
                        id: 12013213,
                        content: "我要即刻出发寻找治愈这姑娘的法子，先失陪了。你们且去忙碌，若你们想看望她，可往北部杏林中的枯荣阁寻我。",
                        npc: 210013,
                    },
                    {
                        id: 12002100,
                        content: "假装潜行玩法",
                    },
                ],
            },
            {
                id: 12000308,
                dialogues: [
                    {
                        id: 12001762,
                        content: "什么人？停车！",
                        npc: 220025,
                    },
                    {
                        id: 12001763,
                        content: "上头下了命令，今晚一个可疑人士都不能放行，麻烦你们配合一下。",
                        npc: 220025,
                    },
                    {
                        id: 12001801,
                        content: "好啦，现在可以随意讨论了。不过，注意控制表情，那些士兵还在后头尽职尽责地跟着呢。",
                        npc: 220014,
                    },
                    {
                        id: 10010101,
                        content: "贝蕾，我……",
                        npc: 100001,
                    },
                    {
                        id: 12001753,
                        content: "其他的逃脱路线都被封堵了，只剩下那边的井盖没有人看守……",
                        npc: 100001,
                    },
                    {
                        id: 12001754,
                        content: "呼、呼……那个，咱们，这是要第几次……钻下水道了……先、让我、歇歇……",
                        npc: 200002,
                    },
                    {
                        id: 12001755,
                        content: "你若是逃入那处井盖，却是顺了他们的心意。",
                        npc: 210004,
                    },
                    {
                        id: 12001756,
                        content:
                            "华胥兵法有言，“围师必阙，虚留生路”。意思是，制造一条虚假的生路，让敌人自投罗网——此刻，指不定有多少帝国兵正潜伏在下水道中呢。",
                        npc: 210004,
                    },
                    {
                        id: 12001757,
                        content: "来，上车。",
                        npc: 210004,
                    },
                    {
                        id: 12001758,
                        content: "止流女士——不，止流掌柜，你怎么会在这里？",
                        npc: 100001,
                    },
                    {
                        id: 12001759,
                        content: "本来是特意找你道别的……现在看来，倒是没有这个必要了。",
                        npc: 210004,
                    },
                    {
                        id: 12001760,
                        content: "你是要和我继续在这里寒暄呢，还是要在他们抓到你之前，赶紧逃出这里呢？",
                        npc: 210004,
                    },
                    {
                        id: 12001761,
                        content: "……我明白了！",
                        npc: 100001,
                    },
                ],
            },
        ],
    },
    {
        id: 120101,
        quests: [
            {
                id: 12010104,
                dialogues: [
                    {
                        id: 12010130,
                        content: "烤鱿鱼还是香喷喷的小银鱼干，唔，好难选哦……",
                        npc: 200002,
                    },
                    {
                        id: 12010131,
                        content: "老板，一样来一份好了！多来点酱汁！",
                        npc: 200002,
                    },
                    {
                        id: 12010113,
                        content: "针头线脑、香脂香囊，我这儿样样齐全。客官，要来一份吗？",
                        npc: 210031,
                    },
                    {
                        id: 12010114,
                        content: "看中了什么？直接拿吧，我来付账。",
                        npc: 210004,
                    },
                    {
                        id: 12010115,
                        content: "你们在华胥的所有开销都由我包揽了，尽管花，让他们记在百年春的账上就行。",
                        npc: 210004,
                    },
                ],
            },
            {
                id: 12010105,
                dialogues: [
                    {
                        id: 12010132,
                        content: "咦，白跑到哪里去了……",
                        npc: 100001,
                    },
                ],
            },
            {
                id: 12010107,
                dialogues: [
                    {
                        id: 12010301,
                        content: "幸好歹人已经被截获了……他竟然跑到这里来，惊扰到了您。",
                        npc: 210032,
                    },
                    {
                        id: 12010302,
                        content: "杜立，不用急。调顺了气息再说话。",
                        npc: 210004,
                    },
                    {
                        id: 12010303,
                        content: "你迟来的理由，和这个歹徒有关吗？",
                        npc: 210004,
                    },
                    {
                        id: 12010304,
                        content: "……确是如此。",
                        npc: 210032,
                    },
                    {
                        id: 12010305,
                        content: "最近<W>烛阴之灾</>势头愈烈。部分织星客对禁行令不满，绕开我们百年春，私自从外界雇了护卫，欲与险境一搏。",
                        npc: 210032,
                    },
                    {
                        id: 12010306,
                        content: "结果找来了个品行不端的，就有了现在这个结果。",
                        npc: 210032,
                    },
                    {
                        id: 12010307,
                        content: "我赶来前，商人们还在为这事争执不休，吵得百年春前那叫一个沸反盈天。恐怕还需要您赶紧出面，从中调解一下。",
                        npc: 210032,
                    },
                    {
                        id: 12010308,
                        content: "嗯，大致情况我了解了。",
                        npc: 210004,
                    },
                    {
                        id: 12010309,
                        content: "抱歉，{nickname}……总有这些事务缠身。看来能陪伴你的时间已经结束了。",
                        npc: 210004,
                    },
                ],
            },
            {
                id: 12010108,
                dialogues: [
                    {
                        id: 12010451,
                        content: "跟我来！诫碑在这个方向哦！",
                        npc: 210003,
                    },
                    {
                        id: 12010452,
                        content: "锦鲤皎皎，他们刚刚提到的烛什么阴之灾……是什么呀？",
                        npc: 200002,
                    },
                    {
                        id: 12010453,
                        content: "唔，简而言之，就是一个害得大家没法好好做生意的很坏很坏的灾害。",
                        npc: 210003,
                    },
                    {
                        id: 12010454,
                        content: "不过你们放心，止流大当家已经在着手解决了！只要大当家一出手，事情都会咻的一下好起来的！",
                        npc: 210003,
                    },
                ],
            },
            {
                id: 12010110,
                dialogues: [
                    {
                        id: 12010500,
                        content: "一直听你们说百年春，那里到底是什么样的地方哇？",
                        npc: 200002,
                    },
                    {
                        id: 12010501,
                        content: "那可是织星客在烟津渡的最大据点，囊括了来自五湖四海的商品，可气派啦。",
                        npc: 210003,
                    },
                    {
                        id: 12010502,
                        content: "说起来，开旅游团好像也是一门不错的生意经……没错没错，赶紧记在小本本上。",
                        npc: 210003,
                    },
                ],
            },
            {
                id: 12010112,
                dialogues: [
                    {
                        id: 12010533,
                        content: "喂喂，刚刚打起来之后，你怎么一溜烟地就跑不见了。",
                        npc: 200002,
                    },
                    {
                        id: 12010534,
                        content: "毕竟我手无缚鸡之力……帮不上什么忙嘛。但是我有在一旁为你们摇旗呐喊哦！",
                        npc: 210003,
                    },
                    {
                        id: 12010535,
                        content: "这样说起来，第一次遇到白的时候，好像也发生过类似的事情呢。",
                        npc: 100001,
                    },
                    {
                        id: 12010536,
                        content: "噗嗤，原来白魔王大人也这么不拘小节。",
                        npc: 210003,
                    },
                    {
                        id: 12010537,
                        content: "小、小仆从，你不要搞错了，那明明是在考验你的实力……",
                        npc: 200002,
                    },
                ],
            },
        ],
    },
    {
        id: 120102,
        quests: [
            {
                id: 12010203,
                dialogues: [
                    {
                        id: 12010617,
                        content: "来，最后一段路啦！",
                        npc: 210003,
                    },
                ],
            },
            {
                id: 12010205,
                dialogues: [
                    {
                        id: 12010801,
                        content: "你们来了？玩得怎么样？",
                        npc: 210004,
                    },
                    {
                        id: 12010802,
                        content: "嗯，大家都很热情好客。华胥的风光和人们，都和冰湖城大不一样……",
                        npc: 100001,
                    },
                    {
                        id: 12010803,
                        content: "刚刚这里发生的事情我们都看到了！不愧是止流姐姐，三下五除二就把那些人摆平了！",
                        npc: 200002,
                    },
                    {
                        id: 12010804,
                        content: "呵呵，做生意就是琢磨如何和人打交道。这种小场面，我早就习以为常了。反倒是在冰湖城和你们结交，更为难得。",
                        npc: 210004,
                    },
                    {
                        id: 12010805,
                        content: "好啦，该切入正题了。我这次雇佣你们，是为了解决<H>烛阴之灾</>而做准备。至于这烛阴之灾是何物……",
                        npc: 210004,
                    },
                    {
                        id: 12010806,
                        content: "我们已经有所了解啦！",
                        npc: 200002,
                    },
                    {
                        id: 12010807,
                        content: "哦？说来听听。",
                        npc: 210004,
                    },
                    {
                        id: 12010808,
                        content: "过来的路上，我们遭遇了玄色狴犴的袭击。幸好有位过路的行商相助，我们击退了它，没有受伤。",
                        npc: 100001,
                    },
                    {
                        id: 12010809,
                        content:
                            "行商姐姐告诉我们，就是这个什么烛阴之灾，会诞生很多像玄色狴犴一样的坏东西，然后它们四处咬人，让大家的日子很难过！",
                        npc: 200002,
                    },
                    {
                        id: 12010810,
                        content: "不错。玄色狴犴出现之前，你们可曾看到或听到什么异象？",
                        npc: 210004,
                    },
                    {
                        id: 12010811,
                        content: "好像……从虚空中传来过某种异兽吼叫的声音。",
                        npc: 100001,
                    },
                    {
                        id: 12010812,
                        content: "是了。那便是数载前被封印的恶蛟，如今正在复苏中的<H>烛阴</>发出的嘶吼。",
                        npc: 210004,
                    },
                    {
                        id: 12010813,
                        content:
                            "烛阴是华胥远古传说中，与白龙神君相敌对的恶神。它失智、狂乱的力量泄露而出，使恶兽横行。部分区域受其影响，也变得草木不生。",
                        npc: 210004,
                    },
                    {
                        id: 12010814,
                        content: "百年之前，在烟津渡区域，烛阴之灾初显端倪。时人只能仓皇应对，损失惨重，集结了众多人力物力才将其降服。",
                        npc: 210004,
                    },
                    {
                        id: 12010815,
                        content: "如今，烛阴再度从封印中复苏。这次，我打算未雨绸缪，早做准备，避免重蹈上次的覆辙。",
                        npc: 210004,
                    },
                    {
                        id: 12010816,
                        content: "哇，对手真的是一条龙耶，魔王大人已经热血沸腾起来了！那需要我和小仆从做什么呢？",
                        npc: 200002,
                    },
                    {
                        id: 12010817,
                        content: "华胥禁武。纵是走南闯北的织星客，也少有人精通防身的一招半式。",
                        npc: 210004,
                    },
                    {
                        id: 12010818,
                        content:
                            "所以，这次我要委托你们的，便是孤身深入已彻底浊化的尘漠石海，将其中的<W>三片烛阴鳞</>取来，好为重新封印这个孽兽做准备。",
                        npc: 210004,
                    },
                    {
                        id: 12010819,
                        content: "止流掌柜，可以问您一个问题吗？",
                        npc: 100001,
                    },
                    {
                        id: 12010820,
                        content: "这么重要的任务，您为何放心交给我一个名不经传的外来者去完成？",
                        npc: 100001,
                    },
                    {
                        id: 12010821,
                        content: "我只是一个涉世未深的狩月人。比我身手更好的想必还有很多。",
                        npc: 100001,
                    },
                    {
                        id: 12010822,
                        content: "那时候在剧院，当我触碰香炉时，烟迹像是被吸引了一样，朝我倾斜……您委托我，和这件事有关系吗？",
                        npc: 100001,
                    },
                    {
                        id: 12010823,
                        content: "……你却是敏锐。",
                        npc: 210004,
                    },
                    {
                        id: 12010824,
                        content:
                            "相信有人告诫过你了吧，你的能力很特殊，也很珍贵。而珍贵之物往往会引来觊觎。稍有不慎，就会为持有者招致灾难。",
                        npc: 210004,
                    },
                    {
                        id: 12010825,
                        content: "烛阴鳞并非常规手段可以采摘。需要一种高浓度活性物质与之共鸣，软化其束缚。",
                        npc: 210004,
                    },
                    {
                        id: 12010826,
                        content:
                            "我此次前往冰湖城，本是为了试试帝国炼金院的高纯度月髓液是否可以生效，却无意间发现了你的存在——弥足珍贵的“和鸣者”。",
                        npc: 210004,
                    },
                    {
                        id: 12010827,
                        content: "我需要借助你的能力去软化烛阴鳞。当然，你随时拥有拒绝的权利。一切还是以你的安危为最优先。",
                        npc: 210004,
                    },
                    {
                        id: 12010828,
                        content: "不。止流掌柜，感谢您的答案。这个任务，我接下了。",
                        npc: 100001,
                    },
                    {
                        id: 12010829,
                        content: "……你有没有想过，我对你伸出援手，或许也是看到了你的价值，从而别有用心？",
                        npc: 210004,
                    },
                    {
                        id: 12010830,
                        content: "我想过，但这改变不了您帮助过我的事实。况且，我也有自己的私心。",
                        npc: 100001,
                    },
                    {
                        id: 12010831,
                        content: "我在寻找自己的家人，但我一个人的力量过于渺小。为了达到这个目的，我会抓住一切可以凭借的外力。",
                        npc: 100001,
                    },
                    {
                        id: 12010832,
                        content: "如果帮助您可以换取未来某些时刻的援手，我想这是一笔相当划算的交易。",
                        npc: 100001,
                    },
                    {
                        id: 12010833,
                        content: "更何况，您当初帮我解围之时，我对您而言只是一个随处可见的路人。您帮了我，我也想为您做点什么。",
                        npc: 100001,
                    },
                    {
                        id: 12010834,
                        content: "呵呵……话都被你说尽了，我却没什么可说的了。看来假以时日，你也会成为一个优秀的“商人”。",
                        npc: 210004,
                    },
                    {
                        id: 12010835,
                        content: "在你出发前，那边桌子上有给你准备的盘缠。随意花，不够了再来向我要。",
                        npc: 210004,
                    },
                ],
            },
            {
                id: 12010206,
                dialogues: [
                    {
                        id: 12010901,
                        content: "让白掂量掂量……哇，沉甸甸的钱包，这么多！止流老板太大气了！",
                        npc: 200002,
                    },
                    {
                        id: 12010902,
                        content: "只是些小钱罢了。你们放心支配，不必拘谨。",
                        npc: 210004,
                    },
                    {
                        id: 12010903,
                        content: "采摘烛阴鳞需要用到<W>某种特制的工具</>，我先前托一些……道上的朋友准备了。",
                        npc: 210004,
                    },
                    {
                        id: 12010904,
                        content: "但由于玄色狴犴肆虐，通讯断绝，至今还未送来。可能需要你亲自去取。",
                        npc: 210004,
                    },
                ],
            },
            {
                id: 12010208,
                dialogues: [
                    {
                        id: 12011101,
                        content: "喂——喂——有人吗？",
                        npc: 200002,
                    },
                    {
                        id: 12011102,
                        content: "看，小仆从！这里黑布隆冬的，说话还会有回音耶。你会怕黑吗？",
                        npc: 200002,
                    },
                    {
                        id: 12011103,
                        content: "不怕。但是我们说话声音最好压低些，当心引来什么奇怪的东西。",
                        npc: 100001,
                    },
                ],
            },
            {
                id: 12010209,
                dialogues: [
                    {
                        id: 12011501,
                        content: "应天尉就是华胥的卫戍部队吧！你们有工资拿吗，待遇怎么样呀？",
                        npc: 200002,
                    },
                    {
                        id: 12011502,
                        content: "……",
                        npc: 210007,
                    },
                    {
                        id: 12011503,
                        content: "好啦好啦。白知道了，白不问这些了。",
                        npc: 200002,
                    },
                    {
                        id: 12011504,
                        content: "我为应天尉，只愿济苍生，安黎元，并非为那些身外俗物。",
                        npc: 210007,
                    },
                    {
                        id: 12011505,
                        content: "……小仆从你听，就是不发工资的意思咯？比帝国还抠门！",
                        npc: 200002,
                    },
                ],
            },
            {
                id: 12010211,
                dialogues: [
                    {
                        id: 12012001,
                        content: "这些孽畜，总算是尽数清缴了。多谢两位施以援手。",
                        npc: 210007,
                    },
                    {
                        id: 12012002,
                        content: "抱歉，先前失了礼数，尚未互通姓名。在下煜明，请问你们是？",
                        npc: 210007,
                    },
                    {
                        id: 12012003,
                        content: "我是外乡来的狩月人{nickname}。这位是……",
                        npc: 100001,
                    },
                ],
            },
            {
                id: 12010212,
                dialogues: [
                    {
                        id: 12012033,
                        content: "就这样，大功告成！",
                        npc: 200002,
                    },
                    {
                        id: 12012034,
                        content: "加上这些树叶的伪装，就算有人经过也不会轻易发现他。可以让他在这里安静疗伤。",
                        npc: 100001,
                    },
                    {
                        id: 12012035,
                        content: "不愧是本魔王大人的杰作——这里应该再添两笔，嘻嘻！",
                        npc: 200002,
                    },
                    {
                        id: 12012036,
                        content: "这个皎皎涂鸦，别人一眼就知道是你干的。要是被找上门来，可别怪我不帮你说话。",
                        npc: 100001,
                    },
                    {
                        id: 12012037,
                        content: "时候不早了，我们赶紧去黑市吧。",
                        npc: 100001,
                    },
                    {
                        id: 12012040,
                        content: "小仆从，这里看起来很隐蔽，我们就把他藏在这个地方吧！",
                        npc: 200002,
                    },
                ],
            },
            {
                id: 12010252,
                dialogues: [
                    {
                        id: 12011702,
                        content: "那家伙，虽然说话冷冰冰的，但是心地还不错嘛。",
                        npc: 200002,
                    },
                    {
                        id: 12011703,
                        content: "不知道仅凭他一个人，能否对付聚集在这山洞中的玄色狴犴。",
                        npc: 100001,
                    },
                    {
                        id: 12011704,
                        content: "嗷呜——！！",
                        npc: 100001,
                    },
                    {
                        id: 12011705,
                        content: "喂，小仆从！后面那么大的动静，是怎么回事！",
                        npc: 200002,
                    },
                    {
                        id: 12011706,
                        content: "听起来，好像是狴犴齐聚的{性别：吼叫|吼声}，数目应该不少。",
                        npc: 100001,
                    },
                    {
                        id: 12011707,
                        content: "那、那个，小仆从，我觉得……",
                        npc: 200002,
                    },
                    {
                        id: 12011708,
                        content: "我明白。黑市晚些去也来得及，先去看看那位应天尉的情况吧。",
                        npc: 100001,
                    },
                    {
                        id: 12011701,
                        content: "出口在前方。我便护送两位到这里为止。",
                        npc: 210007,
                    },
                ],
            },
            {
                id: 12010253,
                dialogues: [
                    {
                        id: 12011401,
                        content: "刚刚真是多谢你了。",
                        npc: 100001,
                    },
                    {
                        id: 12011402,
                        content: "不用，本是职责所在。",
                        npc: 210007,
                    },
                    {
                        id: 12011403,
                        content: "……职责所在？",
                        npc: 200002,
                    },
                    {
                        id: 12011404,
                        content: "唔，是卡戎，还很能打……你该不会是锦鲤皎皎提到的<H>应天尉</>吧？",
                        npc: 200002,
                    },
                    {
                        id: 12011405,
                        content: "……我奉命来此肃清玄色狴犴。如今众敌环伺，职责未尽，恕我无暇闲聊。",
                        npc: 210007,
                    },
                    {
                        id: 12011406,
                        content: "奉谁的命？我们等会儿出去好好谢谢人家！",
                        npc: 200002,
                    },
                    {
                        id: 12011407,
                        content: "大风九章，天命。",
                        npc: 210007,
                    },
                    {
                        id: 12011408,
                        content: "对哦，好像确实有这么一回事……那白和小仆从回头要狠狠地奉几根香！",
                        npc: 200002,
                    },
                    {
                        id: 12011409,
                        content: "说起来，刚刚续上的香，和玄色狴犴刚打一个照面就用完了。还真是不经用……",
                        npc: 200002,
                    },
                    {
                        id: 12011410,
                        content: "若香已散尽，以我一人之力，恐难护得二位周全。二位若无要事，还请速速离去，寻一安稳之所。",
                        npc: 210007,
                    },
                    {
                        id: 12011411,
                        content: "谢谢，不过我们有一点自保能力，不用担心。我们需要去洞窟对面办一件事，希望不会给你添麻烦。",
                        npc: 100001,
                    },
                    {
                        id: 12011412,
                        content: "洞窟对面？据我所知，那里除岸滩搁浅的沉船残阙外，别无旁物。",
                        npc: 210007,
                    },
                    {
                        id: 12011413,
                        content: "没错，就是那处沉船黑市！白和小仆从要去那里谈一桩大生意！",
                        npc: 200002,
                    },
                    {
                        id: 12011414,
                        content: "黑市、谈生意？两位若非要与鸡鸣狗盗之辈为伍，我也无话可说。",
                        npc: 210007,
                    },
                    {
                        id: 12011415,
                        content: "怎、怎么办，小仆从？！我们好像被他误解了……",
                        npc: 200002,
                    },
                    {
                        id: 12011416,
                        content: "事情不是你想的那样。我们受止流掌柜雇佣，为了解决玄色狴犴肆虐的问题，需要去黑市取一样工具。",
                        npc: 100001,
                    },
                    {
                        id: 12011417,
                        content: "就是，才不是去做什么偷鸡摸狗的事情呢！",
                        npc: 200002,
                    },
                    {
                        id: 12011418,
                        content: "……抱歉。是我武断了。",
                        npc: 210007,
                    },
                    {
                        id: 12011419,
                        content: "话虽如此，黑市之人鱼龙混杂，你们需当心甄别，莫被欺瞒利用了。",
                        npc: 210007,
                    },
                    {
                        id: 12011420,
                        content: "此地不安全，让我护送你们过去吧。",
                        npc: 210007,
                    },
                ],
            },
            {
                id: 12010254,
                dialogues: [
                    {
                        id: 12011001,
                        content: "沿海洞窟……看来就是前面那里了。",
                        npc: 100001,
                    },
                    {
                        id: 12011002,
                        content: "白还记得和小仆从第一次探险，也是下洞窟，仿佛就像昨天刚刚发生一样！",
                        npc: 200002,
                    },
                    {
                        id: 12011003,
                        content: "谁想到转眼间，我们就来到这么远的地方，肩负这么激动人心的大使命——",
                        npc: 200002,
                    },
                    {
                        id: 12011004,
                        content: "……嗯。那次遇到了奥特赛德，敲了他一顿竹杠。赛琪……也还在。",
                        npc: 100001,
                    },
                    {
                        id: 12011005,
                        content: "白、白说错话了……",
                        npc: 200002,
                    },
                    {
                        id: 12011006,
                        content: "没关系。等我们回去，再到泪湖边去，把华胥的见闻说给她听吧。",
                        npc: 100001,
                    },
                ],
            },
        ],
    },
    {
        id: 120103,
        quests: [
            {
                id: 12010302,
                dialogues: [
                    {
                        id: 12012101,
                        content: "两位小朋友，迷路啦？这里可不是你们该来的地方。快回去找你们的妈妈吧。",
                        npc: 210008,
                    },
                    {
                        id: 12012102,
                        content: "白和{nickname}才不是什么小朋友！放轻松，大家都是自己人。",
                        npc: 200002,
                    },
                    {
                        id: 12012103,
                        content: "自己人……我瞅着怎么面生呢？",
                        npc: 210008,
                    },
                    {
                        id: 12012104,
                        content:
                            "不是说，佩着挂坠从洞窟里走出来，就能成为自己人了嘛？我和你讲，现在洞窟里漫山遍野的都是玄色狴犴，我们费了好大的劲才过来呢。",
                        npc: 200002,
                    },
                    {
                        id: 12012105,
                        content: "理是这个理。恕我眼拙，您二位的挂坠在哪儿……？",
                        npc: 210008,
                    },
                    {
                        id: 12012106,
                        content: "咦——它怎么不见了？！！",
                        npc: 200002,
                    },
                    {
                        id: 12012107,
                        content: "难道是刚刚和煜明一起对付狴犴时，不小心落在了某处……",
                        npc: 100001,
                    },
                    {
                        id: 12012108,
                        content: "煜明？这名字我听过——这不是鹰爪孙吗？！",
                        npc: 210008,
                    },
                    {
                        id: 12012109,
                        content: "哎哟喂，是我有眼不识泰山了。不知两位是哪路人马，有这兴致过来。莫非是——钓鱼执法？！",
                        npc: 210008,
                    },
                    {
                        id: 12012110,
                        content: "我们这里都是小本生意，没什么值得您惦记的。",
                        npc: 210008,
                    },
                    {
                        id: 12012111,
                        content: "您误会了。我们是百年春止流掌柜的朋友，受托来这里办事。",
                        npc: 100001,
                    },
                    {
                        id: 12012112,
                        content: "您认识止流止掌柜，我还认识这朗朗青天白龙神君呢！仅凭一张嘴说的，谁不会？",
                        npc: 210008,
                    },
                    {
                        id: 12012113,
                        content: "不用再多废话了。兄弟们，风紧，扯乎——",
                        npc: 210008,
                    },
                    {
                        id: 12012114,
                        content: "怎、怎么办，小仆从？感觉今天做什么都不顺利，这就是华胥俗称的“点背”嘛！",
                        npc: 200002,
                    },
                    {
                        id: 12012115,
                        content: "只能在这附近转转，看看有没有机会见到那位虬先生了。",
                        npc: 100001,
                    },
                ],
            },
            {
                id: 12010303,
                dialogues: [
                    {
                        id: 12012401,
                        content: "他答应得这么爽快……怕是有诈。",
                        npc: 100001,
                    },
                    {
                        id: 12012402,
                        content: "呜哇，围观的人越来越多了……可恶，踮起脚都看不到。",
                        npc: 200002,
                    },
                    {
                        id: 12012403,
                        content: "小仆从，我们挤到前排去吧。",
                        npc: 200002,
                    },
                    {
                        id: 12012509,
                        content: "由于你的及时救援，黑市商人只“蹭”到了肋下的一处伤口。\n狴犴击伤年轻姑娘以示惩戒，随后在凛风中隐去。",
                    },
                    {
                        id: 12012201,
                        content: "你——简直欺人太甚！！",
                        npc: 210011,
                    },
                    {
                        id: 12012202,
                        content: "小仆从，对面好像起了什么争执！我们赶紧过去看看热闹！",
                        npc: 200002,
                    },
                ],
            },
            {
                id: 12010304,
                dialogues: [
                    {
                        id: 12012608,
                        content: "你控制力道，将对方制服，却没有留下伤口。",
                    },
                ],
            },
            {
                id: 12010308,
                dialogues: [
                    {
                        id: 12012801,
                        content: "这个叫做虬先生的家伙总是皮笑肉不笑的，真不想和他打交道……",
                        npc: 200002,
                    },
                    {
                        id: 12012802,
                        content: "这就怕了？",
                        npc: 100001,
                    },
                    {
                        id: 12012803,
                        content: "你、你说什么呢！光之魔王大人顶天立地，怎么会有害怕的东西！",
                        npc: 200002,
                    },
                    {
                        id: 12012804,
                        content: "好啦好啦，不拿你开玩笑了。",
                        npc: 100001,
                    },
                    {
                        id: 12012805,
                        content: "他们在照顾那个女孩。还好，他们还算信守承诺。",
                        npc: 100001,
                    },
                    {
                        id: 12012806,
                        content: "诶，但是她的状态看起来不太好……我们也去看看吧！",
                        npc: 200002,
                    },
                ],
            },
            {
                id: 12010309,
                dialogues: [
                    {
                        id: 12013401,
                        content: "你们两位脚程实在是太慢了——怎么才来？我一直搁这儿盯着，瞪得我眼睛都酸了。",
                        npc: 210014,
                    },
                    {
                        id: 12013402,
                        content: "不好意思，刚刚被一些事情耽搁了。您就是公尚先生吧？",
                        npc: 100001,
                    },
                    {
                        id: 12013403,
                        content: "哎呀，怎么这么见外呢，还叫什么先生？来，快叫声师父！",
                        npc: 210014,
                    },
                    {
                        id: 12013404,
                        content: "咦——你们怎么两手空空，没带拜师礼吗？",
                        npc: 210014,
                    },
                    {
                        id: 12013405,
                        content: "……小仆从，搞技术的人，都是这么热情好客的吗？",
                        npc: 200002,
                    },
                    {
                        id: 12013406,
                        content: "那个，您是不是搞错了什么……我们是来请教这柄武器怎么使用，但好像不是来拜师的……",
                        npc: 100001,
                    },
                    {
                        id: 12013407,
                        content: "竟然如此——",
                        npc: 210014,
                    },
                    {
                        id: 12013408,
                        content: "哇啊！他好像一下子蔫了——我们是不是说了什么很打击人的话？",
                        npc: 200002,
                    },
                    {
                        id: 12013409,
                        content: "……您、您好？",
                        npc: 100001,
                    },
                    {
                        id: 12013410,
                        content: "罢了。怪我病急乱投医，一听到有人愿意继承我机枢派的衣钵，便喜不自胜，情难自禁。",
                        npc: 210014,
                    },
                    {
                        id: 12013411,
                        content: "也怪我机枢派如今式微了，换以前风光的时候，弟子排着队来拜师，那是挑花了眼也挑不过来！",
                        npc: 210014,
                    },
                    {
                        id: 12013412,
                        content:
                            "再仔细看看两位，也是一副四体不勤、天资不足的模样。对于需要精密操作、聪慧头脑、过人毅力等等集大成于一体的机括术来说，还是远远不够啊。",
                        npc: 210014,
                    },
                    {
                        id: 12013413,
                        content: "……你，你别把我们看扁了！我们今天偏要——",
                        npc: 200002,
                    },
                    {
                        id: 12013414,
                        content: "哦？你难道是想证明，自己其实很有悟性？",
                        npc: 210014,
                    },
                    {
                        id: 12013415,
                        content: "启动这牵机方枢吧。让我看看两位的资质，能否达到我们机枢派的标准。",
                        npc: 210014,
                    },
                    {
                        id: 12023811,
                        content:
                            "【系统（战斗轮盘）-引导需求】\n1.UI：引导打开军械库轮盘装备<牵机公枢>\n2.UI：引导打开探索背包启用<牵机关公枢>",
                    },
                ],
            },
            {
                id: 12010311,
                dialogues: [
                    {
                        id: 12013436,
                        content: "魂兮游离，循时索归：盈亏月下，若木长青……",
                    },
                ],
            },
            {
                id: 12010313,
                dialogues: [
                    {
                        id: 12013417,
                        content: "好难懂的名字……",
                        npc: 200002,
                    },
                    {
                        id: 12013418,
                        content: "唉，孺子不可教也——太虚，无形无色，却又四处充盈。这是鸿蒙之初的常态。",
                        npc: 210014,
                    },
                    {
                        id: 12013419,
                        content: "太虚被香所激化，乘风鼓动，便能成为大风九章运转的介质；静而不发，便能凝为浮盈空中的太虚符文。",
                        npc: 210014,
                    },
                    {
                        id: 12013420,
                        content: "但如今在这朔方之地，烛阴蒙尘，固而下之，太虚便凝成裹挟一切有形形体的尘漠。",
                        npc: 210014,
                    },
                    {
                        id: 12013421,
                        content: "而我这牵机方枢，其开天辟地之功效，便能吸收太虚，使异状归于常态。",
                        npc: 210014,
                    },
                ],
            },
            {
                id: 12010315,
                dialogues: [
                    {
                        id: 12023401,
                        content: "白，你会觉得止流掌柜最后那段话像是在转移话题，想要支开我们吗？",
                        npc: 100001,
                    },
                    {
                        id: 12023402,
                        content: "哎？！小仆从，你这样一说，好像是有点。但她为什么要这样做呢？",
                        npc: 200002,
                    },
                    {
                        id: 12023403,
                        content: "……算了。想不明白，我们先出去吧。还是即将要到手的报酬比较重要！",
                        npc: 200002,
                    },
                    {
                        id: 12023201,
                        content: "呼……终于结束了。",
                        npc: 200002,
                    },
                    {
                        id: 12023202,
                        content: "小仆从，被这么一打岔，刚刚采来的烛阴鳞还没有交给止流姐姐呢！我们赶紧回去找她吧！",
                        npc: 200002,
                    },
                ],
            },
            {
                id: 12010316,
                dialogues: [
                    {
                        id: 12013601,
                        content: "希望他们这次不要再有什么坏心思……",
                        npc: 200002,
                    },
                    {
                        id: 12013602,
                        content: "拜访扶疏还是帮助虬老板……先去哪里呢？小仆从，你决定吧！",
                        npc: 200002,
                    },
                    {
                        id: 12013501,
                        content: "您二位终于出来了——奉我们家老板的命令，冯某已在此恭候多时了。",
                        npc: 210010,
                    },
                ],
            },
            {
                id: 12010322,
                dialogues: [
                    {
                        id: 12013301,
                        content: "虽然她说休息一会儿就好，但刚才她都吐血了……真的不要紧吗？",
                        npc: 200002,
                    },
                    {
                        id: 12013302,
                        content: "如果说枯荣之术就是消耗自己的生命救人，那她这样也有一部分是因为我……",
                        npc: 100001,
                    },
                    {
                        id: 12013303,
                        content: "等我们完成止流的差事，就去看看扶疏和那个女孩的情况吧。",
                        npc: 100001,
                    },
                    {
                        id: 12013304,
                        content: "说起来，小仆从用一支笛子换取了顶级医生的诺言！这就是那个虬先生的意图吗？",
                        npc: 200002,
                    },
                    {
                        id: 12013305,
                        content: "天上不会掉面包。他给我们的好处，以后肯定也会从我们这里讨回来。",
                        npc: 100001,
                    },
                    {
                        id: 12013306,
                        content: "虬先生……我们还是对他警惕些吧。",
                        npc: 100001,
                    },
                ],
            },
            {
                id: 12010352,
                dialogues: [
                    {
                        id: 12013423,
                        content: "一套下来行云流水，动作竟如此利索！我却是没什么能再传授与你了。",
                        npc: 210014,
                    },
                    {
                        id: 12013424,
                        content: "哎？那是不是意味着小仆从学成出师了？",
                        npc: 200002,
                    },
                    {
                        id: 12013425,
                        content: "出师……也罢。当今世道，还有人愿意以我机枢派的名号为荣，不乏是一桩幸事。",
                        npc: 210014,
                    },
                    {
                        id: 12013426,
                        content:
                            "两位，我便授予你们<H>机枢派荣誉学徒</>的头衔。望你们博学笃志，切问近思。不要辜负我们机枢派上下求索、高天揽月之志。",
                        npc: 210014,
                    },
                    {
                        id: 12013427,
                        content: "高处便是烛阴鳞所在之地。以我先前教你的法子，将附着于烛阴鳞之上的尘漠尽数吸收，便可进行采摘。",
                        npc: 210014,
                    },
                    {
                        id: 12013428,
                        content: "我一把老身子骨了，不便与你们同行。你们且去吧。",
                        npc: 210014,
                    },
                ],
            },
        ],
    },
    {
        id: 120104,
        quests: [
            {
                id: 12010401,
                dialogues: [
                    {
                        id: 12013701,
                        content: "杏林环绕中的医馆……看来就是这幢建筑了。",
                        npc: 100001,
                    },
                ],
            },
            {
                id: 12010402,
                dialogues: [
                    {
                        id: 12013801,
                        content: "扶疏——我们来找你玩啦！",
                        npc: 200002,
                    },
                    {
                        id: 12013802,
                        content: "好像……没有人在家？",
                        npc: 100001,
                    },
                    {
                        id: 12013803,
                        content: "小仆从，我们先进去看看吧。",
                        npc: 200002,
                    },
                ],
            },
            {
                id: 12010403,
                dialogues: [
                    {
                        id: 12014003,
                        content: "你该不会彻夜照料她，自己没顾得上休息吧？",
                        npc: 100001,
                    },
                    {
                        id: 12014004,
                        content: "家训有言，祝由应渡尽天下苍生……有什么不妥吗？",
                        npc: 210013,
                    },
                    {
                        id: 12014005,
                        content: "当然不对劲啦！再怎么样，也要先保证自己的身体，再考虑别人吧？",
                        npc: 200002,
                    },
                    {
                        id: 12014006,
                        content: "我能以秘法排解体内浊气，所以无妨……",
                        npc: 210013,
                    },
                    {
                        id: 12014007,
                        content: "那也不行，哎呀，怎么这么犟。和你真是说不通！",
                        npc: 200002,
                    },
                    {
                        id: 120140071,
                        content: "……",
                        npc: 210013,
                    },
                    {
                        id: 120140072,
                        content: "……",
                        npc: 100001,
                    },
                    {
                        id: 12014008,
                        content: "你先前说收了我的竹笛，就答应帮我做一件事，没错吧？",
                        npc: 100001,
                    },
                    {
                        id: 12014009,
                        content: "确然。",
                        npc: 210013,
                    },
                    {
                        id: 12014010,
                        content: "那我希望你可以好好照顾自己。",
                        npc: 100001,
                    },
                    {
                        id: 12014011,
                        content: "这种无关紧要的小事，怎能算作要求。你无需为此浪费一份承诺。",
                        npc: 210013,
                    },
                    {
                        id: 12014012,
                        content:
                            "我有个相依为命的家人也是这样，她总是不把自己的身体当回事，无论是被欺负了还是受伤了，都装出一副若无其事的样子。但我不喜欢她这样。",
                        npc: 100001,
                    },
                    {
                        id: 12014013,
                        content: "想到她可能在某处遭遇着危险，或许还会因此受伤，我就会难过得睡不着觉。",
                        npc: 100001,
                    },
                    {
                        id: 12014014,
                        content: "这个世界上，肯定有某个人像我担心她一样担心你。所以，照顾好自己，不要让那个人难过。",
                        npc: 100001,
                    },
                    {
                        id: 12014015,
                        content: "……抱歉，引起你的伤心事了。",
                        npc: 210013,
                    },
                    {
                        id: 12014016,
                        content: "我明白了，我会郑重考虑你的这番话。",
                        npc: 210013,
                    },
                    {
                        id: 12014017,
                        content: "这样才对嘛！小仆从，没想到你的口才这么好，不愧是本魔王最得力的跟班！",
                        npc: 200002,
                    },
                    {
                        id: 12014018,
                        content: "……",
                        npc: 210056,
                    },
                    {
                        id: 12014019,
                        content: "她要醒了吗？！",
                        npc: 200002,
                    },
                    {
                        id: 12014020,
                        content: "阿娘，是你回来了吗……女儿好冷……",
                        npc: 210056,
                    },
                    {
                        id: 12014021,
                        content: "……看来，只是梦中呓语。",
                        npc: 210013,
                    },
                    {
                        id: 12014022,
                        content: "她的伤势现在怎么样了？",
                        npc: 100001,
                    },
                    {
                        id: 12014023,
                        content: "暂时稳定下来了。但狴犴的力量还在持续侵蚀她的筋脉，她一时半会恐怕无法醒转。",
                        npc: 210013,
                    },
                    {
                        id: 12014024,
                        content: "我在家姐的笔记中查阅到了一种名为“忘忧草”的草药。它生长于此界和彼界交汇之地，药性柔和，与狴犴的刚烈相克。",
                        npc: 210013,
                    },
                    {
                        id: 12014025,
                        content: "以忘忧草入药，或许能调和她体内的暴虐之力，让她的病情好转。",
                        npc: 210013,
                    },
                    {
                        id: 12014026,
                        content:
                            "家姐研习的药石之理与我的枯荣之术虽同为治病救人之法，但原理终是不同的。我对药理只是略略懂得一些，但如今已经是唯一的法子了。",
                        npc: 210013,
                    },
                    {
                        id: 12014027,
                        content: "那还等什么，我们赶紧走吧！",
                        npc: 200002,
                    },
                    {
                        id: 12014028,
                        content: "你们来得恰巧，我正准备醒来后就出门采药。若是来得晚一些，便只能错过了。",
                        npc: 210013,
                    },
                    {
                        id: 12014029,
                        content: "……话说回来，那个什么什么此界彼界的玄乎地方，是哪儿来着？",
                        npc: 200002,
                    },
                    {
                        id: 12014030,
                        content: "这个地方名为“虞泉”。且不论你们初来乍到，就连土生土长的华胥人，终其一生也未必去过此处呢。",
                        npc: 210013,
                    },
                    {
                        id: 12014031,
                        content: "它由华胥独特的水土蕴养出。以无处不在的香料做引，有些人临终时的执念会化为一种叫做“无由生”的特殊生灵。",
                        npc: 210013,
                    },
                    {
                        id: 12014032,
                        content: "虞泉即为无由生的栖居之地。只有心思澄澈的儿童，或是受到它们邀请的人类，能够踏入虞泉的界域。",
                        npc: 210013,
                    },
                    {
                        id: 12014033,
                        content: "听起来很神奇的样子……！那我和小仆从可以去这个地方吗？",
                        npc: 200002,
                    },
                    {
                        id: 12014034,
                        content: "自然可以。跟紧了，我为你们引路。",
                        npc: 210013,
                    },
                ],
            },
            {
                id: 12010404,
                dialogues: [
                    {
                        id: 12022510,
                        content: "我们继续前行吧。",
                        npc: 210013,
                    },
                ],
            },
            {
                id: 12010405,
                dialogues: [
                    {
                        id: 12022510,
                        content: "我们继续前行吧。",
                        npc: 210013,
                    },
                ],
            },
            {
                id: 12010406,
                dialogues: [
                    {
                        id: 12014801,
                        content: "“……我、我是木头人！你看不到我，也不能打我！”",
                        npc: 210017,
                    },
                    {
                        id: 12014401,
                        content: "——谢谢你们！",
                        npc: 210016,
                    },
                    {
                        id: 12014402,
                        content: "无由生是由执念构成的生灵。",
                        npc: 210013,
                    },
                    {
                        id: 12014403,
                        content: "这只小无由生，大约是生前偷偷跑出家门玩耍，却不慎失足坠亡。从那之后，“回家”成为了它的执念。",
                        npc: 210013,
                    },
                    {
                        id: 12014404,
                        content: "可惜它年纪尚幼，不记得家的方位。光阴荏苒，它的亲人大约也……无处可寻了。",
                        npc: 210013,
                    },
                    {
                        id: 12014405,
                        content: "哇……无由生真的是幽灵！不过，好像没有故事书里写的那么可怕！还有点可怜……",
                        npc: 200002,
                    },
                    {
                        id: 12014406,
                        content: "此处本还有两只无由生，恐怕也被尘漠波及了。去寻觅它们的踪迹吧。",
                        npc: 210013,
                    },
                    {
                        id: 12022510,
                        content: "我们继续前行吧。",
                        npc: 210013,
                    },
                ],
            },
            {
                id: 12010407,
                dialogues: [
                    {
                        id: 12022510,
                        content: "我们继续前行吧。",
                        npc: 210013,
                    },
                ],
            },
            {
                id: 12010408,
                dialogues: [
                    {
                        id: 12022510,
                        content: "我们继续前行吧。",
                        npc: 210013,
                    },
                ],
            },
            {
                id: 12010409,
                dialogues: [
                    {
                        id: 12015101,
                        content: "怎么样，你们现在有答案了吗？",
                        npc: 210017,
                    },
                    {
                        id: 12015102,
                        content: "俯瞰众生，却又渺无形踪，归于尘土……你想说的或许是云朵吧。",
                        npc: 210013,
                    },
                    {
                        id: 12015103,
                        content: "嘻嘻，姐姐真聪明！我尽兴啦，我们回去吧！",
                        npc: 210017,
                    },
                    {
                        id: 12022510,
                        content: "我们继续前行吧。",
                        npc: 210013,
                    },
                    {
                        id: 12014802,
                        content: "祠台就在前面，我认得路了……谢谢你们！",
                        npc: 210017,
                    },
                ],
            },
            {
                id: 12010411,
                dialogues: [
                    {
                        id: 12022510,
                        content: "我们继续前行吧。",
                        npc: 210013,
                    },
                    {
                        id: 12015201,
                        content: "终于找齐了三个小无由生……真是把魔王大人累得够呛！",
                        npc: 200002,
                    },
                    {
                        id: 12015202,
                        content: "听好了，从现在起，你们都乖乖待在这里，不许说话，也不许乱跑！",
                        npc: 200002,
                    },
                    {
                        id: 12015203,
                        content: "好啦，小白，莫再逗弄它们了。小心它们生气，不愿为你叩响通往虞泉的门扉。",
                        npc: 210013,
                    },
                    {
                        id: 12015204,
                        content: "你的意思是……我们还没有抵达真正的虞泉？",
                        npc: 200002,
                    },
                    {
                        id: 12015402,
                        content: "在你们面前，一个异样又光怪陆离的，属于无由生那一边的世界，徐徐展开……",
                    },
                ],
            },
            {
                id: 12010412,
                dialogues: [
                    {
                        id: 12015501,
                        content: "果然，只要还能晒太阳的日子足够久，便能好事常在，笑口常开。",
                        npc: 210018,
                    },
                    {
                        id: 12015502,
                        content: "我这把老骨头还能见到故知，值了。祝由大人，还有两位化外之客。幸会！",
                        npc: 210018,
                    },
                    {
                        id: 12015503,
                        content: "您太客气了，扶疏当不起这个尊称。",
                        npc: 210013,
                    },
                    {
                        id: 12015504,
                        content: "呵呵……百年之前的疫疠，在下受过祝由大人的恩惠，没齿难忘。几位有什么需要尽管开口。",
                        npc: 210018,
                    },
                    {
                        id: 12015505,
                        content: "等等，小仆从，你不觉得他们的交谈有哪里不对劲吗？！",
                        npc: 200002,
                    },
                ],
            },
            {
                id: 12010413,
                dialogues: [
                    {
                        id: 12015601,
                        content: "茎紫红色，叶对生，花小而白……看来便是这株植物了。",
                        npc: 210013,
                    },
                    {
                        id: 12015602,
                        content: "{nickname}，可否搭把手？在露水散去前，我需要采摘十株忘忧草。",
                        npc: 210013,
                    },
                    {
                        id: 12015603,
                        content: "挑那些花期正至，根色鲜泽的，药效会更好些。",
                        npc: 210013,
                    },
                    {
                        id: 12015604,
                        content: "好嘞，包在我们身上！",
                        npc: 200002,
                    },
                ],
            },
            {
                id: 12010414,
                dialogues: [
                    {
                        id: 12015701,
                        content: "喂——小仆从，你快过来看看！",
                        npc: 200002,
                    },
                ],
            },
        ],
    },
    {
        id: 120105,
        quests: [
            {
                id: 12010501,
                dialogues: [
                    {
                        id: 12018401,
                        content: "小友来了？出发吧。",
                        npc: 210012,
                    },
                    {
                        id: 12018402,
                        content: "出发？去哪儿？你总得先跟我说清楚吧？",
                        npc: 100001,
                    },
                    {
                        id: 12018403,
                        content: "……说清楚？",
                        npc: 210012,
                    },
                    {
                        id: 12018404,
                        content: "兵贵神速。若是为了无谓的口舌，耽误了最佳时机，那猎物可就要逃了。",
                        npc: 210012,
                    },
                    {
                        id: 12018405,
                        content: "那是你要考虑的。我只在意这次行动有没有危险，以及——是否正当。",
                        npc: 100001,
                    },
                    {
                        id: 12018406,
                        content: "呜哇，气氛好紧张……小仆从，要不还是算了吧？",
                        npc: 200002,
                    },
                    {
                        id: 12018407,
                        content: "哈哈……不卑不亢，据理力争。颇有我年轻时候的风采，我很欣赏。",
                        npc: 210012,
                    },
                    {
                        id: 12018408,
                        content: "……他竟然一下子变脸了！",
                        npc: 200002,
                    },
                    {
                        id: 12018409,
                        content: "等等，哪有人用这么自恋的方式夸别人啊！简直是自大狂！",
                        npc: 200002,
                    },
                    {
                        id: 12018410,
                        content: "路上说吧，你们关心的问题，我都会尽力解答。",
                        npc: 210012,
                    },
                    {
                        id: 12018501,
                        content: "小友可曾有过疑惑，烛阴之灾为何以玄色狴犴的模样呈现？",
                        npc: 210012,
                    },
                    {
                        id: 12018502,
                        content: "华胥备受崇敬的狴犴，在外界却是引起灾厄和恐惧的秽兽。其间区别，便在于大风九章的约束。",
                        npc: 210012,
                    },
                ],
            },
            {
                id: 12010502,
                dialogues: [
                    {
                        id: 12018503,
                        content: "玄色狴犴的出现，只能引向一种猜测——大风九章，如今正在失控。",
                        npc: 210012,
                    },
                    {
                        id: 12018504,
                        content: "但止流掌柜说过，解决了烛阴之灾，这些问题就会正常。",
                        npc: 100001,
                    },
                    {
                        id: 12018505,
                        content: "是，但那也只能救得了一时。",
                        npc: 210012,
                    },
                    {
                        id: 12018506,
                        content: "若是烛阴之灾周而复返，长久引得民生积弱呢？",
                        npc: 210012,
                    },
                    {
                        id: 12018507,
                        content: "止流掌柜有她的考虑。有些猜测，她未必会与你说。",
                        npc: 210012,
                    },
                    {
                        id: 12018508,
                        content: "在我看来，若是大风九章的根基出了问题，做再多修缮也只是表面功夫。",
                        npc: 210012,
                    },
                    {
                        id: 12018509,
                        content: "你的意思是，你从一开始就不认同大风九章？",
                        npc: 100001,
                    },
                    {
                        id: 12018510,
                        content: "哈哈哈……小友不用把话说得这么绝对。俗话说得好，知己知彼，方能百战百胜。",
                        npc: 210012,
                    },
                    {
                        id: 12018511,
                        content: "此行的目的是捉来一只狴犴作为我的“收藏品”，试图研究透彻其中原理，做一些两手准备。",
                        npc: 210012,
                    },
                    {
                        id: 12018512,
                        content: "如何，这个理由，足以说服你吗？",
                        npc: 210012,
                    },
                    {
                        id: 12018513,
                        content: "……与狴犴为敌，不会招致大风九章的惩罚吗？",
                        npc: 100001,
                    },
                    {
                        id: 12018514,
                        content: "呵呵，我等黑市中人常年游走于大风九章边缘，自有分寸。",
                        npc: 210012,
                    },
                ],
            },
            {
                id: 12010504,
                dialogues: [
                    {
                        id: 12018601,
                        content: "头儿，您来了！",
                        npc: 210010,
                    },
                    {
                        id: 12018602,
                        content: "情况如何了？",
                        npc: 210012,
                    },
                    {
                        id: 12018603,
                        content:
                            "如您所料，那猎物负了伤，已被逼入了听鸦原。这儿四面环海，呈孤岛之势，它逃不掉的。接下来只要瓮中捉鳖就好了！",
                        npc: 210010,
                    },
                    {
                        id: 12018604,
                        content: "听鸦原？这是谁的主意。",
                        npc: 210012,
                    },
                    {
                        id: 12018605,
                        content: "……",
                        npc: 210010,
                    },
                    {
                        id: 12018606,
                        content: "这地方，有什么不妥吗？",
                        npc: 100001,
                    },
                    {
                        id: 12018607,
                        content: "属下寻思这里是古战场遗址，平时阴风阵阵的，路人都会绕着走。在这儿行动不容易受打扰……",
                        npc: 210010,
                    },
                    {
                        id: 12018608,
                        content: "这里是黍离之战的交战场所没错。你可知此地更之前的用途吗？",
                        npc: 210012,
                    },
                    {
                        id: 12018609,
                        content: "呃，确实没听说过……还请头儿提点。",
                        npc: 210010,
                    },
                    {
                        id: 12018610,
                        content: "上古时期，机枢派的研究重地就立于此地。直至数百年前，悬衡派怀疑此地有叛乱嫌疑，引重兵前来镇压。",
                        npc: 210012,
                    },
                    {
                        id: 12018611,
                        content: "最终交战双方全数折于此地，无一人生还。机枢派也自此式微。",
                        npc: 210012,
                    },
                    {
                        id: 12018612,
                        content: "人泯灭在历史烟尘中，物却还留着。",
                        npc: 210012,
                    },
                    {
                        id: 12018613,
                        content: "此地的机巧奥义已经失传，万一被不慎触发，恐会带来变数。",
                        npc: 210012,
                    },
                    {
                        id: 12018614,
                        content: "那……",
                        npc: 210010,
                    },
                    {
                        id: 12018508,
                        content: "在我看来，若是大风九章的根基出了问题，做再多修缮也只是表面功夫。",
                        npc: 210012,
                    },
                    {
                        id: 12018509,
                        content: "你的意思是，你从一开始就不认同大风九章？",
                        npc: 100001,
                    },
                    {
                        id: 12018510,
                        content: "哈哈哈……小友不用把话说得这么绝对。俗话说得好，知己知彼，方能百战百胜。",
                        npc: 210012,
                    },
                    {
                        id: 12018511,
                        content: "此行的目的是捉来一只狴犴作为我的“收藏品”，试图研究透彻其中原理，做一些两手准备。",
                        npc: 210012,
                    },
                    {
                        id: 12018512,
                        content: "如何，这个理由，足以说服你吗？",
                        npc: 210012,
                    },
                    {
                        id: 12018513,
                        content: "……与狴犴为敌，不会招致大风九章的惩罚吗？",
                        npc: 100001,
                    },
                    {
                        id: 12018514,
                        content: "呵呵，我等黑市中人常年游走于大风九章边缘，自有分寸。",
                        npc: 210012,
                    },
                ],
            },
            {
                id: 12010513,
                dialogues: [
                    {
                        id: 12019901,
                        content: "这场你追我逃的游戏……该到此为止了。你说是吗，应天尉？",
                        npc: 210012,
                    },
                    {
                        id: 12019902,
                        content: "……",
                        npc: 210007,
                    },
                    {
                        id: 12019903,
                        content: "煜明……怎么是你？！",
                        npc: 100001,
                    },
                    {
                        id: 12019904,
                        content: "你所说的“狴犴”，难不成就是他？",
                        npc: 100001,
                    },
                    {
                        id: 12019905,
                        content: "又玩文字游戏是吧。对不起，我不干了。",
                        npc: 100001,
                    },
                    {
                        id: 12019906,
                        content: "就算是魔王大人，也是有底线的！",
                        npc: 200002,
                    },
                    {
                        id: 12019907,
                        content: "小友先熄熄火气。",
                        npc: 210012,
                    },
                    {
                        id: 12019908,
                        content: "你们一个两个怎么都表现得如同我要取他性命？恰恰相反，我是想提供一个助他解脱大风九章束缚的机会。",
                        npc: 210012,
                    },
                    {
                        id: 12019909,
                        content: "那你问过他的意见吗？",
                        npc: 100001,
                    },
                    {
                        id: 12019910,
                        content: "你的所作所为，已经危害到了苍生社稷。还请速速收手。",
                        npc: 210007,
                    },
                    {
                        id: 12019911,
                        content: "呵呵……是我在危害苍生社稷，还是这世道本身就分崩离析？大风九章所引发的种种弊端，你便视而不见吗？",
                        npc: 210012,
                    },
                    {
                        id: 12019912,
                        content: "若是能藉由你转化为应天尉的原理，从中掌握对付玄色狴犴的后手，也助你重获自由身。岂不是一桩美事？",
                        npc: 210012,
                    },
                    {
                        id: 12019913,
                        content: "……此事非你所当虑。",
                        npc: 210007,
                    },
                    {
                        id: 12019914,
                        content: "他已经表达了不愿意，那我就不能帮你。",
                        npc: 100001,
                    },
                    {
                        id: 12019915,
                        content: "又是无聊的仁义道德。啧……本不想用这种手段。",
                        npc: 210012,
                    },
                ],
            },
            {
                id: 12010515,
                dialogues: [
                    {
                        id: 12022521,
                        content: "sc011】刻舟登场",
                    },
                    {
                        id: 12020301,
                        content: "唉……好不容易见到师兄一面，又被旁人打搅，让他逃了去了。",
                        npc: 210021,
                    },
                    {
                        id: 12020302,
                        content: "这桂花糕，在怀里揣了半晌，揣得都冷了硬了。也不知道猴年马月才能让师兄吃上。",
                        npc: 210021,
                    },
                    {
                        id: 12020303,
                        content: "原来你在找的人，就是煜明。",
                        npc: 100001,
                    },
                    {
                        id: 12020304,
                        content: "话说回来，你怎么在这。我赶到之前，这里都发生了什么？",
                        npc: 210021,
                    },
                    {
                        id: 12020305,
                        content: "（向刻舟讲述之前发生的事情。）",
                    },
                    {
                        id: 12020306,
                        content: "这人怎么如此过分！{nickname}，你被他算计，没有受伤吧？！",
                        npc: 210021,
                    },
                    {
                        id: 12020307,
                        content: "可恶，师兄受那重重规矩束缚，我行事可是无法无天……惹了我，横竖也要让他吃点教训才是！",
                        npc: 210021,
                    },
                    {
                        id: 12020308,
                        content: "白也看这伙人不爽很久了！我们联手把这里掀翻天吧！",
                        npc: 200002,
                    },
                    {
                        id: 12020309,
                        content: "两位，你们的交谈我可都听见了。我向你们赔礼道歉可好？",
                        npc: 210012,
                    },
                    {
                        id: 12020310,
                        content: "我劝你少说些话，我的气可还没消。",
                        npc: 100001,
                    },
                    {
                        id: 12020311,
                        content: "现在不对你出手，只是因为我不想变成和你一样的渣滓。",
                        npc: 100001,
                    },
                    {
                        id: 12020312,
                        content: "好、好，小友宽宏大量。",
                        npc: 210012,
                    },
                    {
                        id: 12020313,
                        content:
                            "小友的义气着实让人动容。虬某心服口服，甘愿担下任务失败的责任，也要卖小友一个面子，放归猎物。之后止掌柜那边，我会去交代。",
                        npc: 210012,
                    },
                    {
                        id: 12020314,
                        content: "这真是止流掌柜的意思吗？我不信你说的话。还有，我不想再听到“猎物”这个词。",
                        npc: 100001,
                    },
                    {
                        id: 12020315,
                        content: "哈哈……正如我先前所说，止掌柜自有她的考虑。",
                        npc: 210012,
                    },
                    {
                        id: 12020316,
                        content: "要不是你们这伙人横插一杠，我和师兄早就重新聚首了！黑瞎子，你欠我的如何赔？",
                        npc: 210021,
                    },
                    {
                        id: 12020317,
                        content: "哦？依我看，那应天尉分明是刻意躲着你。若是他留下，你俩二人联手，在场各位又有谁能抵挡？",
                        npc: 210012,
                    },
                    {
                        id: 12020318,
                        content: "住口！要你在这边啰嗦！",
                        npc: 210021,
                    },
                    {
                        id: 12020319,
                        content: "哈哈哈！",
                        npc: 210012,
                    },
                    {
                        id: 12020320,
                        content: "我还有要事处理，便先行告退。",
                        npc: 210012,
                    },
                    {
                        id: 12020321,
                        content: "这位朋友，我且提醒你一句。你师兄往那个方向撤离，再不去追怕是又要来不及了。",
                        npc: 210012,
                    },
                    {
                        id: 12020322,
                        content: "小友，你也听我一句劝告。不是所有人行事都如我这般坦荡。知人知面，未必知心。",
                        npc: 210012,
                    },
                ],
            },
            {
                id: 12010516,
                dialogues: [
                    {
                        id: 12020501,
                        content: "唉……",
                        npc: 210021,
                    },
                    {
                        id: 12020502,
                        content: "{nickname}，你是不是和师兄挺熟的？",
                        npc: 210021,
                    },
                    {
                        id: 12020503,
                        content: "师兄成为应天尉是因为一场意外变故。但我能感觉到，他并不开心……",
                        npc: 210021,
                    },
                    {
                        id: 12020504,
                        content: "你下次要是见到他，帮我带一句话，就说当年那件事不怪他，山外山的大家都希望他回来。",
                        npc: 210021,
                    },
                    {
                        id: 12020505,
                        content: "当年？发生了什么事情？",
                        npc: 100001,
                    },
                    {
                        id: 12020506,
                        content: "这件事儿挺麻烦的，三言两语说不清楚。我还得赶着去追师兄，下次再和你讲吧。",
                        npc: 210021,
                    },
                    {
                        id: 12020507,
                        content: "{nickname}，你说，人活在这世上，为何不能随性所动，兴致来了便做自己想做的。偏偏要受这么多约束呢？",
                        npc: 210021,
                    },
                    {
                        id: 12020508,
                        content: "我得走了。别忘了我们的约定啊！下次见面，可得把盏言欢，畅谈至尽兴才行！",
                        npc: 210021,
                    },
                    {
                        id: 12020401,
                        content: "他的自恋狂发言又增加了！",
                        npc: 200002,
                    },
                    {
                        id: 12020402,
                        content: "最后那句话到底是什么意思哇？神神秘秘的……",
                        npc: 200002,
                    },
                ],
            },
            {
                id: 12010517,
                dialogues: [
                    {
                        id: 12023807,
                        content: "【幻境】进入古战场幻境",
                    },
                ],
            },
        ],
    },
    {
        id: 120106,
        quests: [
            {
                id: 12010601,
                dialogues: [
                    {
                        id: 12020601,
                        content: "感觉出来逛了好久，不知道止流那边怎么样了……",
                        npc: 200002,
                    },
                    {
                        id: 12020602,
                        content: "小仆从，我们回百年春看看吧！",
                        npc: 200002,
                    },
                ],
            },
            {
                id: 12010604,
                dialogues: [
                    {
                        id: 12021001,
                        content: "魂兮游离，北狩荒秽……彼我烛阴，罹殃千岁……",
                    },
                    {
                        id: 12021002,
                        content: "（……！又出现了，先前在尘漠石海听到的那个声音。）",
                        npc: 100001,
                    },
                    {
                        id: 12021003,
                        content: "（果然，这就是烛阴的呓语吗？）",
                        npc: 100001,
                    },
                    {
                        id: 12021004,
                        content: "怎么了，{nickname}？",
                        npc: 210004,
                    },
                    {
                        id: 12021005,
                        content: "不，没什么……",
                        npc: 100001,
                    },
                    {
                        id: 12021201,
                        content: "魂魄佚散，畴昔倾颓……荒忽焉极，循时索归……",
                    },
                    {
                        id: 12021202,
                        content: "（烛阴的声音，越来越清晰了……）",
                        npc: 100001,
                    },
                ],
            },
            {
                id: 12010605,
                dialogues: [
                    {
                        id: 12022101,
                        content: "小仆从，你没事吧？",
                        npc: 200002,
                    },
                    {
                        id: 12022102,
                        content: "没事。我好像看到了一些……画面。",
                        npc: 100001,
                    },
                    {
                        id: 12022103,
                        content: "诸位，趁它被束缚住，赶紧发动攻击！能否拿下便在此一举了！",
                        npc: 210004,
                    },
                ],
            },
            {
                id: 12010607,
                dialogues: [
                    {
                        id: 12022250,
                        content: "一段时间后……",
                    },
                ],
            },
            {
                id: 12010608,
                dialogues: [
                    {
                        id: 12022401,
                        content: "等等，说好要给我们的报酬，该不会也要赖掉了吧？",
                        npc: 200002,
                    },
                    {
                        id: 12022402,
                        content: "委托就这样黄了……小仆从，你说我们大老远来华胥，是不是白跑一趟？",
                        npc: 200002,
                    },
                    {
                        id: 12022403,
                        content: "倒是还有止流给我们的天价零花钱就是了，也不亏。早知道，当初就该多拿点花！",
                        npc: 200002,
                    },
                ],
            },
        ],
    },
    {
        id: 120111,
        quests: [
            {
                id: 12011101,
                dialogues: [
                    {
                        id: 12030001,
                        content: "那是不久之前，发生在冰湖城的一段故事——",
                    },
                    {
                        id: 12030002,
                        content: "当一只小夜莺，决定勇敢地飞出它温暖的巢穴。",
                    },
                    {
                        id: 12030001,
                        content: "那是不久之前，发生在冰湖城的一段故事——",
                    },
                    {
                        id: 12030002,
                        content: "当一只小夜莺，决定勇敢地飞出它温暖的巢穴。",
                    },
                    {
                        id: 12030201,
                        content:
                            "“大魔法师总是说，巢穴外的世界充满了危险，呆在巢穴里才是最安全的……可是小小的巢穴虽然温暖，却只能看到一小片方形的天空。”",
                    },
                    {
                        id: 12030202,
                        content:
                            "“有一天，从很远很远的地方漂流而来的独角兽{性别：先生|小姐}来到了小夜莺的巢穴，为小夜莺捎来了远方的故事……”",
                    },
                    {
                        id: 12030203,
                        content: "“在巢穴之外那广阔的世界里，有枝条能挂在月亮上的大树，有怀抱着一百座小岛的大海……”",
                    },
                    {
                        id: 12030204,
                        content: "“小夜莺也好想飞到大树的枝头，和每一朵绽放的花打招呼，去小松鼠的家里做客……”",
                    },
                    {
                        id: 12030205,
                        content: "“想乘上柔软的云，和掠过高空的海燕并肩翱翔，和跃出海面的鱼儿一起嬉戏……”",
                    },
                    {
                        id: 12030206,
                        content: "……",
                        npc: 211002,
                    },
                    {
                        id: 12030201,
                        content:
                            "“大魔法师总是说，巢穴外的世界充满了危险，呆在巢穴里才是最安全的……可是小小的巢穴虽然温暖，却只能看到一小片方形的天空。”",
                    },
                    {
                        id: 12030202,
                        content:
                            "“有一天，从很远很远的地方漂流而来的独角兽{性别：先生|小姐}来到了小夜莺的巢穴，为小夜莺捎来了远方的故事……”",
                    },
                    {
                        id: 12030203,
                        content: "“在巢穴之外那广阔的世界里，有枝条能挂在月亮上的大树，有怀抱着一百座小岛的大海……”",
                    },
                    {
                        id: 12030204,
                        content: "“小夜莺也好想飞到大树的枝头，和每一朵绽放的花打招呼，去小松鼠的家里做客……”",
                    },
                    {
                        id: 12030205,
                        content: "“想乘上柔软的云，和掠过高空的海燕并肩翱翔，和跃出海面的鱼儿一起嬉戏……”",
                    },
                    {
                        id: 12030206,
                        content: "……",
                        npc: 211002,
                    },
                ],
            },
            {
                id: 12011102,
                dialogues: [
                    {
                        id: 12030401,
                        content: "接下来就交给你了。",
                        npc: 211002,
                    },
                    {
                        id: 12030402,
                        content:
                            "你大概也猜到了，菲娜在过去经历过一些……很复杂的事情。虽说都过去了，但我还是有点担心她会被什么人认出来，引来不必要的麻烦。",
                        npc: 211002,
                    },
                    {
                        id: 12030403,
                        content: "你为什么不自己跟着她呢？",
                        npc: 100001,
                    },
                    {
                        id: 12030404,
                        content: "毕竟是小朋友的娱乐活动，我跟着也不太合适……",
                        npc: 211002,
                    },
                    {
                        id: 12030405,
                        content: "唉，可怜的奥特赛德，已经变成无聊的大人了呀。",
                        npc: 100001,
                    },
                    {
                        id: 12030406,
                        content: "哪有！主要是我都答应让她自己出门了，还跟在后面的话，我怕她会不高兴。",
                        npc: 211002,
                    },
                    {
                        id: 12030407,
                        content: "我看她挺喜欢你这个“独角兽{性别：先生|小姐}”的，你就当帮我个忙嘛，我的好队长！",
                        npc: 211002,
                    },
                    {
                        id: 12030408,
                        content: "我可不是免费的哦。",
                        npc: 100001,
                    },
                    {
                        id: 12030409,
                        content: "这好说，你想要什么报答尽管提，请你吃饭，帮你干活，或者叫你一个月{性别：大哥|大姐头}都行……学狗叫除外！",
                        npc: 211002,
                    },
                    {
                        id: 12030410,
                        content: "那真是太可惜了，我正想复习一下驯兽技巧。",
                        npc: 100001,
                    },
                    {
                        id: 12030411,
                        content: "你就饶了我吧……",
                        npc: 211002,
                    },
                    {
                        id: 12030412,
                        content: "差不多可以跟上去了。拜托你了，“独角兽{性别：先生|小姐}”兼“守护灵”{性别：大哥哥|大姐姐}！",
                        npc: 211002,
                    },
                    {
                        id: 12030401,
                        content: "接下来就交给你了。",
                        npc: 211002,
                    },
                    {
                        id: 12030402,
                        content:
                            "你大概也猜到了，菲娜在过去经历过一些……很复杂的事情。虽说都过去了，但我还是有点担心她会被什么人认出来，引来不必要的麻烦。",
                        npc: 211002,
                    },
                    {
                        id: 12030403,
                        content: "你为什么不自己跟着她呢？",
                        npc: 100001,
                    },
                    {
                        id: 12030404,
                        content: "毕竟是小朋友的娱乐活动，我跟着也不太合适……",
                        npc: 211002,
                    },
                    {
                        id: 12030405,
                        content: "唉，可怜的奥特赛德，已经变成无聊的大人了呀。",
                        npc: 100001,
                    },
                    {
                        id: 12030406,
                        content: "哪有！主要是我都答应让她自己出门了，还跟在后面的话，我怕她会不高兴。",
                        npc: 211002,
                    },
                    {
                        id: 12030407,
                        content: "我看她挺喜欢你这个“独角兽{性别：先生|小姐}”的，你就当帮我个忙嘛，我的好队长！",
                        npc: 211002,
                    },
                    {
                        id: 12030408,
                        content: "我可不是免费的哦。",
                        npc: 100001,
                    },
                    {
                        id: 12030409,
                        content: "这好说，你想要什么报答尽管提，请你吃饭，帮你干活，或者叫你一个月{性别：大哥|大姐头}都行……学狗叫除外！",
                        npc: 211002,
                    },
                    {
                        id: 12030410,
                        content: "那真是太可惜了，我正想复习一下驯兽技巧。",
                        npc: 100001,
                    },
                    {
                        id: 12030411,
                        content: "你就饶了我吧……",
                        npc: 211002,
                    },
                    {
                        id: 12030412,
                        content: "差不多可以跟上去了。拜托你了，“独角兽{性别：先生|小姐}”兼“守护灵”{性别：大哥哥|大姐姐}！",
                        npc: 211002,
                    },
                    {
                        id: 12030451,
                        content: "什么，马克今天不来了吗……？",
                        npc: 211013,
                    },
                    {
                        id: 12030452,
                        content: "嗯，他说他要帮她妈妈看摊位。今天只有我们三个玩了。",
                        npc: 211010,
                    },
                    {
                        id: 12030453,
                        content: "诶~三个人太少了，不好玩呀。我们再拉个人一起吧，让我看看——",
                        npc: 211011,
                    },
                    {
                        id: 12030454,
                        content: "呀！你们快看！是奥特赛德的吸血鬼妹妹！！！",
                        npc: 211011,
                    },
                    {
                        id: 12030455,
                        content: "咦……？",
                        npc: 211001,
                    },
                    {
                        id: 12030501,
                        content: "“吸血鬼妹妹”是什么？",
                        npc: 211010,
                    },
                    {
                        id: 12030502,
                        content: "就是奥特赛德的妹妹呀！我从来没见过她出门。只有吸血鬼才会不敢出门吧？",
                        npc: 211011,
                    },
                    {
                        id: 12030503,
                        content: "真的吗？真的是吸血鬼吗？那她可以帮忙数清楚我们那些石子一共有几颗吗？我总觉得最近每天都会变少……",
                        npc: 211010,
                    },
                    {
                        id: 12030504,
                        content: "可、可是……你不是说她从来不出门吗？现在她不是出来了……？",
                        npc: 211013,
                    },
                    {
                        id: 12030505,
                        content: "这个嘛……说不定她现在变得厉害了，就不怕出门了！",
                        npc: 211011,
                    },
                    {
                        id: 12030506,
                        content: "呜……好可怕……！",
                        npc: 211013,
                    },
                    {
                        id: 12030507,
                        content: "你们好……？",
                        npc: 211001,
                    },
                    {
                        id: 12030508,
                        content: "呜哇！救命，不、不要咬我啊——！",
                        npc: 211013,
                    },
                    {
                        id: 12030509,
                        content: "你们都误会了，我叫菲娜，是和你们一样的人类哦。",
                        npc: 211001,
                    },
                    {
                        id: 12030510,
                        content: "不是吸血鬼吗？那我的石子怎么办……",
                        npc: 211010,
                    },
                    {
                        id: 12030511,
                        content: "我宁愿石子全被小猫偷走，也不要吸血鬼来……",
                        npc: 211013,
                    },
                    {
                        id: 12030512,
                        content: "可是，如果你不是吸血鬼，为什么从来不出门呀？",
                        npc: 211011,
                    },
                    {
                        id: 12030513,
                        content: "因为我的身体不太好，经常生病。",
                        npc: 211001,
                    },
                    {
                        id: 12030514,
                        content: "什么，那也太可怜了吧……生病很难受的！",
                        npc: 211011,
                    },
                    {
                        id: 12030515,
                        content: "我妈妈说过，身体不好就应该多运动。",
                        npc: 211010,
                    },
                    {
                        id: 12030516,
                        content: "没错没错，菲娜姐姐，你只要你每天早上起来先绕着广场跑一百圈，身体肯定很快就会好起来的！",
                        npc: 211011,
                    },
                    {
                        id: 12030517,
                        content: "啊……呵呵，谢谢你们的建议。不过，我不擅长跑步，只能在这附近走一走啦。",
                        npc: 211001,
                    },
                    {
                        id: 12030518,
                        content: "那……菲娜姐姐，你要不要和我们一起玩？玩应该也算一种运动吧……？",
                        npc: 211013,
                    },
                    {
                        id: 12030519,
                        content: "哦——有道理，正好我们缺人呢！菲娜姐姐，你来和我们一起玩贪吃鬼好不好？",
                        npc: 211011,
                    },
                    {
                        id: 12030520,
                        content: "好呀！可是，“贪吃鬼”是什么游戏？我可能不会玩……",
                        npc: 211001,
                    },
                    {
                        id: 12030521,
                        content:
                            "很简单的，你听我说！一个人扮贪吃鬼，其他人扮烤土豆。游戏开始的时候，贪吃鬼闭上眼睛，烤土豆们就趁这个时候找地方躲起来。",
                        npc: 211011,
                    },
                    {
                        id: 12030522,
                        content: "贪吃鬼数完60下，就可以睁开眼睛开始找吃的。找到烤土豆的话，贪吃鬼就可以“嗷呜！”一口把烤土豆吃掉。",
                        npc: 211011,
                    },
                    {
                        id: 12030523,
                        content: "三分钟里吃掉所有的烤土豆，就是贪吃鬼赢；没吃完的话，贪吃鬼就会饿晕过去，烤土豆赢！",
                        npc: 211011,
                    },
                    {
                        id: 12030524,
                        content: "可是，烤土豆为什么会动呢？",
                        npc: 211001,
                    },
                    {
                        id: 12030525,
                        content: "对哦，为什么呢……？我家里的烤土豆也不会动。",
                        npc: 211010,
                    },
                    {
                        id: 12030526,
                        content: "这不重要吧……",
                        npc: 211011,
                    },
                    {
                        id: 12030527,
                        content: "啊，我知道了——也许，它们是被善良的魔法师祝福过的魔法烤土豆！",
                        npc: 211001,
                    },
                    {
                        id: 12030528,
                        content: "原来是这样！那我要当最厉害的魔法烤土豆。",
                        npc: 211010,
                    },
                    {
                        id: 12030529,
                        content: "魔法烤土豆……听起来很好吃……",
                        npc: 211013,
                    },
                    {
                        id: 12030530,
                        content: "那我们都当烤土豆，让菲娜姐姐来当贪吃鬼吧！好不好呀，菲娜姐姐？",
                        npc: 211011,
                    },
                    {
                        id: 12030531,
                        content: "好呀！那我就闭上眼睛，开始数数咯，1、2、3……",
                        npc: 211001,
                    },
                    {
                        id: 12030451,
                        content: "什么，马克今天不来了吗……？",
                        npc: 211013,
                    },
                    {
                        id: 12030452,
                        content: "嗯，他说他要帮她妈妈看摊位。今天只有我们三个玩了。",
                        npc: 211010,
                    },
                    {
                        id: 12030453,
                        content: "诶~三个人太少了，不好玩呀。我们再拉个人一起吧，让我看看——",
                        npc: 211011,
                    },
                    {
                        id: 12030454,
                        content: "呀！你们快看！是奥特赛德的吸血鬼妹妹！！！",
                        npc: 211011,
                    },
                    {
                        id: 12030455,
                        content: "咦……？",
                        npc: 211001,
                    },
                ],
            },
            {
                id: 12011103,
                dialogues: [
                    {
                        id: 12030650,
                        content: "就这样，三分钟过去了……",
                    },
                    {
                        id: 12030701,
                        content: "嘿嘿，魔法烤土豆赢啦！",
                        npc: 211011,
                    },
                    {
                        id: 12030702,
                        content: "三个烤土豆都赢了耶，贪吃鬼肚子空空~",
                        npc: 211010,
                    },
                    {
                        id: 12030703,
                        content: "嗯……是我太笨啦，还是烤土豆们更厉害！",
                        npc: 211001,
                    },
                    {
                        id: 12030704,
                        content: "没关系的，菲娜姐姐，我第一次玩的时候也一个烤土豆都没找到……",
                        npc: 211013,
                    },
                    {
                        id: 12030705,
                        content: "对呀对呀，我们再来一局吧，这次你一定能找到的！",
                        npc: 211011,
                    },
                    {
                        id: 12030706,
                        content: "好，这次我会努力的！",
                        npc: 211001,
                    },
                ],
            },
            {
                id: 12011105,
                dialogues: [
                    {
                        id: 12030901,
                        content: "可是，故事里的主人公们总是充满勇气，无论遇到怎样的困难，都会和伙伴们一起克服……",
                        npc: 211001,
                    },
                    {
                        id: 12030902,
                        content: "对了，伙伴！可以让菲娜的魔法朋友们来帮忙——大魔法师有着世界上最灵敏的鼻子，它一定可以帮我找到烤土豆的！",
                        npc: 211001,
                    },
                    {
                        id: 12030903,
                        content: "只要把大魔法师从书本里邀请出来……",
                        npc: 211001,
                    },
                    {
                        id: 12030809,
                        content: "呜……还是找不到烤土豆。",
                        npc: 211001,
                    },
                    {
                        id: 12030810,
                        content: "这个游戏对我来说好像太难了……",
                        npc: 211001,
                    },
                ],
            },
            {
                id: 12011107,
                dialogues: [
                    {
                        id: 12031101,
                        content: "菲娜姐姐，你太厉害啦！第二次就吃掉了所有的烤土豆，你是世界上最厉害的贪吃鬼！",
                        npc: 211011,
                    },
                    {
                        id: 12031102,
                        content: "我们再玩一局吧！",
                        npc: 211011,
                    },
                    {
                        id: 12031103,
                        content: "时间太晚了，我们该回家了，不然我会被妈妈骂的。",
                        npc: 211010,
                    },
                    {
                        id: 12031104,
                        content: "菲娜姐姐，你以后也会来和我们玩吗？除了贪吃鬼，还有很多好玩的游戏……",
                        npc: 211013,
                    },
                    {
                        id: 12031105,
                        content: "当然可以！下次你们的游乐园开场的时候，一定要叫上我呀！",
                        npc: 211001,
                    },
                ],
            },
        ],
    },
    {
        id: 120112,
        quests: [
            {
                id: 12011202,
                dialogues: [
                    {
                        id: 12031303,
                        content: "哇，好干净、好厚实的一张包装纸！这下可以给芙蕾达他们做一个新棋盘了……",
                        npc: 211003,
                    },
                    {
                        id: 12031304,
                        content: "你好呀，点石成金的公主殿下！",
                        npc: 211001,
                    },
                    {
                        id: 12031305,
                        content: "咦，这不是小菲娜吗？你怎么出门来了呀？",
                        npc: 211003,
                    },
                    {
                        id: 12031306,
                        content: "我正在冒险的旅途中哦！",
                        npc: 211001,
                    },
                    {
                        id: 12031307,
                        content: "在一个风和日丽的早晨，小夜莺来到了大名鼎鼎的垃圾王国！小夜莺用尖尖的喙敲了敲门，“咚咚，有人在吗——”",
                        npc: 211001,
                    },
                    {
                        id: 12031308,
                        content: "“哦，原来是小夜莺啊，欢迎欢迎！”——垃圾王国的大门在小夜莺面前轰然打开！",
                        npc: 211003,
                    },
                    {
                        id: 12031309,
                        content: "是点石成金的公主殿下给小夜莺开了门！据说这位公主殿下能够把一切平平无奇的垃圾变成了不起的宝物——",
                        npc: 211001,
                    },
                    {
                        id: 12031310,
                        content: "咳咳！小菲娜，抱歉打断了你的故事，但是，能不能给我换个角色呀……“公主”什么的，也太不好意思了……",
                        npc: 211003,
                    },
                    {
                        id: 12031311,
                        content: "那玛尔洁姐姐想要什么称号呢？",
                        npc: 211001,
                    },
                    {
                        id: 12031312,
                        content: "请叫我，“缄默侦探”！",
                        npc: 211003,
                    },
                    {
                        id: 12031313,
                        content:
                            "好的！那么……小夜莺见到了明察秋毫的缄默侦探阁下，“你好呀，缄默侦探！小夜莺想要和你成为朋友，我们一起玩耍吧！”",
                        npc: 211001,
                    },
                    {
                        id: 12031314,
                        content: "“没问题！”缄默侦探拍拍头顶的锅子，“那么，从今天起，你就是我的小助手啦！”",
                        npc: 211003,
                    },
                    {
                        id: 12031315,
                        content: "“小助手”……？这是菲娜的新角色吗？",
                        npc: 211001,
                    },
                    {
                        id: 12031316,
                        content: "这是你的称号！每一位伟大的侦探身边都会有一位出色的助手。",
                        npc: 211003,
                    },
                    {
                        id: 12031317,
                        content: "那么，“小助手”该做些什么呢？",
                        npc: 211001,
                    },
                    {
                        id: 12031318,
                        content:
                            "实不相瞒，本侦探正在调查一起不得了的大案件！最近，有一伙专门绑架小孩子的臭强盗重出江湖，在冰湖城谋划新的罪行，可大家却浑然不觉。",
                        npc: 211003,
                    },
                    {
                        id: 12031319,
                        content: "看，这是我在3号大垃圾桶里发现的铁证……这张纸上的记号，正和一年前犯罪现场发现的记号一模一样！",
                        npc: 211003,
                    },
                    {
                        id: 12031320,
                        content:
                            "只可惜，治安署觉得这还不足以成为证据……为了粉碎他们的阴谋、保护冰湖城的居民，本侦探只好亲自出手寻找这些强盗的下落了！",
                        npc: 211003,
                    },
                    {
                        id: 12031321,
                        content: "小助手，我们一起加油吧！我已经翻过了1~5号桶，正准备去翻6号……那么，7号小桶就交给你了！",
                        npc: 211003,
                    },
                    {
                        id: 12031322,
                        content: "好！小助手菲娜，接受任务！",
                        npc: 211001,
                    },
                ],
            },
            {
                id: 12011205,
                dialogues: [
                    {
                        id: 12031801,
                        content: "小助手，你找到什么了吗？",
                        npc: 211003,
                    },
                    {
                        id: 12031802,
                        content: "我找到了一张有记号的画！",
                        npc: 211001,
                    },
                    {
                        id: 12031803,
                        content:
                            "让我看看……这是一张地图呀！嗯……没错，就是这个记号。这和我之前找到的那张留言纸的材质一样，墨水颜色和笔迹也很相似。",
                        npc: 211003,
                    },
                    {
                        id: 12031804,
                        content:
                            "这上面标的是一条路线……？终点的位置在……这儿……难道说那就是他们的老巢？怪不得一直抓不住他们，原来是躲在城外啊！",
                        npc: 211003,
                    },
                    {
                        id: 12031805,
                        content: "哼哼，小贼们，遇上本侦探，你们的好日子到头啦！我这就把线索交到治安署，把你们一网打尽！",
                        npc: 211003,
                    },
                    {
                        id: 12031806,
                        content: "小助手帮上缄默侦探的忙了吗？",
                        npc: 211001,
                    },
                    {
                        id: 12031807,
                        content: "当然啦，你帮了大忙呢！你是全冰湖城最厉害的小助手！",
                        npc: 211003,
                    },
                    {
                        id: 12031808,
                        content: "嘿嘿，其实我也有自己的小助手。多亏独角兽{性别：先生|小姐}的帮忙，我才找到了线索~",
                        npc: 211001,
                    },
                    {
                        id: 12031809,
                        content: "原来你还有这样的独家本领！看来你做小助手有点屈才呀，也许我们应该称呼你为——“童话侦探”！怎么样？",
                        npc: 211003,
                    },
                    {
                        id: 12031810,
                        content: "“童话侦探”……这是菲娜的新称号吗？我很喜欢！",
                        npc: 211001,
                    },
                    {
                        id: 12031811,
                        content: "那么，“童话侦探”，我的朋友——让我们在下一个案件再会吧！本缄默侦探要趁治安署下班之前赶紧去报案啦。",
                        npc: 211003,
                    },
                    {
                        id: 12031812,
                        content: "好！",
                        npc: 211001,
                    },
                ],
            },
        ],
    },
    {
        id: 120113,
        quests: [
            {
                id: 12011302,
                dialogues: [
                    {
                        id: 12032020,
                        content: "这位小朋友，你有什么事吗？",
                        npc: 211001,
                    },
                    {
                        id: 12032021,
                        content: "叫谁小朋友呢！我问你，你会魔法吗？",
                        npc: 211012,
                    },
                    {
                        id: 12032022,
                        content: "唔，会一点点。",
                        npc: 211001,
                    },
                    {
                        id: 12032023,
                        content: "太好了——呃……咳！听好了，卡戎人，我需要你帮我做件事。放心，不难的，只要你按我说的用一下魔法就行。",
                        npc: 211012,
                    },
                    {
                        id: 12032024,
                        content: "报酬的话……有这么多哦！怎么样，够你吃一年的吧？",
                        npc: 211012,
                    },
                    {
                        id: 12032025,
                        content: "咦……？",
                        npc: 211001,
                    },
                    {
                        id: 12032026,
                        content: "怎么，嫌少吗？没关系，我还可以加。你就给我——",
                        npc: 211012,
                    },
                    {
                        id: 12032027,
                        content: "这位小朋友，你的老师没有教过你“有话好好说”吗？",
                        npc: 100001,
                    },
                    {
                        id: 12032028,
                        content: "呜哇——你、你是谁啊？",
                        npc: 211012,
                    },
                    {
                        id: 12032029,
                        content: "我是她的朋友，一位狩月人。",
                        npc: 100001,
                    },
                    {
                        id: 12032101,
                        content: "那、那又怎么样，还不是个卡戎！我告诉你，我可是从内城来的！",
                        npc: 211012,
                    },
                    {
                        id: 12032102,
                        content: "哦，是吗？",
                        npc: 100001,
                    },
                    {
                        id: 12032103,
                        content: "算、算了，不愿意帮忙拉倒。我再去找别人！",
                        npc: 211012,
                    },
                    {
                        id: 12032201,
                        content: "菲娜，你没事吧？",
                        npc: 100001,
                    },
                    {
                        id: 12032202,
                        content: "我没事，谢谢你的关心！不过，那个女孩子……",
                        npc: 211001,
                    },
                    {
                        id: 12032203,
                        content: "已经跑远了吧。那种傲慢的索拉之民我见得多了，都是虚张声势而已。",
                        npc: 100001,
                    },
                    {
                        id: 12032204,
                        content: "菲娜以后也要小心一点，可不能对谁都那么亲切，不然我们会担心的。",
                        npc: 100001,
                    },
                    {
                        id: 12032205,
                        content: "可是……刚才我说自己会魔法的时候，那个女孩子笑了——我看得出来，那是发自内心的笑，坏巫师是不会那样笑的。",
                        npc: 211001,
                    },
                    {
                        id: 12032206,
                        content: "而且，她是一个小朋友呀！菲娜像她这么大的时候，曾经被一个不知道名字的哥哥帮助过……",
                        npc: 211001,
                    },
                    {
                        id: 12032207,
                        content: "那时候我就想，等我长大之后，如果遇到了需要帮助的小朋友，我也要像那个哥哥一样帮助他们。",
                        npc: 211001,
                    },
                    {
                        id: 12032208,
                        content: "所以，我想去找那个女孩子问问清楚！如果她真的遇到了困难，我不能视而不见。",
                        npc: 211001,
                    },
                    {
                        id: 12032209,
                        content:
                            "唔，那好吧！既然这样，我也和菲娜一起去——万一遇到了什么事，就由我这个{性别：哥哥|姐姐}来帮助菲娜“小朋友”吧。",
                        npc: 100001,
                    },
                    {
                        id: 12032210,
                        content: "嘿嘿，谢谢你，独角兽{性别：先生|小姐}！有你在的话，我就不害怕了。",
                        npc: 211001,
                    },
                    {
                        id: 12032211,
                        content: "好，那我们就出发吧。我刚才看到那个女孩子往广场的方向去了。",
                        npc: 100001,
                    },
                ],
            },
        ],
    },
    {
        id: 120114,
        quests: [
            {
                id: 12011403,
                dialogues: [
                    {
                        id: 12032501,
                        content: "早上好，独角兽{性别：先生|小姐}！",
                        npc: 211001,
                    },
                    {
                        id: 12032502,
                        content: "早上好，菲娜。",
                        npc: 100001,
                    },
                    {
                        id: 12032503,
                        content: "我已经学会了邀请蝴蝶小姐的魔法，你看！",
                        npc: 211001,
                    },
                    {
                        id: 12032601,
                        content: "好漂亮的蝴蝶精灵啊。菲娜真是一位了不起的魔法师。",
                        npc: 100001,
                    },
                    {
                        id: 12032602,
                        content: "嘿嘿，谢谢你的夸奖。我们赶紧出发去找卡珊德拉小姐吧！",
                        npc: 211001,
                    },
                ],
            },
            {
                id: 12011405,
                dialogues: [
                    {
                        id: 12033201,
                        content: "怎么了？",
                        npc: 100001,
                    },
                    {
                        id: 12033202,
                        content: "塞维欧他、他不见了！",
                        npc: 211012,
                    },
                    {
                        id: 12033203,
                        content: "什么……怎么回事？什么时候不见的？",
                        npc: 100001,
                    },
                    {
                        id: 12033204,
                        content: "就是刚才，我追着你们走了一段，回头一看就发现他不见了！剧院那边我也找了，大家都说他没回去。呜呜，怎么办……",
                        npc: 211012,
                    },
                    {
                        id: 12033205,
                        content: "别急，他一个孩子也跑不了多远，我们先在附近找找看。",
                        npc: 100001,
                    },
                ],
            },
            {
                id: 12011406,
                dialogues: [
                    {
                        id: 10010101,
                        content: "贝蕾，我……",
                        npc: 100001,
                    },
                    {
                        id: 12033601,
                        content: "等等，那边地上的是……",
                        npc: 211012,
                    },
                    {
                        id: 12033602,
                        content: "好像是一枚银币？",
                        npc: 100001,
                    },
                    {
                        id: 12033603,
                        content: "不，这是硬纸板，只是涂成了银币的颜色……这是之前我们玩游戏的时候，塞维欧亲手做的道具！",
                        npc: 211012,
                    },
                    {
                        id: 12033604,
                        content: "他那么细心，绝对不会把这么重要的东西丢在地上的。他该不会……该不会是出了什么事吧……呜呜……",
                        npc: 211012,
                    },
                    {
                        id: 12033605,
                        content: "啊——！我想起来了，缄默侦探阁下说过，她在追查的那伙强盗是专门绑架小孩子的……",
                        npc: 211001,
                    },
                    {
                        id: 12033606,
                        content: "呜哇，强、强盗？！塞维欧被强盗抓走了吗？",
                        npc: 211012,
                    },
                    {
                        id: 12033607,
                        content: "菲娜，我记得你那时说，你找到了重要的线索。你还记得是什么吗？",
                        npc: 100001,
                    },
                    {
                        id: 12033608,
                        content: "我记得，那是一张地图……缄默侦探阁下看了以后说，强盗的老巢可能在泪湖附近！",
                        npc: 211001,
                    },
                    {
                        id: 12033609,
                        content: "那我们快过去吧！",
                        npc: 211012,
                    },
                    {
                        id: 12033610,
                        content:
                            "不，我们不知道强盗有多少人，一起过去太冒险了。卡珊德拉，你还记得来这里的路吗？我需要你现在回到城里，去找治安署报案，你能做到吗？",
                        npc: 100001,
                    },
                    {
                        id: 12033611,
                        content: "我记得，可是……",
                        npc: 211012,
                    },
                    {
                        id: 12033612,
                        content: "刚才在来的路上我已经清除了附近的秽兽，短时间内不会有新的出现。只要你按照我们来的路走，就不会遇到危险。",
                        npc: 100001,
                    },
                    {
                        id: 12033613,
                        content: "卡珊德拉，这个任务只有你能完成。你是我们之中唯一的索拉人，只有你去报案，他们才会当真。",
                        npc: 100001,
                    },
                    {
                        id: 12033614,
                        content: "……我明白了，我、我一定会完成任务的！你们等着我！",
                        npc: 211012,
                    },
                    {
                        id: 12033615,
                        content: "那么，菲娜——让我们一起去冒险吧！",
                        npc: 100001,
                    },
                    {
                        id: 12033616,
                        content: "嗯！",
                        npc: 211001,
                    },
                ],
            },
            {
                id: 12011408,
                dialogues: [
                    {
                        id: 12033803,
                        content: "塞维欧，醒醒！你没事吧？",
                        npc: 211001,
                    },
                    {
                        id: 12033805,
                        content: "这两个家伙哪里冒出来的？！居然敢从老子手里抢人，活腻了吧！",
                        npc: 211037,
                    },
                    {
                        id: 12033807,
                        content: "菲娜——快躲开，危险！",
                        npc: 100001,
                    },
                    {
                        id: 12033809,
                        content: "菲娜……已经长大了，不再是只能被别人庇护的、无力的雏鸟了——",
                        npc: 211001,
                    },
                ],
            },
            {
                id: 12011409,
                dialogues: [
                    {
                        id: 12033901,
                        content: "赢了……独角兽{性别：先生|小姐}，我们打败坏强盗了！",
                        npc: 211001,
                    },
                    {
                        id: 12033902,
                        content: "嗯，多亏了勇敢的菲娜呢。",
                        npc: 100001,
                    },
                    {
                        id: 12033903,
                        content: "嘿嘿。",
                        npc: 211001,
                    },
                    {
                        id: 12033904,
                        content: "塞维欧……你还好吗？",
                        npc: 211001,
                    },
                    {
                        id: 12033905,
                        content: "你——你就是塞拉菲娜姐姐，对不对？虽然你的头发变成蓝色了，但是我认得出来！",
                        npc: 211015,
                    },
                    {
                        id: 12033906,
                        content: "我……",
                        npc: 211001,
                    },
                    {
                        id: 12033907,
                        content: "我还认得这只蝴蝶……那一天，我找不到爸爸妈妈的时候，飞到我身边来的蝴蝶精灵……就和它长得一模一样。",
                        npc: 211015,
                    },
                    {
                        id: 12033908,
                        content: "我想起来了，塞拉菲娜姐姐，那一天你也在院子里。是你变出了蝴蝶精灵来陪我玩，对不对？",
                        npc: 211015,
                    },
                    {
                        id: 12033909,
                        content: "……是的，塞维欧，是我。但是，我现在的名字是菲娜。",
                        npc: 211001,
                    },
                    {
                        id: 12033910,
                        content: "原来，那个时候，我不是一个人……谢谢你，塞——菲娜姐姐！可是你后来为什么走了？你能回来吗？",
                        npc: 211015,
                    },
                    {
                        id: 12033911,
                        content:
                            "因为我是一个卡戎人……那座大宅邸不欢迎我，所以我必须离开，而且不能回去。不过，我现在也找到了一个新的家，你不用担心。",
                        npc: 211001,
                    },
                    {
                        id: 12033912,
                        content: "那……那你知道爸爸妈妈去哪里了吗？为什么他们不回来了？",
                        npc: 211015,
                    },
                    {
                        id: 12033913,
                        content: "他们……呜……",
                        npc: 211001,
                    },
                    {
                        id: 12034001,
                        content: "塞维欧，我来告诉你吧，我知道他们去哪里了。",
                        npc: 100001,
                    },
                    {
                        id: 12034002,
                        content:
                            "这个世界上有一个我们看不见的可怕怪物，叫做“偏见”……它会让本应相亲相爱的人们互相憎恶、互相伤害。你们的爸爸妈妈就是被它带走了。",
                        npc: 100001,
                    },
                    {
                        id: 12034003,
                        content: "那我要去把他们救回来！",
                        npc: 211015,
                    },
                    {
                        id: 12034004,
                        content: "现在你还太小了，而且，那不是靠一个人就能打败的敌人。",
                        npc: 100001,
                    },
                    {
                        id: 12034005,
                        content:
                            "因为那个可怕的怪物是靠吸食人们的信念长大的，现在这座城市里有太多人受到它的蛊惑，成为了它的仆从，让它变得很强很强。",
                        npc: 100001,
                    },
                    {
                        id: 12034006,
                        content:
                            "但只要你不相信它、我不相信它，我们再告诉我们的朋友，让大家一起勇敢起来，拒绝它的蛊惑……那么它的力量就会变得越来越弱。",
                        npc: 100001,
                    },
                    {
                        id: 12034007,
                        content: "然后，总有一天，它会彻底消失，再也不会有人被它带走。",
                        npc: 100001,
                    },
                    {
                        id: 12034008,
                        content: "到那个时候，爸爸妈妈就会回来了吗？",
                        npc: 211015,
                    },
                    {
                        id: 12034009,
                        content: "到那个时候……你就会拥有很多朋友、很多幸福和爱，即便爸爸妈妈不在，你也能好好地生活下去。",
                        npc: 100001,
                    },
                    {
                        id: 12034010,
                        content: "唔……",
                        npc: 211015,
                    },
                    {
                        id: 12034011,
                        content: "那么……菲娜也要到那个时候才能重新变成我的姐姐吗？",
                        npc: 211015,
                    },
                    {
                        id: 12034012,
                        content: "嗯，我想是的……不过，在那之前，我可以当你的朋友——就像我和卡珊德拉小姐是朋友一样！",
                        npc: 211001,
                    },
                    {
                        id: 12034013,
                        content: "卡珊德拉？",
                        npc: 211015,
                    },
                    {
                        id: 12034101,
                        content: "所有人不许动，我们是治安署的！",
                    },
                    {
                        id: 12034102,
                        content: "嗯……？这些强盗……已经被制服了？",
                    },
                    {
                        id: 12034103,
                        content: "是的，我们是卡珊德拉小姐雇佣的狩月人，已经把强盗打倒了。",
                        npc: 100001,
                    },
                    {
                        id: 12034104,
                        content: "是吗？",
                    },
                    {
                        id: 12034105,
                        content: "没错没错，他们俩都是我雇的人，不是可疑人物！",
                        npc: 211012,
                    },
                    {
                        id: 12034106,
                        content: "……好吧，那我们就把这些强盗带走了。",
                    },
                    {
                        id: 12034107,
                        content: "之前有个臭捡垃圾的卡戎一直来署里吵着说什么泪湖有强盗，还以为她是瞎编的，没想到居然是真的……",
                    },
                    {
                        id: 12034201,
                        content: "卡珊德拉……是你让他们来找我的吗？",
                        npc: 211015,
                    },
                    {
                        id: 12034202,
                        content: "当然了，不是我还能是谁？你为什么要跑到城外来呀，吓死我了！",
                        npc: 211012,
                    },
                    {
                        id: 12034203,
                        content: "我……我还以为你也不想跟我玩了。如果谁都不想看见我，那我还不如不回学校了……",
                        npc: 211015,
                    },
                    {
                        id: 12034204,
                        content: "说什么傻话呢，我们是朋友啊！你再把我想得和那些坏小孩一样，我可是会生气——啊，你受伤了吗？！",
                        npc: 211012,
                    },
                    {
                        id: 12034205,
                        content: "没事的，只是一点擦伤。谢谢你，卡珊德拉。",
                        npc: 211015,
                    },
                    {
                        id: 12034206,
                        content: "多亏了你，我不仅得救了，而且……我终于找到蝴蝶精灵了。",
                        npc: 211015,
                    },
                    {
                        id: 12034207,
                        content: "喔，那真是太好了！等回到学校，你一定要给我好好讲讲。",
                        npc: 211012,
                    },
                    {
                        id: 12034208,
                        content: "嗯！",
                        npc: 211015,
                    },
                    {
                        id: 12034209,
                        content: "菲娜，{nickname}{性别：哥哥|姐姐}，谢谢你们救了我的朋友！",
                        npc: 211012,
                    },
                    {
                        id: 12034210,
                        content: "不用客气。不如说，应该由我来向卡珊德拉小姐道谢才对。",
                        npc: 211001,
                    },
                    {
                        id: 12034211,
                        content: "说到这个，菲娜，你以后还是叫我卡珊德拉吧。因为我们是朋友了嘛！",
                        npc: 211012,
                    },
                    {
                        id: 12034212,
                        content: "对不起啊……我之前还对你那么凶。我总是听到别人说，卡戎之民都是一些又贪婪又狡猾的坏人，还以为是真的……",
                        npc: 211012,
                    },
                    {
                        id: 12034213,
                        content: "哼，原来他们全在胡说八道呀。你们两个比那些瞧不起人的索拉之民好一百倍，不对，一千倍！",
                        npc: 211012,
                    },
                    {
                        id: 12034214,
                        content: "我也要谢谢你们！呜呜……我差点以为我要被那些强盗扔进泪湖喂鱼了……",
                        npc: 211015,
                    },
                    {
                        id: 12034215,
                        content:
                            "别哭呀，现在你有这么多朋友，再也不用害怕啦。不管是坏小孩还是臭强盗，以后谁敢欺负你，就让菲娜变个大怪兽出来吓死他们——哼！",
                        npc: 211012,
                    },
                    {
                        id: 12034216,
                        content: "“大怪兽”太邪恶啦，我不会这样可怕的魔法。让威风凛凛的骑士大人来帮你们好不好？",
                        npc: 211001,
                    },
                    {
                        id: 12034217,
                        content: "……呵呵。",
                        npc: 211015,
                    },
                    {
                        id: 12034218,
                        content: "没关系，就算没有魔法，我也不会再认输了。我要像{nickname}{性别：哥哥|姐姐}说的那样，勇敢起来……！",
                        npc: 211015,
                    },
                    {
                        id: 12034219,
                        content: "好啦，各位勇敢的小朋友，现在该回家了哦。",
                        npc: 100001,
                    },
                ],
            },
            {
                id: 12011411,
                dialogues: [
                    {
                        id: 12034501,
                        content: "菲娜姐姐，是我。",
                        npc: 211015,
                    },
                    {
                        id: 12034502,
                        content: "塞维欧？你怎么一个人来了呀？",
                        npc: 211001,
                    },
                    {
                        id: 12034503,
                        content: "卡珊德拉去买东西了，我就先把我的谢礼带过来啦！",
                        npc: 211015,
                    },
                    {
                        id: 12034504,
                        content: "你看！",
                        npc: 211015,
                    },
                    {
                        id: 12034701,
                        content:
                            "菲娜，你听我说，刚才真是太巧啦，我在商店里遇到了那谁{性别：哥哥|姐姐}！嘿嘿，今天我请客，这些蛋糕、饼干和糖果，你们尽管吃！",
                        npc: 211012,
                    },
                    {
                        id: 12034702,
                        content: "哇……好棒！",
                        npc: 211015,
                    },
                    {
                        id: 12034703,
                        content: "我怎么又变回“那谁”了……",
                        npc: 100001,
                    },
                    {
                        id: 12034601,
                        content: "是白鸟先生……！",
                        npc: 211001,
                    },
                    {
                        id: 12034602,
                        content:
                            "我知道这是菲娜姐姐最喜欢的玩偶，所以你走了以后，我一直把它藏在柜子里，想着等你回来再还给你……既然你现在有了新家，就让它过来陪你吧！",
                        npc: 211015,
                    },
                    {
                        id: 12034603,
                        content: "呜……谢谢你，塞维欧！",
                        npc: 211001,
                    },
                    {
                        id: 12034604,
                        content: "菲娜姐姐……我现在想起来了，你在我们的家里总是不太开心。现在的这个家呢，你在这里开心吗？",
                        npc: 211015,
                    },
                    {
                        id: 12034605,
                        content: "嗯，菲娜很喜欢这个新家。",
                        npc: 211001,
                    },
                    {
                        id: 12034606,
                        content: "那真是太好了！我以后能来这里找你玩吗？",
                        npc: 211015,
                    },
                    {
                        id: 12034607,
                        content: "当然可以，因为，我们是朋友呀。",
                        npc: 211001,
                    },
                    {
                        id: 12034608,
                        content: "菲娜，菲娜！我们也来咯！",
                        npc: 211012,
                    },
                ],
            },
            {
                id: 12011412,
                dialogues: [
                    {
                        id: 12034901,
                        content:
                            "小夜莺飞出自己的巢穴，向未知的世界出发冒险……一路上，小夜莺见到了可爱的魔法烤土豆、机灵的缄默侦探阁下，还有许许多多的新朋友……",
                        npc: 211001,
                    },
                    {
                        id: 12034902,
                        content: "小夜莺不再害怕坏巫师，也不再担心被野兽追捕了。",
                        npc: 211001,
                    },
                    {
                        id: 12034903,
                        content: "因为，现在它知道，无论外面的世界多么阴森可怕……只要和朋友们手拉着手，就总能围出一个彩色的梦。",
                        npc: 211001,
                    },
                ],
            },
            {
                id: 12011415,
                dialogues: [
                    {
                        id: 12034704,
                        content: "怎么了，菲娜？",
                        npc: 100001,
                    },
                    {
                        id: 12034705,
                        content: "独角兽{性别：先生|小姐}……你还记得小夜莺的故事吗？",
                        npc: 211001,
                    },
                    {
                        id: 12034706,
                        content:
                            "为了在自由的世界里活下去、为了保护新的家人，小夜莺鼓起勇气，啄走了野兽的心脏……可它当时并没有想到，这样做也会让无辜的小兽失去家人。",
                        npc: 211001,
                    },
                    {
                        id: 12034707,
                        content: "塞维欧，他还不知道……都是因为我，他才会失去爸爸妈妈。如果他知道了，他是不是就会讨厌我了？",
                        npc: 211001,
                    },
                    {
                        id: 12034708,
                        content:
                            "菲娜还记得我刚才给塞维欧讲的那个故事吗？我认为，虽然小夜莺啄去了野兽的心脏，但真正引来了这一切悲剧的，是那个<H>看不见的怪物</>。",
                        npc: 100001,
                    },
                    {
                        id: 12034709,
                        content:
                            "如果塞维欧听懂了我的故事，那么等他知道真相的时候，他一定也会明白，发生在他爸爸妈妈身上的事并不是菲娜的错。",
                        npc: 100001,
                    },
                    {
                        id: 12034710,
                        content:
                            "不过啊，现在你们都还小，只要好好吃饭，按时睡觉，快快乐乐举办茶会就好了。这些复杂的事情，还是长大再去想吧。",
                        npc: 100001,
                    },
                    {
                        id: 12034711,
                        content: "等到必须要面对真相的那一天，我会陪着菲娜一起的。",
                        npc: 100001,
                    },
                    {
                        id: 12034712,
                        content: "……嗯，一言为定！谢谢你，独角兽{性别：先生|小姐}。",
                        npc: 211001,
                    },
                    {
                        id: 12034713,
                        content: "菲娜，那谁{性别：哥哥|姐姐}，你们怎么还在外面讲悄悄话呀？再不进来，我们可要把蛋糕都吃光咯？",
                        npc: 211012,
                    },
                    {
                        id: 12034714,
                        content: "来了来了。",
                        npc: 100001,
                    },
                    {
                        id: 12034715,
                        content: "我也来啦！",
                        npc: 211001,
                    },
                ],
            },
        ],
    },
    {
        id: 200101,
        quests: [
            {
                id: 20010101,
                dialogues: [
                    {
                        id: 20000401,
                        content: "喂。",
                        npc: 200024,
                    },
                    {
                        id: 20000402,
                        content: "我说，那边的年轻人……",
                        npc: 200024,
                    },
                ],
            },
            {
                id: 20010102,
                dialogues: [
                    {
                        id: 20000508,
                        content: "嗯，还算懂事。",
                        npc: 200024,
                    },
                    {
                        id: 20000511,
                        content: "其实呢，刚刚你们路过的时候啊，老朽嗅到了了不得的东西。",
                        npc: 200024,
                    },
                    {
                        id: 20000512,
                        content: "没错，就是<H>稀世神兵</>的味道！年轻人，你是不是藏着什么了不得的武器?",
                        npc: 200024,
                    },
                    {
                        id: 20000513,
                        content: "武器？我只有这把剑……",
                        npc: 100001,
                    },
                    {
                        id: 20000514,
                        content: "……！",
                        npc: 200024,
                    },
                    {
                        id: 20000515,
                        content: "（她仔细打量着这把剑，仿佛想要从它的纹路里读出什么。）",
                    },
                    {
                        id: 20000516,
                        content: "好剑、好剑呀！这剑无论是看材质还是手法，都不是海伯利亚这群庸才的手笔。你年纪轻轻，怎么弄到这种宝贝的？",
                        npc: 200024,
                    },
                    {
                        id: 20000517,
                        content:
                            "（在这位皎皎铁匠的眼中，这把剑似乎并不同寻常。于是几天前的回忆再次苏醒：这把剑曾是一把打开遗迹大门的钥匙。然而，它究竟从何而来——这依旧是个谜。）",
                    },
                    {
                        id: 20000519,
                        content: "我不知道……",
                        npc: 100001,
                    },
                    {
                        id: 20000520,
                        content: "从我记事起，这把剑就在我身边了。也许是我父母留下的?",
                        npc: 100001,
                    },
                    {
                        id: 20000522,
                        content: "有趣，有趣。老朽当了一辈子铁匠，也要甘拜下风啦。",
                        npc: 200024,
                    },
                    {
                        id: 20000523,
                        content: "年轻人啊，老朽常年漂泊在外，居无定所。要不，就让老朽跟随你—阵子?",
                        npc: 200024,
                    },
                    {
                        id: 20000524,
                        content: "从海伯利亚到艾利西安，老朽见过、锻造过的武器可多啦！如果你想锻造什么兵器，就包在我身上吧。",
                        npc: 200024,
                    },
                    {
                        id: 20000525,
                        content: "哇，原来是铁匠前辈啊！",
                        npc: 200025,
                    },
                    {
                        id: 20000526,
                        content: "价钱肯定比外面的铁匠便宜！你只要让我得空研究研究你那把剑就好了，哈哈。",
                        npc: 200024,
                    },
                    {
                        id: 20000509,
                        content: "你……哼！",
                        npc: 200024,
                    },
                    {
                        id: 20000510,
                        content: "算了，老朽不和小孩子计较。",
                        npc: 200024,
                    },
                    {
                        id: 20000511,
                        content: "其实呢，刚刚你们路过的时候啊，老朽嗅到了了不得的东西。",
                        npc: 200024,
                    },
                    {
                        id: 20000512,
                        content: "没错，就是<H>稀世神兵</>的味道！年轻人，你是不是藏着什么了不得的武器?",
                        npc: 200024,
                    },
                    {
                        id: 20000513,
                        content: "武器？我只有这把剑……",
                        npc: 100001,
                    },
                    {
                        id: 20000514,
                        content: "……！",
                        npc: 200024,
                    },
                    {
                        id: 20000515,
                        content: "（她仔细打量着这把剑，仿佛想要从它的纹路里读出什么。）",
                    },
                    {
                        id: 20000516,
                        content: "好剑、好剑呀！这剑无论是看材质还是手法，都不是海伯利亚这群庸才的手笔。你年纪轻轻，怎么弄到这种宝贝的？",
                        npc: 200024,
                    },
                    {
                        id: 20000517,
                        content:
                            "（在这位皎皎铁匠的眼中，这把剑似乎并不同寻常。于是几天前的回忆再次苏醒：这把剑曾是一把打开遗迹大门的钥匙。然而，它究竟从何而来——这依旧是个谜。）",
                    },
                    {
                        id: 20000519,
                        content: "我不知道……",
                        npc: 100001,
                    },
                    {
                        id: 20000520,
                        content: "从我记事起，这把剑就在我身边了。也许是我父母留下的?",
                        npc: 100001,
                    },
                    {
                        id: 20000522,
                        content: "有趣，有趣。老朽当了一辈子铁匠，也要甘拜下风啦。",
                        npc: 200024,
                    },
                    {
                        id: 20000523,
                        content: "年轻人啊，老朽常年漂泊在外，居无定所。要不，就让老朽跟随你—阵子?",
                        npc: 200024,
                    },
                    {
                        id: 20000524,
                        content: "从海伯利亚到艾利西安，老朽见过、锻造过的武器可多啦！如果你想锻造什么兵器，就包在我身上吧。",
                        npc: 200024,
                    },
                    {
                        id: 20000525,
                        content: "哇，原来是铁匠前辈啊！",
                        npc: 200025,
                    },
                    {
                        id: 20000526,
                        content: "价钱肯定比外面的铁匠便宜！你只要让我得空研究研究你那把剑就好了，哈哈。",
                        npc: 200024,
                    },
                    {
                        id: 20000533,
                        content: "看样子年轻人这是答应啦。好，好！快带老朽去你的住处吧！",
                        npc: 200024,
                    },
                    {
                        id: 20000528,
                        content: "嗬……年轻人的表情，这是在怀疑老朽吧。",
                        npc: 200024,
                    },
                    {
                        id: 20000529,
                        content: "你大可放心——“皎皎之民永远不会主动伤害人类”，这是整片阿特拉西亚大陆人尽皆知的事实。",
                        npc: 200024,
                    },
                    {
                        id: 20000530,
                        content: "就是就是！",
                        npc: 200025,
                    },
                    {
                        id: 20000531,
                        content:
                            "（没错，身为皎皎之民的白就是一个热心肠的孩子。更何况，我身上也没什么值钱的东西，一名铁匠又能图谋什么呢？）",
                    },
                    {
                        id: 20000532,
                        content: "嗯，我想多了。那我们一起回去吧。",
                        npc: 100001,
                    },
                    {
                        id: 20000533,
                        content: "看样子年轻人这是答应啦。好，好！快带老朽去你的住处吧！",
                        npc: 200024,
                    },
                    {
                        id: 20000501,
                        content: "……诶？谁？",
                        npc: 100001,
                    },
                    {
                        id: 20000502,
                        content: "和白长得很像的……小妹妹？",
                        npc: 100001,
                    },
                    {
                        id: 20000503,
                        content: "……",
                        npc: 200024,
                    },
                    {
                        id: 20000504,
                        content: "你、你叫谁小妹妹！现在的年轻人呐，真是越来越不像话啦。",
                        npc: 200024,
                    },
                    {
                        id: 20000505,
                        content: "你呀，要讲礼貌！虽然皎皎之民看上去都和白一样年轻，但她的年龄其实已经可以当你外婆的外婆的外婆啦……",
                        npc: 200025,
                    },
                    {
                        id: 20000506,
                        content:
                            "（眼前扛着锤子的“女孩”，与早些时间认识的白，她们的外貌和声音如此相似，但年龄阅历却似乎完全不同——<H>皎皎之民</>，真是一群不可思议的家伙。）",
                    },
                    {
                        id: 20000528,
                        content: "嗬……年轻人的表情，这是在怀疑老朽吧。",
                        npc: 200024,
                    },
                    {
                        id: 20000529,
                        content: "你大可放心——“皎皎之民永远不会主动伤害人类”，这是整片阿特拉西亚大陆人尽皆知的事实。",
                        npc: 200024,
                    },
                    {
                        id: 20000530,
                        content: "就是就是！",
                        npc: 200025,
                    },
                    {
                        id: 20000531,
                        content:
                            "（没错，身为皎皎之民的白就是一个热心肠的孩子。更何况，我身上也没什么值钱的东西，一名铁匠又能图谋什么呢？）",
                    },
                    {
                        id: 20000532,
                        content: "嗯，我想多了。那我们一起回去吧。",
                        npc: 100001,
                    },
                    {
                        id: 20000533,
                        content: "看样子年轻人这是答应啦。好，好！快带老朽去你的住处吧！",
                        npc: 200024,
                    },
                    {
                        id: 20000533,
                        content: "看样子年轻人这是答应啦。好，好！快带老朽去你的住处吧！",
                        npc: 200024,
                    },
                    {
                        id: 20000501,
                        content: "……诶？谁？",
                        npc: 100001,
                    },
                    {
                        id: 20000502,
                        content: "和白长得很像的……小妹妹？",
                        npc: 100001,
                    },
                    {
                        id: 20000503,
                        content: "……",
                        npc: 200024,
                    },
                    {
                        id: 20000504,
                        content: "你、你叫谁小妹妹！现在的年轻人呐，真是越来越不像话啦。",
                        npc: 200024,
                    },
                    {
                        id: 20000505,
                        content: "你呀，要讲礼貌！虽然皎皎之民看上去都和白一样年轻，但她的年龄其实已经可以当你外婆的外婆的外婆啦……",
                        npc: 200025,
                    },
                    {
                        id: 20000506,
                        content:
                            "（眼前扛着锤子的“女孩”，与早些时间认识的白，她们的外貌和声音如此相似，但年龄阅历却似乎完全不同——<H>皎皎之民</>，真是一群不可思议的家伙。）",
                    },
                ],
            },
            {
                id: 20010105,
                dialogues: [
                    {
                        id: 20000601,
                        content: "好厉害！不愧是前辈！",
                        npc: 200002,
                    },
                    {
                        id: 20000602,
                        content: "说起来，我在路上也看到了和白、铁匠前辈长得很相似的人。她们也是<H>皎皎之民</>吗？",
                        npc: 100001,
                    },
                    {
                        id: 20000603,
                        content: "年轻人，你是不是从什么偏僻地方来的？",
                        npc: 200024,
                    },
                    {
                        id: 20000604,
                        content: "是的……我的故乡确实不算繁华。",
                        npc: 100001,
                    },
                    {
                        id: 20000605,
                        content:
                            "哈哈，难怪，难怪。毕竟在老朽走过的地方啊，有人类的地方就有皎皎之民。像你这样没见过我们一族的孩子，已经不多啦。",
                        npc: 200024,
                    },
                    {
                        id: 20000618,
                        content: "唔……每天二十张魔王大人的亲笔签名夸奖信？哎呀到时候再说啦，总之，绝对不会亏待你的！",
                        npc: 200002,
                    },
                    {
                        id: 20000619,
                        content: "嘿嘿……嘿嘿嘿……",
                        npc: 200002,
                    },
                    {
                        id: 20000620,
                        content: "（这不是和普通皎皎没什么区别吗！）",
                        npc: 100001,
                    },
                    {
                        id: 20000601,
                        content: "好厉害！不愧是前辈！",
                        npc: 200002,
                    },
                    {
                        id: 20000602,
                        content: "说起来，我在路上也看到了和白、铁匠前辈长得很相似的人。她们也是<H>皎皎之民</>吗？",
                        npc: 100001,
                    },
                    {
                        id: 20000603,
                        content: "年轻人，你是不是从什么偏僻地方来的？",
                        npc: 200024,
                    },
                    {
                        id: 20000604,
                        content: "是的……我的故乡确实不算繁华。",
                        npc: 100001,
                    },
                    {
                        id: 20000605,
                        content:
                            "哈哈，难怪，难怪。毕竟在老朽走过的地方啊，有人类的地方就有皎皎之民。像你这样没见过我们一族的孩子，已经不多啦。",
                        npc: 200024,
                    },
                    {
                        id: 20000601,
                        content: "好厉害！不愧是前辈！",
                        npc: 200002,
                    },
                    {
                        id: 20000602,
                        content: "说起来，我在路上也看到了和白、铁匠前辈长得很相似的人。她们也是<H>皎皎之民</>吗？",
                        npc: 100001,
                    },
                    {
                        id: 20000603,
                        content: "年轻人，你是不是从什么偏僻地方来的？",
                        npc: 200024,
                    },
                    {
                        id: 20000604,
                        content: "是的……我的故乡确实不算繁华。",
                        npc: 100001,
                    },
                    {
                        id: 20000605,
                        content:
                            "哈哈，难怪，难怪。毕竟在老朽走过的地方啊，有人类的地方就有皎皎之民。像你这样没见过我们一族的孩子，已经不多啦。",
                        npc: 200024,
                    },
                ],
            },
        ],
    },
    {
        id: 200102,
        quests: [
            {
                id: 20010201,
                dialogues: [
                    {
                        id: 20000801,
                        content: "唉……",
                        npc: 200027,
                    },
                    {
                        id: 20000802,
                        content: "赛琪。",
                        npc: 100001,
                    },
                    {
                        id: 20000803,
                        content: "…………",
                        npc: 200027,
                    },
                    {
                        id: 20000804,
                        content: "是……{nickname}……？",
                        npc: 200027,
                    },
                    {
                        id: 20000805,
                        content: "我们之前说过的，我来看看你。",
                        npc: 100001,
                    },
                    {
                        id: 20000807,
                        content: "你的眼睛……又看不清了吗，和在废矿那时一样？",
                        npc: 100001,
                    },
                    {
                        id: 20000808,
                        content: "嗯，这会儿看东西有点模模糊糊的……没事的，是老毛病啦。",
                        npc: 200027,
                    },
                    {
                        id: 20000809,
                        content: "应该是因为最近有点累，稍微休息几天就会好的！",
                        npc: 200027,
                    },
                ],
            },
            {
                id: 20010203,
                dialogues: [
                    {
                        id: 20001001,
                        content: "这里的土壤好像有点干燥……再去别的地方看看吧。",
                        npc: 100001,
                    },
                    {
                        id: 20001001,
                        content: "这里的土壤好像有点干燥……再去别的地方看看吧。",
                        npc: 100001,
                    },
                    {
                        id: 20001001,
                        content: "这里的土壤好像有点干燥……再去别的地方看看吧。",
                        npc: 100001,
                    },
                ],
            },
            {
                id: 20010204,
                dialogues: [
                    {
                        id: 20001201,
                        content: "找到了……！这里的土壤比较松软，湿度看起来也合适，多挖一点回去吧。",
                        npc: 100001,
                    },
                    {
                        id: 20001501,
                        content: "嗯……有这些应该够了，回去交给赛琪吧。",
                        npc: 100001,
                    },
                    {
                        id: 20001601,
                        content: "嗯等。",
                    },
                    {
                        id: 20001602,
                        content: "等不耐烦了。",
                    },
                    {
                        id: 20001603,
                        content: "赛琪怎么还没出来，我们去瞅瞅吧。",
                    },
                ],
            },
            {
                id: 20010205,
                dialogues: [
                    {
                        id: 20000901,
                        content: "赛琪，我把山洞的土壤带回来了，你看看，是你说的那种吗？",
                        npc: 100001,
                    },
                    {
                        id: 20000902,
                        content: "嗯……这些土壤的触感……确实和爸爸从前用的一模一样。",
                        npc: 200027,
                    },
                    {
                        id: 20000903,
                        content: "你找了好多啊……这样一来，这里的花都能开得更好了。",
                        npc: 200027,
                    },
                    {
                        id: 20001201,
                        content: "找到了……！这里的土壤比较松软，湿度看起来也合适，多挖一点回去吧。",
                        npc: 100001,
                    },
                ],
            },
        ],
    },
    {
        id: 200103,
        quests: [
            {
                id: 20010301,
                dialogues: [
                    {
                        id: 20004801,
                        content: "小仆从，小仆从，不得了啦！出大事了！",
                        npc: 200002,
                    },
                    {
                        id: 20004802,
                        content: "虽然我还没有亲眼见到，但是一想到这件事可能是真的，就觉得非常可怕！",
                        npc: 200002,
                    },
                    {
                        id: 20004803,
                        content: "喘口气慢慢说，怎么了？",
                        npc: 100001,
                    },
                    {
                        id: 20004804,
                        content:
                            "可不能慢慢说！我听说，有人在冰湖城外看到了一头巨大的猪，个子比你还高，脑袋比货车还大，蹄子蹬一下，能让冰湖城的城墙倒掉！",
                        npc: 200002,
                    },
                ],
            },
            {
                id: 20010302,
                dialogues: [
                    {
                        id: 20005001,
                        content: "到了到了，“泪湖南岸，大坡边上”，我听到的传闻里说那只巨大的猪就在这附近出没。",
                        npc: 200002,
                    },
                    {
                        id: 20005002,
                        content: "这不是什么都没有吗？",
                        npc: 100001,
                    },
                    {
                        id: 20005003,
                        content: "是哦，不过既然说是出没，那意思就是可能在，也可能不在嘛。",
                        npc: 200002,
                    },
                    {
                        id: 20005004,
                        content: "我打算回去了……",
                        npc: 100001,
                    },
                    {
                        id: 20005005,
                        content: "诶诶别急。你看，那边也有两个人，好像待了很久了，像是在等什么的样子——说不定也在等巨大的猪，去看看吧。",
                        npc: 200002,
                    },
                    {
                        id: 20005201,
                        content: "你们好，请问——",
                        npc: 200002,
                    },
                    {
                        id: 20005202,
                        content: "嘘——小声点，没看见在这儿等着呢吗？",
                        npc: 700261,
                    },
                    {
                        id: 20005203,
                        content: "哦哦，不好意思。难道说，你们也在等那个？",
                        npc: 200002,
                    },
                    {
                        id: 20005204,
                        content: "是啊，怎么，你们也有这个打算？先来后到，排队排队，可别和我们抢。",
                        npc: 700262,
                    },
                    {
                        id: 20005205,
                        content: "啊？还要排队？不用吧……那么大一只呢，不过既然是你们先来的，那我们就在边上看着，你们看完了，我们再凑近看。",
                        npc: 200002,
                    },
                    {
                        id: 20005206,
                        content: "你们是在说同一件事吗？",
                        npc: 100001,
                    },
                    {
                        id: 20005207,
                        content: "还能是什么事，凡是来这边的，不都是为了——",
                        npc: 700262,
                    },
                    {
                        id: 20005212,
                        content: "这次还行，有一只还没见过，都带回去吧。",
                        npc: 200075,
                    },
                    {
                        id: 20005213,
                        content: "咦？你们，你们这是干什么？",
                        npc: 200002,
                    },
                    {
                        id: 20005301,
                        content: "不可以欺负魔灵！榛子，撞飞他们！",
                    },
                    {
                        id: 20005302,
                        content: "怎么又是她，最近第几次了？晦气。快走快走，刚刚抓到的这些魔灵都给揣在怀里，别落下。",
                        npc: 200075,
                    },
                    {
                        id: 20005303,
                        content: "他们想跑！喂，那边的{性别：大哥哥|大姐姐}和小朋友，帮一帮我。",
                    },
                    {
                        id: 20005304,
                        content: "真的有巨猪啊——还在对我们说话！我看我们就听它的吧，这奇怪的家伙确实很可疑！",
                        npc: 200002,
                    },
                    {
                        id: 20005101,
                        content: "来嘛来嘛，要是不是的话我们就回去。",
                        npc: 200002,
                    },
                ],
            },
            {
                id: 20010304,
                dialogues: [
                    {
                        id: 20005401,
                        content: "哎呀，他们跑得也太快了，一溜烟儿就不见了，要追吗？",
                        npc: 200002,
                    },
                    {
                        id: 20005402,
                        content: "他们跑得轻车熟路，对附近很熟悉，应该是追不上了。并且，可别忘了，我们来这里一开始可是为了找这位。",
                        npc: 100001,
                    },
                    {
                        id: 20005403,
                        content: "这就是你说的个子比我还高，脑袋比货车还大的巨猪？并没有那么大嘛，你被人骗啦。",
                        npc: 100001,
                    },
                    {
                        id: 20005404,
                        content:
                            "唔……就……就算是它没我一开始说得那么大，这个大小，也很不一般了！并且你还记得吧，它刚刚还说话了，这也很值得调查！",
                        npc: 200002,
                    },
                    {
                        id: 20005405,
                        content: "哼哼……",
                        npc: 200076,
                    },
                    {
                        id: 20005406,
                        content: "我怎么感觉它并不会说话的样子……",
                        npc: 100001,
                    },
                    {
                        id: 20005407,
                        content: "刚刚那是我在叫你们啦。",
                        npc: 200074,
                    },
                    {
                        id: 20005408,
                        content:
                            "你们好，我是松露，从很远很远的地方过来，这是我的好朋友和可靠的伙伴榛子，谢谢你们一起救下了魔灵，赶跑了那些魔灵猎人！",
                        npc: 200074,
                    },
                    {
                        id: 20005409,
                        content: "魔灵……猎人？",
                        npc: 200002,
                    },
                    {
                        id: 20005410,
                        content:
                            "是的，就是刚刚那几个家伙，他们自称魔灵猎人，听起来很帅气的名字，但是却一直在干坏事，把附近的魔灵都抓光了。",
                        npc: 200074,
                    },
                    {
                        id: 20005425,
                        content: "哒哒……？",
                    },
                    {
                        id: 20005426,
                        content: "没错，就是这样，{性别：大哥哥|大姐姐}真厉害！好像这只小家伙也很喜欢你哦，你看，立刻就精神了好多！",
                        npc: 200074,
                    },
                    {
                        id: 20005427,
                        content: "哒哒！哒哒哒！",
                    },
                    {
                        id: 20005428,
                        content: "你在吵闹什么呀，小东西？",
                        npc: 200002,
                    },
                    {
                        id: 20005429,
                        content: "它在和{nickname}说话呢。",
                        npc: 200074,
                    },
                    {
                        id: 20005430,
                        content: "这只魔灵说，它莫名觉得你身上有种亲切的感觉，它想和你一起走！你来保护它，它也能在关键时刻派上用场！",
                        npc: 200074,
                    },
                    {
                        id: 20005431,
                        content: "哒哒哒哒！",
                    },
                    {
                        id: 10010101,
                        content: "贝蕾，我……",
                        npc: 100001,
                    },
                    {
                        id: 20005411,
                        content: "你们知道魔灵吧，就是它们——虽然看起来样子各不相同，但其实都是魔灵哦，是同一种类。",
                        npc: 200074,
                    },
                    {
                        id: 20005415,
                        content:
                            "我是在书上看到，它们会利用月石的力量，为了适应不同环境，变成不同的样子。一般人以为这是魔法，害怕它们，就管他们叫做魔灵。",
                        npc: 200074,
                    },
                    {
                        id: 20005416,
                        content:
                            "比如说，如果太靠近火焰，它们就会变成暖烘烘的“打火鸡”。如果在黑暗里待太久，它就会为了把自己藏起来，变成黑黢黢的“紫纱黑云”。",
                        npc: 200074,
                    },
                    {
                        id: 20005417,
                        content:
                            "但正因为它们能使用月石的力量，所以好像就被一群人盯上了，似乎是打定主意，捕捉魔灵，但，我也不知道他们要干什么……",
                        npc: 200074,
                    },
                    {
                        id: 20005418,
                        content: "所以这几天我就一直守在附近，想让他们吃一点苦头。",
                        npc: 200074,
                    },
                    {
                        id: 20005419,
                        content: "明白了，他们追捕魔灵，你追捕他们，所以你就是魔灵猎人猎人！",
                        npc: 200002,
                    },
                    {
                        id: 20005420,
                        content: "魔灵猎人猎人……有点绕口呢，不过倒也没错，这些魔灵猎人现在一看到我就跑，嘿嘿。",
                        npc: 200074,
                    },
                    {
                        id: 20005421,
                        content: "接下来你们要是再遇到这些坏家伙，记得通知我哦，你们也都快回家吧，可不要再被那些魔灵猎人抓到了哦。",
                        npc: 200074,
                    },
                    {
                        id: 20005422,
                        content:
                            "咦？这只魔灵在这里一动不动的，难道是受伤了？唔……我总是在野外跑来跑去，也没法好好照顾它……{性别：大哥哥|大姐姐}，能拜托你吗？",
                        npc: 200074,
                    },
                    {
                        id: 20005423,
                        content:
                            "来，给你这个，妙罐罐！所有魔灵都喜欢的东西，只要一罐，唔，运气不好的话要许多罐，总之，有它，魔灵就会跟着你走啦。",
                        npc: 200074,
                    },
                ],
            },
            {
                id: 20010306,
                dialogues: [
                    {
                        id: 20005425,
                        content: "哒哒……？",
                    },
                    {
                        id: 20005426,
                        content: "没错，就是这样，{性别：大哥哥|大姐姐}真厉害！好像这只小家伙也很喜欢你哦，你看，立刻就精神了好多！",
                        npc: 200074,
                    },
                    {
                        id: 20005427,
                        content: "哒哒！哒哒哒！",
                    },
                    {
                        id: 20005428,
                        content: "你在吵闹什么呀，小东西？",
                        npc: 200002,
                    },
                    {
                        id: 20005429,
                        content: "它在和{nickname}说话呢。",
                        npc: 200074,
                    },
                    {
                        id: 20005430,
                        content: "这只魔灵说，它莫名觉得你身上有种亲切的感觉，它想和你一起走！你来保护它，它也能在关键时刻派上用场！",
                        npc: 200074,
                    },
                    {
                        id: 20005431,
                        content: "哒哒哒哒！",
                    },
                ],
            },
        ],
    },
    {
        id: 200104,
        quests: [
            {
                id: 20010401,
                dialogues: [
                    {
                        id: 20005601,
                        content:
                            "最近有好几位狩月人说在城外目击了一个小女孩与一只非常巨大的猪。我记得你们前一阵子好像也提到过什么巨猪，你们应该清楚是怎么一回事吧？",
                        npc: 700248,
                    },
                    {
                        id: 20005602,
                        content: "是的，小女孩的名字是松露，巨猪是她的好朋友，叫做榛子。",
                        npc: 100001,
                    },
                    {
                        id: 20005603,
                        content: "松露与榛子……嗯，我知道了。我听说她最近一段时间都在追捕一群捕猎魔灵的人，还自称什么魔灵猎人猎人。",
                        npc: 700248,
                    },
                    {
                        id: 20005604,
                        content:
                            "是我给她起的名字哦！认识她之后，我和小仆从找到了许多魔灵伙伴呢。但这已经过去很久了，她怎么还没有回家？小仆从，我们再去城外去看看吧？",
                        npc: 200002,
                    },
                ],
            },
            {
                id: 20010402,
                dialogues: [
                    {
                        id: 20005701,
                        content: "松露，松露！",
                        npc: 200002,
                    },
                    {
                        id: 20005702,
                        content: "呀，白，还有{性别：大哥哥|大姐姐}，你们好呀，好久不见！",
                        npc: 200074,
                    },
                    {
                        id: 20005703,
                        content: "是有一段时间没见啦！所以我们以为你早就回家啦，但是听说你还在冰湖城外，所以来看一看是怎么回事。",
                        npc: 200002,
                    },
                    {
                        id: 20005704,
                        content: "唔，原来是这样，谢谢你们关心我！其实呢我是发现，那些魔灵猎人的老巢应该就在冰湖城里，所以想要进城。",
                        npc: 200074,
                    },
                    {
                        id: 20005705,
                        content:
                            "可是城门口的看守一直凶巴巴的，不让我进去，我一靠近，他们就会像受了惊吓的小狗一样大叫什么“通行证——”之类的话。",
                        npc: 200074,
                    },
                    {
                        id: 20005706,
                        content: "所以，我就只能在城外守着他们了，可是我也没法在这里待太久……",
                        npc: 200074,
                    },
                    {
                        id: 20005707,
                        content: "听起来，不让他们彻底改正的话，他们就一定还会在你离开之后继续干坏事。",
                        npc: 200002,
                    },
                    {
                        id: 20005708,
                        content: "我倒是有一个主意，能把你带进城里，只是需要你稍微表演一下……",
                        npc: 100001,
                    },
                    {
                        id: 20005709,
                        content: "喔，真不愧是{nickname}，这么快就有主意了。快讲讲，什么法子？",
                        npc: 200002,
                    },
                    {
                        id: 20005710,
                        content: "如何将松露带进冰湖城，这个问题可谓非常简单，分三步：第一步，打开水仙平原的大门。第二步，向卡米拉求助。",
                    },
                ],
            },
            {
                id: 20010403,
                dialogues: [
                    {
                        id: 20005711,
                        content: "你是说，让我带着非常显眼的一人一猪，没有通行证，进入冰湖城，教训捕捉魔灵的坏人？",
                        npc: 700248,
                    },
                    {
                        id: 20005712,
                        content: "是的……卡米拉女士，我相信你的实力，这对你来说应该轻而易举才是。",
                        npc: 100001,
                    },
                    {
                        id: 20005713,
                        content:
                            "我是一个生意人，不是慈善家，按理来说我不应该答应你的这个荒诞请求。但你提到她自称松露，而猪的名字是榛子，又来自很远的地方。",
                        npc: 700248,
                    },
                    {
                        id: 20005714,
                        content: "这和我所知的某些信息完全一致。那么，卖她一个人情也无妨，只是进城之后的安危，我可管不了。",
                        npc: 700248,
                    },
                    {
                        id: 200057151,
                        content: "……",
                        npc: 200086,
                    },
                    {
                        id: 200057152,
                        content: "……",
                        npc: 700248,
                    },
                    {
                        id: 200057153,
                        content: "……",
                        npc: 700248,
                    },
                    {
                        id: 20005716,
                        content: "谢谢你，卡米拉女士。我刚刚有点紧张，把你交待的维瓦尔酒庄说成了瓦瓦瓦酒庄，呜……",
                        npc: 200074,
                    },
                    {
                        id: 20005717,
                        content: "小事，他们的注意力全被我塞给他们的酒吸引了，说什么他们都听不进去的。",
                        npc: 700248,
                    },
                    {
                        id: 20005719,
                        content: "你终于进来啦，松露，欢迎你！",
                        npc: 200002,
                    },
                    {
                        id: 20005720,
                        content: "嘿嘿，没想到那些凶巴巴的看守在卡米拉女士面前都乖乖巧巧，和魔灵差不多。",
                        npc: 200074,
                    },
                    {
                        id: 20005721,
                        content: "啊，说到魔灵，我们得去找那些坏人了，冰湖城可比我想象中大多了，得抓紧时间才行。",
                        npc: 200074,
                    },
                    {
                        id: 20005722,
                        content: "你有头绪吗？",
                        npc: 100001,
                    },
                    {
                        id: 20005723,
                        content: "我有头猪——可靠的榛子。它嗅觉可灵敏啦，可以闻到附近魔灵们在哪里出没，应该能在附近逮到那些魔灵猎人！",
                        npc: 200074,
                    },
                    {
                        id: 20005715,
                        content: "于是，将松露带进冰湖城的第三步是：关上水仙平原的大门。",
                    },
                ],
            },
            {
                id: 20010404,
                dialogues: [
                    {
                        id: 20005801,
                        content: "走吧，先往高处走，魔灵的气味更容易传到高处。",
                        npc: 200074,
                    },
                    {
                        id: 20005802,
                        content: "啊，榛子闻到了，在那里！",
                        npc: 200074,
                    },
                    {
                        id: 20005803,
                        content: "是这里……但没有魔灵，只有……",
                        npc: 200074,
                    },
                    {
                        id: 20005804,
                        content: "这是他们陷阱的痕迹，好可恶，他们应该已经走了。",
                        npc: 200074,
                    },
                    {
                        id: 20005805,
                        content: "那接下来我们去人少一点的地方，气味会明显一些。",
                        npc: 200074,
                    },
                    {
                        id: 20005901,
                        content: "这里这里，{性别：大哥哥|大姐姐}别着急，慢点一点走，别滑倒啦。",
                        npc: 200074,
                    },
                    {
                        id: 20005902,
                        content: "呃……这里也是一样，有人布设过陷阱。",
                        npc: 200074,
                    },
                    {
                        id: 20005903,
                        content: "哼唧……",
                        npc: 200086,
                    },
                    {
                        id: 20005904,
                        content: "榛子别丧气，我们再试试下一处地方。",
                        npc: 200074,
                    },
                    {
                        id: 20006001,
                        content: "这里是……下水道入口？",
                        npc: 100001,
                    },
                    {
                        id: 20006002,
                        content: "嗯，这附近有很多水汽，而又没什么人，肯定会有魔灵出没的。",
                        npc: 200074,
                    },
                    {
                        id: 20006003,
                        content: "不过，刚刚那两处地方的魔灵都被抓走了，有点担心这里也……",
                        npc: 200074,
                    },
                    {
                        id: 20006004,
                        content: "啊，是还没被收走的陷阱！里面还有一只魔灵！",
                        npc: 200002,
                    },
                    {
                        id: 20006005,
                        content: "太好了，这次总算赶上了。先把它放出来，再等那些魔灵猎人出现吧。",
                        npc: 200074,
                    },
                    {
                        id: 20006101,
                        content: "他们回下水道里了，走，快跟上。",
                        npc: 200002,
                    },
                    {
                        id: 20006102,
                        content: "小声点，别兴高采烈的，如果惊动了魔灵猎人，那只魔灵要是会说话，一定会骂你笨蛋的。",
                        npc: 100001,
                    },
                    {
                        id: 20006103,
                        content: "哼，才不会，我刚刚那么关心它，一定给它留下了好印象！",
                        npc: 200002,
                    },
                    {
                        id: 20006104,
                        content: "噗哧……你们啊……虽然我年纪不大，但是带着榛子也见过很多人了，但像你们这样，在意魔灵想法的人可不多。",
                        npc: 200074,
                    },
                    {
                        id: 20006105,
                        content: "要是每个人都像你们一样，意识到动物和魔灵也是有自己喜好的，就不会有魔灵猎人了！",
                        npc: 200074,
                    },
                    {
                        id: 20006106,
                        content: "走吧走吧，这一次我一定要让他们彻底知错！",
                        npc: 200074,
                    },
                    {
                        id: 20006032,
                        content: "好想现在就揍他们一顿，不过算了，等会儿有他们好看的！",
                        npc: 200002,
                    },
                    {
                        id: 20006033,
                        content: "本来以为冰湖城里的魔灵已经快被抓完了，没想到还有收获。",
                        npc: 200075,
                    },
                    {
                        id: 20006034,
                        content: "还是得出城啊，出城才能抓到更多。也不知道那个骑猪的小女孩什么时候才走。",
                        npc: 200087,
                    },
                    {
                        id: 20006035,
                        content: "别急嘛，我就不信了，捱上半个月，她还能在那里守着。",
                        npc: 200075,
                    },
                    {
                        id: 20006036,
                        content: "也是，天寒地冻的还有秽兽，说不定明天她就哭着鼻子回家啦。",
                        npc: 200087,
                    },
                    {
                        id: 20006037,
                        content: "最好这样！",
                        npc: 200075,
                    },
                    {
                        id: 20006006,
                        content: "一阵手忙脚乱，困在陷阱里的魔灵被救了出来，但它的态度好像……不是非常友好。",
                    },
                    {
                        id: 20006007,
                        content: "别害怕了小魔灵，本魔王大人以及小跟班，还有魔灵猎人猎人是来解救你们的，现在你自由了，远离这里吧！",
                        npc: 200002,
                    },
                    {
                        id: 20006008,
                        content: "咿咿呀——",
                        npc: 820000,
                    },
                    {
                        id: 20006009,
                        content: "不必如此激动，这都是我们应该做的——话说回来，有点眼熟诶？这只魔灵是不是在冰湖城外就被我们救过一次？",
                        npc: 200002,
                    },
                    {
                        id: 20006010,
                        content:
                            "你们也都快回家吧，可不要再被那些魔灵猎人抓到了哦，在我能被称为真正的魔灵猎人猎人之前，你们还是要小心一点才是。",
                        npc: 200074,
                    },
                    {
                        id: 20006011,
                        content: "看起来确实……很像。",
                        npc: 100001,
                    },
                    {
                        id: 20006012,
                        content: "咿咿咿呀——",
                        npc: 820000,
                    },
                    {
                        id: 20006013,
                        content: "哎呀，别乱叫了，快走快走。下一次再被抓的话，可就不一定有这么好的运气了。",
                        npc: 200002,
                    },
                    {
                        id: 20006014,
                        content: "我看……这只魔灵不太聪明嘛，和它说了这么多，都还不走。",
                        npc: 200002,
                    },
                    {
                        id: 20006016,
                        content: "诶？怎么又钻到陷阱里去了？这只魔灵，是不是太害怕我们，所以把陷阱当做是安全的地方了？",
                        npc: 200002,
                    },
                    {
                        id: 20006017,
                        content:
                            "唔，不应该呀，我们明明救过它，并且也没有表现出敌意。魔灵们虽然不会说话，但是是能分清楚谁对它好，谁对它坏的。",
                        npc: 200074,
                    },
                    {
                        id: 20006018,
                        content: "我想想……榛子有没有像这样，做的事我一开始完全无法理解的时候……",
                        npc: 200074,
                    },
                    {
                        id: 20006019,
                        content:
                            "一次非得去看起来光秃秃的山谷里，后来才知道是因为它闻到了山谷深处有许多浆果……一次是停在花店门口不走，等我买了花，它就开心地一口吃掉……",
                        npc: 200074,
                    },
                    {
                        id: 20006020,
                        content: "还有一次，是它丢下我，拼命往山坡上跑，是因为附近的草丛里有蛇……它想把蛇引开……",
                        npc: 200074,
                    },
                    {
                        id: 20006021,
                        content: "嗯……都是因为有很在意的事情……魔灵会在意什么呢？食物……还有伙伴！",
                        npc: 200074,
                    },
                    {
                        id: 20006022,
                        content: "伙伴……我明白了！如果猜得没错的话，那些魔灵猎人的藏身之处就在下水道里。",
                        npc: 100001,
                    },
                    {
                        id: 20006023,
                        content: "在这里能嗅到其他被抓的魔灵的气息，所以它才不愿意离开。",
                        npc: 100001,
                    },
                    {
                        id: 20006024,
                        content: "很有可能噢，那这样一来的话，我们就可以在边上等着，要是那些魔灵猎人出现了，就跟着他们，狠狠教训他们一顿！",
                        npc: 200074,
                    },
                    {
                        id: 20006025,
                        content: "嗯嗯嗯！",
                        npc: 700251,
                    },
                    {
                        id: 20006026,
                        content: "唔，该说这只魔灵是聪明还是笨呢？能想着要去找伙伴，算得上是聪明吧，但又自己进到陷阱里，有点笨笨的。",
                        npc: 200002,
                    },
                    {
                        id: 20006027,
                        content: "说不定它是看到我们，才故意又进到陷阱里，让我们好跟踪呢。",
                        npc: 200074,
                    },
                    {
                        id: 20006028,
                        content: "真的假的？我觉得——",
                        npc: 200002,
                    },
                    {
                        id: 20006029,
                        content: "哎？不错啊，真抓到了一只。",
                        npc: 200075,
                    },
                    {
                        id: 20006030,
                        content: "是魔灵猎人，快躲起来。",
                        npc: 100001,
                    },
                    {
                        id: 20006031,
                        content: "好！",
                        npc: 200074,
                    },
                    {
                        id: 20006015,
                        content: "啪叽——",
                    },
                ],
            },
            {
                id: 20010406,
                dialogues: [
                    {
                        id: 20006201,
                        content: "唔，原来这里的下水道这么复杂。榛子，能闻到魔灵的味道吗？",
                        npc: 200074,
                    },
                    {
                        id: 20006202,
                        content: "哼唧……",
                        npc: 200086,
                    },
                    {
                        id: 20006203,
                        content: "味道太多了反而无法分辨方向？唔，只能先向前走了。",
                        npc: 200074,
                    },
                    {
                        id: 20006204,
                        content: "跟着我走就好，我对这里可熟悉了。",
                        npc: 200002,
                    },
                    {
                        id: 20006205,
                        content: "咦，原来小白平时住在这种地方吗？",
                        npc: 200074,
                    },
                    {
                        id: 20006206,
                        content: "不……不是的，只是身为魔王大人，之前来过这里巡视过几次，远来的魔灵猎人猎人哟，跟紧了。",
                        npc: 200002,
                    },
                    {
                        id: 20006207,
                        content: "好~",
                        npc: 200074,
                    },
                    {
                        id: 20006301,
                        content: "啊，这个痕迹，之前巡视的时候可没有见到过。",
                        npc: 200002,
                    },
                    {
                        id: 20006302,
                        content: "看起来像是被抓的那个魔灵留下来的，跟着这个痕迹吧。",
                        npc: 200074,
                    },
                    {
                        id: 20006401,
                        content: "痕迹越来越新，应该不远了……",
                        npc: 200074,
                    },
                    {
                        id: 20006402,
                        content: "我好像听见有人在说话——",
                        npc: 200002,
                    },
                    {
                        id: 20006501,
                        content: "我跟你说，这只魔灵……据说是所有魔灵里最聪明、最稀有、也是所有魔灵的最初形态——潘神。",
                        npc: 200075,
                    },
                    {
                        id: 20006502,
                        content: "最聪明？真的假的？真要是最聪明，怎么会被我们抓到？",
                        npc: 200087,
                    },
                    {
                        id: 20006503,
                        content: "你什么意思？你是说我们很笨，所以不可能抓到最聪明的魔灵？",
                        npc: 200075,
                    },
                    {
                        id: 20006504,
                        content: "我……我没这个意思，老大你可聪明了，要不是靠着你做的陷阱，我们怎么能抓到这么多魔灵。",
                        npc: 200087,
                    },
                    {
                        id: 20006505,
                        content: "那是，你看，咱们已经抓了这么多魔灵，慢慢来研究，总能找出从它们身上炼出月石的方法，写出论文来。",
                        npc: 200075,
                    },
                    {
                        id: 20006506,
                        content: "到时候，我看谁还敢嘲笑我是炼金院的肄业生！",
                        npc: 200075,
                    },
                    {
                        id: 20006507,
                        content: "老大，我对论文什么的不感兴趣，能分点银币给我就好了。",
                        npc: 200087,
                    },
                    {
                        id: 20006508,
                        content: "好说，都好说。",
                        npc: 200075,
                    },
                    {
                        id: 20006509,
                        content: "我觉得，不怎么好说。",
                        npc: 100001,
                    },
                    {
                        id: 20006510,
                        content: "你们是……",
                        npc: 200075,
                    },
                    {
                        id: 20006511,
                        content: "我乃纯白之救赎，光之魔王大人！",
                        npc: 200002,
                    },
                    {
                        id: 20006512,
                        content: "我……我乃魔灵猎人猎人，粮秣专员松露！以及粮秣特别专员，榛子！",
                        npc: 200074,
                    },
                    {
                        id: 20006513,
                        content: "哼哼！",
                        npc: 200086,
                    },
                ],
            },
            {
                id: 20010407,
                dialogues: [
                    {
                        id: 20006701,
                        content: "{nickname}大人，魔灵猎人猎人大人，还有光之魔王大人，我错了，我们错了。这些魔灵我们都不要了，饶了我们。",
                        npc: 200087,
                    },
                    {
                        id: 20006702,
                        content: "诶？不用这么害怕，只要你们保证以后不再乱捉魔灵，我和榛子就不会把你们怎么样的。",
                        npc: 200074,
                    },
                    {
                        id: 20006703,
                        content: "一定，一定。",
                        npc: 200075,
                    },
                    {
                        id: 20006704,
                        content: "我也一定不捉魔灵了！也监督老大，要是老大又开始抓魔灵，我第一个告诉你们！",
                        npc: 200087,
                    },
                    {
                        id: 20006705,
                        content: "好，那么你们也需要向它们道歉。",
                        npc: 200074,
                    },
                    {
                        id: 20006706,
                        content:
                            "非常抱歉！是我利欲熏心，本来想要研究魔灵，却怎么都写不出论文，所以动起了歪心思……你们来捕猎我吧，让我这个魔灵猎人体验魔灵猎人……",
                        npc: 200075,
                    },
                    {
                        id: 20006708,
                        content: "咿咿。",
                        npc: 700251,
                    },
                    {
                        id: 20006709,
                        content: "唔，看你们这么诚恳，姑且相信你们吧。那么，接下来，{nickname}，小白，我们得想办法安置这些魔灵。",
                        npc: 200074,
                    },
                    {
                        id: 20006710,
                        content: "这么多魔灵，应该没法带出冰湖城，直接放生的话，它们也会因为附近没有月石这样的能量来源陷入困境……",
                        npc: 200074,
                    },
                    {
                        id: 20006711,
                        content: "怎么会这样……也就是说尽管我们救了它们，但还是不能确保它们一定都能活下来是吗？",
                        npc: 200002,
                    },
                    {
                        id: 20006712,
                        content:
                            "是的，除非有足够多的月石……可是这么多的魔灵，除非冰湖城每户人家都拿出一块月石来……可是一般人都很害怕魔灵的，肯定不愿意这么做……",
                        npc: 200074,
                    },
                    {
                        id: 20006713,
                        content: "哼哼……",
                        npc: 200086,
                    },
                    {
                        id: 20006714,
                        content: "嗯……得想想办法……",
                        npc: 100001,
                    },
                    {
                        id: 20006715,
                        content: "虽然我还没有亲眼见到，但是一想到这件事可能是真的，就觉得非常可怕！",
                        npc: 200002,
                    },
                    {
                        id: 20006716,
                        content: "松露，在你的家乡，大家会害怕榛子吗？",
                        npc: 100001,
                    },
                    {
                        id: 20006717,
                        content:
                            "嗯？实话说，一开始大家没看过这么大的猪，都会有点害怕的。但是一旦知道榛子能够和我一起找到很多食物，非常能干，就不害怕了。",
                        npc: 200074,
                    },
                    {
                        id: 20006718,
                        content: "是的，觉得害怕是因为不够了解，如果让大家了解魔灵的能力，获得魔灵的帮助，就一定不会害怕了。",
                        npc: 100001,
                    },
                    {
                        id: 20006719,
                        content: "松露，白，我们一起把这些魔灵带到水仙平原去。",
                        npc: 100001,
                    },
                ],
            },
            {
                id: 20010408,
                dialogues: [
                    {
                        id: 20006901,
                        content: "又过了一段时间，卡米拉的眉头终于缓缓舒展开来……",
                    },
                    {
                        id: 20006902,
                        content: "哟，卡米拉，给我来一杯“打火鸡特调”，这么冷的天来上一口，再合适不过了。",
                        npc: 700253,
                    },
                    {
                        id: 20006903,
                        content: "一开始我觉得这小东西很邪门，没想到喷出的火焰拿来温酒，绝了！",
                        npc: 700253,
                    },
                    {
                        id: 20006904,
                        content: "可悲啊，威尔斯先生，可叹啊，威尔斯先生。",
                        npc: 700254,
                    },
                    {
                        id: 20006905,
                        content:
                            "你只知道打火鸡的火焰可以让酒水温热，暖及肚肠，却不知道它真正的价值，在于划破黑暗，在黑夜中为我点亮书本，带来灵感！",
                        npc: 700254,
                    },
                    {
                        id: 20006906,
                        content: "打，火，鸡。多么美妙的三个字，我的写作生命之光，我的创作欲念之火！我的罪恶，我的灵魂！",
                        npc: 700254,
                    },
                    {
                        id: 20007001,
                        content: "有人用雨衣水滴浇花，有人用好梦先生助眠……就连我的生意，也离不开一只打火鸡。",
                        npc: 700248,
                    },
                    {
                        id: 20007002,
                        content: "现在根本不会有人想要从魔灵身上提炼月石，反而会为了和魔灵更加亲近，专门买月石去喂养它们，挺有趣的。",
                        npc: 700248,
                    },
                    {
                        id: 20007003,
                        content: "这也是看到松露和榛子才想到的。既然榛子能和人类友好相处，那么魔灵也能。",
                        npc: 100001,
                    },
                    {
                        id: 20007004,
                        content: "而如果魔灵都能和人类友好相处，那么卡戎和索拉之民，迟早有一天也会相处融洽的。",
                        npc: 100001,
                    },
                    {
                        id: 20007005,
                        content: "哈哈，我都不好说你是天真，还是看得足够远，让我好好期待那一天的到来吧。但在那之前，该送别那一位小朋友了。",
                        npc: 700248,
                    },
                    {
                        id: 20007006,
                        content: "呜呜呜，松露，你就不能留在冰湖城吗？光之魔王大人好不容易找到一个伙伴愿意和我一起大声念出自己的称号！",
                        npc: 200002,
                    },
                    {
                        id: 20007007,
                        content:
                            "别哭呀小白，我已经出门很久啦，该回去了。再说了，那几个魔灵猎人都改行变成魔灵学者了，你可以让他们和你一起念称号呀。",
                        npc: 200074,
                    },
                    {
                        id: 20007008,
                        content: "不，他们说话没有你说话好听，也不能和你一样让榛子背着我兜风。{nickname}你也别傻站着，留一留松露呀。",
                        npc: 200002,
                    },
                ],
            },
            {
                id: 20010415,
                dialogues: [
                    {
                        id: 20006801,
                        content:
                            "最终，这些魔灵被一起带到了水仙平原，吓跑了一屋子的客人，并成功让卡米拉眉头紧锁，开始思考当初是不是不应该带{nickname}进城。",
                    },
                    {
                        id: 20006720,
                        content: "好的，榛子坐下，我们把魔灵放到你的背上，一口气都带出去。",
                        npc: 200074,
                    },
                    {
                        id: 20006721,
                        content: "嗯？又要找卡米拉吗？她呀，肯定又要嘴上说着不愿意，然后和你一起想办法了。",
                        npc: 200002,
                    },
                    {
                        id: 20006722,
                        content: "我也来帮忙！",
                        npc: 200087,
                    },
                    {
                        id: 20006723,
                        content: "还有我，还有我。",
                        npc: 200075,
                    },
                    {
                        id: 20006724,
                        content: "咿咿。",
                        npc: 700251,
                    },
                    {
                        id: 20006725,
                        content: "嗯？你不一起跟着来吗？",
                        npc: 100001,
                    },
                    {
                        id: 20006726,
                        content: "魔灵潘神一般都会和人尽可能保持距离，看起来刚刚它只是想靠你们把其他魔灵救出来。",
                        npc: 200075,
                    },
                    {
                        id: 20006727,
                        content: "好，那你也要小心。",
                        npc: 100001,
                    },
                    {
                        id: 20006728,
                        content: "咿咿咿。",
                        npc: 700251,
                    },
                ],
            },
        ],
    },
    {
        id: 200201,
        quests: [
            {
                id: 20020100,
                dialogues: [
                    {
                        id: 51000101,
                        content: "嗯，今晚就煮奶油蘑菇浓汤吧……啊呀？可爱的孩子。",
                        npc: 700020,
                    },
                    {
                        id: 51000102,
                        content: "（老妇人用她的大手重重地拍了拍你的脑袋，又捏了捏你的脸。她过分的热情甚至让你感到有些手足无措。）",
                    },
                    {
                        id: 51000103,
                        content: "来，喝了这碗奶油蘑菇汤！婶婶这是丹流城带来的手艺，你肯定没见识过。",
                        npc: 700020,
                    },
                    {
                        id: 51000104,
                        content: "（老妇人不由分说，将一碗热汤端到你面前，你总觉得下一秒，她就要掰着你的脑袋强行灌下去了——）",
                    },
                ],
            },
            {
                id: 20020105,
                dialogues: [
                    {
                        id: 51002301,
                        content: "年轻人，你有哈默尔·狄金森的消息了吗？",
                        npc: 700019,
                    },
                ],
            },
            {
                id: 20020106,
                dialogues: [
                    {
                        id: 51002320,
                        content: "孩子，你就是那位叫做{nickname}的狩月人吧。希琳夫人让我将报酬预支给你。",
                        npc: 700020,
                    },
                    {
                        id: 51002321,
                        content: "如果你在哪里听说了哈默尔·狄金森的消息，一定要快点跟夫人讲！",
                        npc: 700020,
                    },
                    {
                        id: 51002322,
                        content: "唉！她那身子从去年开始就越来越差，如今恐怕没有多少日子了。哈默尔的事情，是她的最后一桩心事……",
                        npc: 700020,
                    },
                ],
            },
            {
                id: 20020107,
                dialogues: [
                    {
                        id: 51002401,
                        content: "孩子，你就是那个叫做{nickname}的狩月人吧。希琳夫人让我将报酬转交给你。",
                        npc: 700020,
                    },
                    {
                        id: 51002402,
                        content: "唉！她那身子从去年开始就越来越差，如今恐怕没有多少日子了。哈默尔的事情，是她的最后一桩心事……",
                        npc: 700020,
                    },
                    {
                        id: 51002403,
                        content: "虽然不是什么好消息，但婶婶还是要谢谢你！圆了她最后一桩心愿。",
                        npc: 700020,
                    },
                ],
            },
        ],
    },
    {
        id: 200203,
        quests: [
            {
                id: 20020300,
                dialogues: [
                    {
                        id: 51000401,
                        content: "安妮……安妮！",
                        npc: 700006,
                    },
                    {
                        id: 51000402,
                        content: "啊啊，你回来了，我的宝贝女儿！",
                        npc: 700006,
                    },
                    {
                        id: 51000403,
                        content: "（女子拦住了你的去路。她干涸而涣散的双眼在你身上四处游走着，似乎在拼尽全力从你身上找寻什么。）",
                    },
                ],
            },
            {
                id: 20020305,
                dialogues: [
                    {
                        id: 10010101,
                        content: "贝蕾，我……",
                        npc: 100001,
                    },
                ],
            },
            {
                id: 20020306,
                dialogues: [
                    {
                        id: 51000801,
                        content: "你平安回来了，辛苦你了，有什么发现吗？",
                        npc: 700032,
                    },
                    {
                        id: 51000802,
                        content: "（眼前的少女无依无靠，而爱尔莎夫人也因为爱女失踪而精神失常……你不禁想，如果少女就是安妮该有多好。）",
                    },
                    {
                        id: 51000890,
                        content:
                            "（回忆起爱尔莎说过，她家只有母女俩相依为命，你脑海中突然闪过一个可怕的念头——如果你<H>从未见过</>爱丽丝的日记……）",
                    },
                    {
                        id: 51000891,
                        content:
                            "（少女将有一个温暖的小家可以依靠，而爱尔莎的“女儿”也回来了。<H>这似乎是最完美的结局——只是，这两个人同样拥有知晓真相的权利……</>）",
                    },
                    {
                        id: 51000892,
                        content: "（应该做出怎样的选择？将真相告知二人，还是这样将错就错下去？）",
                    },
                ],
            },
            {
                id: 20020309,
                dialogues: [
                    {
                        id: 51000601,
                        content: "拜托你了……",
                        npc: 700006,
                    },
                ],
            },
            {
                id: 20020310,
                dialogues: [
                    {
                        id: 51000501,
                        content: "拜托你了……",
                        npc: 700006,
                    },
                ],
            },
            {
                id: 20020312,
                dialogues: [
                    {
                        id: 51000420,
                        content: "你好，不知道您有没有见过……",
                        npc: 100001,
                    },
                    {
                        id: 51000421,
                        content: "我都看到啦。你也被那个女人认错成自己的女儿了是吧。我劝你还是不要去招惹她比较好。她……",
                        npc: 700232,
                    },
                    {
                        id: 51000422,
                        content: "（女人指了指自己的脑袋。）",
                    },
                    {
                        id: 51000423,
                        content: "她这里有问题的，在这儿站了一年了。",
                        npc: 700232,
                    },
                    {
                        id: 51000424,
                        content: "不能这么说。她一定是弄丢了女儿，太伤心了才会变成这样。",
                        npc: 100001,
                    },
                    {
                        id: 51000425,
                        content: "我劝你还是放弃吧，她女儿走了那么久，现在也没个影，能找到，早找到了。",
                        npc: 700232,
                    },
                    {
                        id: 51000426,
                        content: "谢谢，不过既然答应人家了，还是找找看吧。",
                        npc: 100001,
                    },
                ],
            },
            {
                id: 20020313,
                dialogues: [
                    {
                        id: 51000427,
                        content: "走失的女孩？我可不太清楚，不过昨天我在城门那块儿见过一个小姑娘。",
                        npc: 700233,
                    },
                    {
                        id: 51000428,
                        content: "那孩子看着奇奇怪怪的，不知是不是你要找的人。",
                        npc: 700233,
                    },
                ],
            },
            {
                id: 20020314,
                dialogues: [
                    {
                        id: 51000429,
                        content: "街对面的那名女孩，我听说她是被一名医生救下的？",
                        npc: 100001,
                    },
                    {
                        id: 51000430,
                        content: "你说那个迷迷糊糊的小姑娘？是，前几天有个叫埃莉诺的医生把她带到这儿的。",
                        npc: 700234,
                    },
                    {
                        id: 51000431,
                        content: "这位埃莉诺医生住在哪儿？",
                        npc: 100001,
                    },
                    {
                        id: 51000432,
                        content: "她是个旅行医生，不是本地人。真不巧，今天我刚好看到她出城。要不你去泪湖方向看看吧，说不定她还没走远。",
                        npc: 700234,
                    },
                ],
            },
        ],
    },
    {
        id: 200204,
        quests: [
            {
                id: 20020400,
                dialogues: [
                    {
                        id: 51001801,
                        content:
                            "嘿，我都听说了，你在格雷姆矿坑可是干了票大的。这么好的身手，要不要咱们一起做个委托，你拿八我拿二，怎么样？",
                        npc: 200015,
                    },
                ],
            },
            {
                id: 20020405,
                dialogues: [
                    {
                        id: 51001935,
                        content: "（你将面前的酒桶全部打开，转身看去，威尔斯已经挂回了熟悉的笑容，举杯畅饮了起来。）",
                    },
                    {
                        id: 51001936,
                        content: "只是那欢笑之下捧着怀表的一丝落寞，恐怕也如怀表本身一样，无法被轻易修复吧。",
                    },
                ],
            },
        ],
    },
    {
        id: 200205,
        quests: [
            {
                id: 20020501,
                dialogues: [
                    {
                        id: 51002001,
                        content: "来往的朋友，稍微停一停脚步，给上几个银币，就能获得南国海岛隐藏的惊天秘宝——的线索。",
                        npc: 700048,
                    },
                    {
                        id: 51002002,
                        content: "难道您真的就甘心每天面对冰冷的面包和变味的红酒吗？不如开始一场冒险，拥抱机遇，改变人生！",
                        npc: 700048,
                    },
                    {
                        id: 51002003,
                        content: "（眼前这位满嘴投机主义言论的老人衣着破烂，言语激昂，但是这让他看起来很不值得信任。）",
                    },
                ],
            },
            {
                id: 20020503,
                dialogues: [
                    {
                        id: 51002101,
                        content: "这里应该就是那个布鲁内托的家了。",
                        npc: 100001,
                    },
                    {
                        id: 51002102,
                        content: "这儿有个箱子，里面会有什么能捎带给他的东西吗？",
                        npc: 100001,
                    },
                    {
                        id: 51002103,
                        content: "可惜没看到钥匙，去附近找找看吧。",
                        npc: 100001,
                    },
                ],
            },
            {
                id: 20020504,
                dialogues: [
                    {
                        id: 51002104,
                        content: "从形状来看，就是这把钥匙了。",
                        npc: 100001,
                    },
                ],
            },
            {
                id: 20020505,
                dialogues: [
                    {
                        id: 51002105,
                        content:
                            "（钥匙缓缓转动，生锈的锁芯吃力地咬合着，发出刺耳的摩擦声。当箱子彻底打开，周围的秽兽也被异响吸引到了附近，拦住了你的去路。）",
                    },
                ],
            },
            {
                id: 20020507,
                dialogues: [
                    {
                        id: 51002106,
                        content:
                            "（这些秽兽并不是你的对手，但这小小的插曲让你感到了一丝熟悉，久远的回忆开始苏醒，你仿佛听到了两个小孩在这间房子前打闹的声音。）",
                    },
                    {
                        id: 51002107,
                        content: "我想起来了，小时候我和这家的小孩打过一架。名字我已经记不清了，算起来，应该是布鲁内托的孙子吧。",
                        npc: 100001,
                    },
                    {
                        id: 51002108,
                        content: "起因是什么已经想不起来了，但我还记得开打前的最后一句话是……那小鬼喊我独眼龙，我骂他是眼睛鼓鼓的大青蛙。",
                        npc: 100001,
                    },
                    {
                        id: 51002109,
                        content:
                            "哈哈，原来我也有这么口无遮拦的时候……现在想想，那时候我好像也没有那么生气，因为再怎么说，我的身边还有贝蕾在。",
                        npc: 100001,
                    },
                    {
                        id: 51002110,
                        content: "后来……好像是和好了吧？我记得我们爬到屋顶上……",
                        npc: 100001,
                    },
                ],
            },
            {
                id: 20020508,
                dialogues: [
                    {
                        id: 51002111,
                        content:
                            "啊对，就是在这儿，过了几天他拿着一袋吃的和我道歉。我本来还想骂他来着，但看着那三人份的面包，最后还是让馋虫战胜了尊严。",
                        npc: 700210,
                    },
                    {
                        id: 51002112,
                        content: "嗯……我们三个就这样坐在屋顶默默地吃着又硬又焦的面包，看着日头渐斜，大人们载着打来的鱼回村。",
                        npc: 700210,
                    },
                    {
                        id: 51002113,
                        content: "最后那小鬼噎着了，连着打了一串嗝。我们三个一起笑了，那次吵架就这么过去了。",
                        npc: 700210,
                    },
                    {
                        id: 51002114,
                        content: "四舍五入的话，我从那个时候就已经认识布鲁内托了吧。",
                        npc: 700210,
                    },
                    {
                        id: 51002115,
                        content: "如果实在什么都找不到的话，帮我带点东西回来吧，什么都行，一片草叶也行。",
                        npc: 700048,
                    },
                    {
                        id: 51002116,
                        content: "再给布鲁内托带点特产吧，这个季节的鱼我记得都很肥美。",
                        npc: 700210,
                    },
                ],
            },
            {
                id: 20020509,
                dialogues: [
                    {
                        id: 51002117,
                        content: "回去吧，这些应该能够缓解布鲁内托的乡愁了。",
                        npc: 100001,
                    },
                    {
                        id: 51002118,
                        content: "孙子通过打架认识，爷爷通过坑骗认识……哈……真是奇怪的缘分……",
                        npc: 100001,
                    },
                ],
            },
            {
                id: 20020510,
                dialogues: [
                    {
                        id: 51002117,
                        content: "回去吧，这些应该能够缓解布鲁内托的乡愁了。",
                        npc: 100001,
                    },
                    {
                        id: 51002118,
                        content: "孙子通过打架认识，爷爷通过坑骗认识……哈……真是奇怪的缘分……",
                        npc: 100001,
                    },
                ],
            },
        ],
    },
    {
        id: 200206,
        quests: [
            {
                id: 20020600,
                dialogues: [
                    {
                        id: 51002901,
                        content: "（一个嗓门奇高的人在大声念诵着什么，酒客们有一搭没一搭听着，时不时发出快活的笑声。）",
                    },
                    {
                        id: 51002902,
                        content: "来自深山的幽魂，来自冰湖的鬼魅！",
                        npc: 700015,
                    },
                    {
                        id: 51002903,
                        content: "它们在逼近！它们在逼近！",
                        npc: 700015,
                    },
                    {
                        id: 51002904,
                        content: "你来了？",
                        npc: 200003,
                    },
                    {
                        id: 51002912,
                        content: "以你的才智，这份工作看来非你莫属了。",
                        npc: 200003,
                    },
                    {
                        id: 51002911,
                        content: "别沮丧，整个冰湖城能听懂他在说什么的也不超过一个巴掌数。",
                        npc: 200003,
                    },
                ],
            },
            {
                id: 20020605,
                dialogues: [
                    {
                        id: 51003101,
                        content: "据卡米拉所说，巴克先生不胜酒力、从不喝酒，那壶里的酒难道是其他人加进去的？",
                        npc: 100001,
                    },
                    {
                        id: 51003102,
                        content: "仔细一看，这牛奶壶上还有个黏糊糊的手印……看起来那只手很小巧。",
                        npc: 100001,
                    },
                    {
                        id: 51003103,
                        content: "小小的脚印从屋外延伸至窗台，屋内还有雪化的积水。显然闯入者没有处理痕迹的意识，单纯就只是一个小孩子而已。",
                        npc: 100001,
                    },
                    {
                        id: 51003104,
                        content: "看来似乎有个小孩把酒掺在牛奶里，灌醉了巴克先生。再去找找其他线索吧。",
                        npc: 100001,
                    },
                ],
            },
            {
                id: 20020606,
                dialogues: [
                    {
                        id: 51003111,
                        content: "（售票厅旁的卡戎小孩哈着冷气，打着冷颤。不停向来往行人推销着门票、海报、啤酒和爆米花。）",
                    },
                    {
                        id: 51003112,
                        content: "（不停向路人推销商品的小孩，会是他灌醉的巴克先生吗？）",
                        npc: 100001,
                    },
                    {
                        id: 51003115,
                        content: "喝啊，我还能喝……不就是二十几瓶啤酒嘛，这才哪到哪啊！来，继续上酒继续喝！",
                        npc: 700214,
                    },
                    {
                        id: 51003116,
                        content: "（浑身酒气的大叔。会是他灌醉的巴克先生吗？）",
                        npc: 100001,
                    },
                    {
                        id: 51003113,
                        content: "巴克先生经常出入剧院，一定多次碰到并拒绝过那个小孩推销啤酒……",
                        npc: 100001,
                    },
                    {
                        id: 51003114,
                        content: "他袖口粘着的那几枚爆米花，跟我窗户下捡到的一模一样。怎么看他的嫌疑都很大，过去聊聊看吧。",
                        npc: 100001,
                    },
                    {
                        id: 51003117,
                        content: "那个爆米花……是什么味道的呀，爸爸，我想尝尝看！",
                        npc: 700215,
                    },
                    {
                        id: 51003118,
                        content: "孩子，你是个淑女，不应该吃那种垃圾食品，等看完歌剧了，爸爸带你去银色和平餐厅吃大餐。",
                        npc: 700219,
                    },
                    {
                        id: 51003119,
                        content: "好吧……",
                        npc: 700215,
                    },
                    {
                        id: 51003120,
                        content: "（出现在剧院附近的小孩，很想尝一口爆米花的样子。会是她灌醉的巴克先生吗？）",
                        npc: 100001,
                    },
                ],
            },
            {
                id: 20020608,
                dialogues: [
                    {
                        id: 51003401,
                        content: "我找到人了。",
                        npc: 100001,
                    },
                    {
                        id: 51003402,
                        content: "你将事情的来龙去脉告知给了巴克先生。",
                    },
                    {
                        id: 51003403,
                        content: "哦！我的勇士，对您道一万次的感谢！想必从今夜起，灵感女神的宠爱将重回我身！",
                        npc: 700015,
                    },
                    {
                        id: 51003404,
                        content: "至于你……我梦中的小飞贼，你可真是给了我一个莫大的意外！",
                        npc: 700015,
                    },
                    {
                        id: 51003405,
                        content: "非常抱歉，巴克先生……但请您相信我，我从没有要伤害你的意思……",
                        npc: 700080,
                    },
                    {
                        id: 51003406,
                        content: "哦，小飞贼，我知道人们在背后是怎么笑话我的，我是个卖不出作品的废物剧作家。",
                        npc: 700015,
                    },
                    {
                        id: 51003407,
                        content:
                            "就算用再优美的辞藻装饰我的言语，也换不来他们对我的欣赏，他们拒绝倾听，拒绝理解……但依我看，这世上又有几个能有话直说的人呢？",
                        npc: 700015,
                    },
                    {
                        id: 51003408,
                        content: "先生，我不明白您的意思。",
                        npc: 700080,
                    },
                    {
                        id: 51003409,
                        content:
                            "我是说，你从不把我当成一个只知道痴人说梦的蠢货，那么对于你，我也有自己的尊重，如果你无法渡过这个冬天，何不早说呢？",
                        npc: 700015,
                    },
                    {
                        id: 51003410,
                        content: "我会为你收拾出房间，如果你乐意，还能拿起我的稿纸当睡前故事，只是我不确定那些故事是否足够助眠。",
                        npc: 700015,
                    },
                    {
                        id: 51003411,
                        content: "您真的愿意收留我吗……我不值得您这样做，但我可以帮您做一些琐事，就当是我耽误您一个月创作的补偿吧……",
                        npc: 700080,
                    },
                    {
                        id: 51003412,
                        content:
                            "感谢您所做的一切，尊敬的狩月人阁下！明察秋毫的冰湖城侦探非您莫属，我收获了一个温馨的故事，也收获了两个诚挚的朋友。",
                        npc: 700015,
                    },
                    {
                        id: 51003413,
                        content: "啊！灵感纷至沓来！我得迅速回去把他们记下来，如果我的诗篇能得到传颂，千百年后人们也依然赞美着您的名字！",
                        npc: 700015,
                    },
                    {
                        id: 51003414,
                        content: "两人一起离去了，每个人都得到了他想要的，不知道巴克先生的下一部大作是否能和他说的一样精彩。",
                    },
                ],
            },
            {
                id: 20020609,
                dialogues: [
                    {
                        id: 51003105,
                        content: "你好，请问平时会有小孩子来找巴克先生玩吗？",
                        npc: 100001,
                    },
                    {
                        id: 51003106,
                        content:
                            "小孩找巴克玩？不可能不可能，哪有小孩会对那种只在<H>家里、酒馆和剧院</>三点一线，还满嘴怪话的家伙感兴趣啊。",
                        npc: 700213,
                    },
                    {
                        id: 51003107,
                        content:
                            "别说小孩了，连我们平时都很少跟他打交道，烦得要死还一句话都听不懂。他是不是犯什么事了？我跟你讲啊，我早就感觉他不是好东西了。",
                        npc: 700213,
                    },
                    {
                        id: 51003108,
                        content:
                            "（老妇人滔滔不绝地数落着巴克，诸如这么大了没有正经工作，一天到晚不出门，没老婆没朋友。一直到她讲得口干舌燥，你才找到机会离开。）",
                    },
                    {
                        id: 51003109,
                        content:
                            "（巴克先生深居简出没有社交，大部分人都不了解他。所以会想到用酒来灌醉巴克先生的小孩子，一定是从什么地方知道了这个秘密……）",
                        npc: 100001,
                    },
                    {
                        id: 51003110,
                        content: "（水仙平原不招揽小孩子，家附近也没有小孩找巴克先生……那么就只剩下剧院了，过去看看吧。）",
                        npc: 100001,
                    },
                    {
                        id: 51003104,
                        content: "看来似乎有个小孩把酒掺在牛奶里，灌醉了巴克先生。再去找找其他线索吧。",
                        npc: 100001,
                    },
                ],
            },
        ],
    },
    {
        id: 200207,
        quests: [
            {
                id: 20020700,
                dialogues: [
                    {
                        id: 51003501,
                        content: "感谢牺牲、感谢慈悲、感谢银色和平，让我们远离瘟疫，让我们远离蒙昧，让我们远离恶魔的威胁……",
                        npc: 700086,
                    },
                    {
                        id: 51003520,
                        content: "下面由艾玛献上纪念的花……",
                        npc: 700086,
                    },
                    {
                        id: 51003502,
                        content: "艾玛？艾玛？你在发什么楞？",
                        npc: 700086,
                    },
                    {
                        id: 51003503,
                        content: "抱歉老师！我这就来！",
                        npc: 700016,
                    },
                    {
                        id: 510035031,
                        content: "艾玛匆忙将花放在指定地点，并按流程献上了感谢致辞，但她的走神还是引起了老师的嘀咕。",
                    },
                    {
                        id: 51003504,
                        content: "你这孩子最近怎么魂不守舍的，下次可不能这样了。",
                        npc: 700086,
                    },
                    {
                        id: 510035041,
                        content: "好了，下面就是自由活动时间，半个小时后还在雕像下集合，千万别走太远了。",
                        npc: 700086,
                    },
                    {
                        id: 510035042,
                        content: "（纪念活动结束后，艾玛还是一个人发呆，时不时喃喃自语着什么。）",
                    },
                ],
            },
            {
                id: 20020703,
                dialogues: [
                    {
                        id: 51003601,
                        content: "谢谢你，婆婆，我觉得好多了，如果这是罗伯期望的，我会为了他好好生活。",
                        npc: 700087,
                    },
                    {
                        id: 51003602,
                        content: "希望你早日走出悲痛，我们与你同在，孩子，如果你需要，贝琳达的小屋永远为你开放。",
                        npc: 700081,
                    },
                    {
                        id: 51003630,
                        content: "陌生的卡戎虽然还挂着泪痕，但你能从他的眼中看出，他已经燃起了活下去的勇气。",
                    },
                    {
                        id: 51003631,
                        content: "他与贝琳达拥抱后，依依不舍地离去了。",
                    },
                ],
            },
            {
                id: 20020705,
                dialogues: [
                    {
                        id: 51003705,
                        content: "嗯……这样应该就差不多了！",
                        npc: 100001,
                    },
                    {
                        id: 51003706,
                        content: "打打打打打劫！你怀里的宝贝是我的啦！",
                        npc: 700206,
                    },
                    {
                        id: 51003707,
                        content: "（皎皎之民的身影猛地从一旁窜出，一把抢过你怀中的铁丝，一边跑一边回头嘲笑着你。）",
                    },
                    {
                        id: 51003708,
                        content: "总算被我逮到机会了，这次我我我终于成功啦，哈哈哈哈哈哈哈！",
                        npc: 700206,
                    },
                    {
                        id: 51003709,
                        content: "（就算不知道贝琳达要这些铁丝做什么用，你也不打算让手中的东西被白白抢走，追上去好好教训她一番吧。）",
                    },
                ],
            },
            {
                id: 20020707,
                dialogues: [
                    {
                        id: 51003721,
                        content: "打打打打打劫皎皎已逃走，任务失败，请重新开始。",
                    },
                    {
                        id: 51003711,
                        content: "为了一堆破铜烂铁，至于打成这样嘛呜呜呜呜……",
                        npc: 700206,
                    },
                    {
                        id: 51003712,
                        content: "费了一些周折，你总算拿回了属于你的铁丝。检查无误再一抬头，发现那只皎皎早已不见了踪影。",
                    },
                    {
                        id: 51003713,
                        content: "你无奈地摇摇头，向着贝琳达的帐篷动身。",
                    },
                ],
            },
        ],
    },
    {
        id: 200208,
        quests: [
            {
                id: 20020803,
                dialogues: [
                    {
                        id: 51005034,
                        content: "（箱子打开，女仆取出了恩里克的遗嘱，在你的见证之下，她庄重地诵读着。）",
                    },
                    {
                        id: 51005035,
                        content: "（恩里克也许早就预料到了今天的悲剧，他的遗嘱仍然冷静，只有对女儿的死亡仍旧遗憾，以及——）",
                    },
                    {
                        id: 51005036,
                        content: "“在我死后，本人名下的所有房屋产权将移交给莱娜·贝尔女士——”",
                        npc: 700013,
                    },
                    {
                        id: 51005037,
                        content: "“以感谢她多年来对修普诺斯之家及卡戎病人的付出。”",
                        npc: 700013,
                    },
                    {
                        id: 51005038,
                        content: "“由衷感谢贝尔女士所做的一切，她是一位令人尊敬的女士。”",
                        npc: 700013,
                    },
                    {
                        id: 51005039,
                        content: "…………",
                        npc: 700013,
                    },
                    {
                        id: 510050391,
                        content: "收下吧，由我见证，这把钥匙将一直属于你。",
                        npc: 100001,
                    },
                    {
                        id: 51005040,
                        content: "你独自走出了恩里克的办公室。泣不成声的莱娜女士需要独处一会，至少在这段时间，不要打断她的悲伤。",
                    },
                    {
                        id: 51005041,
                        content: "现在，你有一位新的房东太太了。",
                    },
                    {
                        id: 51005042,
                        content: "（莱娜女士熟悉修普诺斯之家的一草一木，你们顺利地找到箱子，而在箱子边，放着一个突兀的木盒。）",
                    },
                    {
                        id: 51005043,
                        content: "（你先打开了那奇怪的木盒，一张笔迹娟秀的信出现在你们眼前，你将信拿出，一字一句地念了出来。）",
                    },
                ],
            },
        ],
    },
    {
        id: 200209,
        quests: [
            {
                id: 20020901,
                dialogues: [
                    {
                        id: 51004935,
                        content: "不想活了是不是？交出来！",
                        npc: 700225,
                    },
                    {
                        id: 51004936,
                        content: "让老子看看你又在写什么好东西——",
                        npc: 700226,
                    },
                    {
                        id: 51004937,
                        content: "上次是喉咙不听使唤，这次是什么？眼？手爪子？",
                        npc: 700225,
                    },
                    {
                        id: 51004938,
                        content: "啊……啊啊！",
                        npc: 700010,
                    },
                    {
                        id: 51004939,
                        content:
                            "（被恶徒包围的女人慌忙捡着地上的纸张，紧咬着下嘴唇，脸色苍白，眼神恐惧。你不清楚他们的关系，但你知道女人正处于危险之中。）",
                    },
                ],
            },
            {
                id: 20020902,
                dialogues: [
                    {
                        id: 51004941,
                        content: "（露娜慌忙向你鞠了鞠躬，似是感谢，又接着焦急地开始收拾地上散落的纸。）",
                    },
                    {
                        id: 51004942,
                        content: "你还好吧？这些纸是什么？",
                        npc: 100001,
                    },
                    {
                        id: 51004943,
                        content: "啊……呜呜！",
                        npc: 700010,
                    },
                    {
                        id: 51004944,
                        content: "（你注意到，那些纸上写着“药方”……也许这个女人与<H>玛尔洁给的某个线索</>有关？）",
                    },
                ],
            },
            {
                id: 20020903,
                dialogues: [
                    {
                        id: 51004945,
                        content: "唔……唔唔。",
                        npc: 700010,
                    },
                    {
                        id: 51004946,
                        content: "（女人面带微笑，似是在表达谢意。）",
                        npc: 700010,
                    },
                    {
                        id: 51004947,
                        content: "我曾经认识一名医生，虽然他现在不在冰湖城了，但我可以尝试去他曾经的住所帮你找找有没有合适的药方。",
                        npc: 100001,
                    },
                    {
                        id: 51004948,
                        content: "呜……",
                        npc: 700010,
                    },
                    {
                        id: 51004949,
                        content:
                            "（露娜低下头，她似乎知道自己的嗓子铁定是没救的。但她再次抬头的时候眼中却闪了闪希望的光芒，好像在说：“万一呢？”）",
                    },
                ],
            },
            {
                id: 20020904,
                dialogues: [
                    {
                        id: 51004950,
                        content: "呜……哇啊！",
                        npc: 700010,
                    },
                    {
                        id: 51004951,
                        content: "（女人警惕地看着你，拼命摇着头，似乎是在说“我真的没有钱了”。）",
                        npc: 700010,
                    },
                    {
                        id: 51004952,
                        content: "唉，别那么紧张，这次我是来帮忙的。就那么白拿你的也不是我的作风。",
                        npc: 100001,
                    },
                    {
                        id: 51004953,
                        content: "我曾经认识一名医生，虽然他现在不在冰湖城了，但我可以尝试去他曾经的住所帮你找找有没有合适的药方。",
                        npc: 100001,
                    },
                    {
                        id: 51004954,
                        content: "（露娜的脸上写满了疑惑——现在的她并不是那么信任你。）",
                    },
                ],
            },
            {
                id: 20020905,
                dialogues: [
                    {
                        id: 51004956,
                        content:
                            "（冰湖城总会有些古怪的感冒像大风一样刮过，虽然来得快去得也快，但孩子们生病时总归是很难受的。————感冒速效药）",
                    },
                    {
                        id: 51004957,
                        content: "感觉不是这个。",
                        npc: 100001,
                    },
                    {
                        id: 51004959,
                        content: "（古里古怪的药方，本是某种抗秽蚀药物的失败品。后续测试发现对一些疑难杂症却有奇效。）",
                    },
                    {
                        id: 51004960,
                        content: "感觉不是这个。",
                        npc: 100001,
                    },
                    {
                        id: 51004962,
                        content: "（有些人或因饥饿误食过莲草，若中毒不深，这种药剂可以中和他们体内的毒素——莲草解毒剂）",
                    },
                    {
                        id: 51004964,
                        content: "（获得或许能治疗嗓子的药方）",
                    },
                    {
                        id: 51004963,
                        content: "怎么掉在地上了，这个说不定用得上！",
                        npc: 100001,
                    },
                ],
            },
            {
                id: 20020906,
                dialogues: [
                    {
                        id: 51004965,
                        content: "如果有一天你的嗓子真的治好了，你打算唱些什么呢？",
                        npc: 100001,
                    },
                    {
                        id: 51004966,
                        content: "（露娜低下头，似是陷入了长长的思索。）",
                    },
                    {
                        id: 51004967,
                        content: "“唱我心中所想，即使以喉咙为代价。”",
                    },
                    {
                        id: 51004968,
                        content: "你意识到手中的这份治疗嗓子的药方，一旦真的有效，反而会让这位吟游诗人陷入更加危险的境地。",
                    },
                ],
            },
        ],
    },
    {
        id: 200210,
        quests: [
            {
                id: 20021002,
                dialogues: [
                    {
                        id: 51004501,
                        content: "没有女人，只有秽兽，全清完了。还是说这光秃秃的地皮也要我给铲了？",
                        npc: 100001,
                    },
                    {
                        id: 51004502,
                        content: "嘴皮子还挺厉害，没找到我说的女人你就不奇怪吗？",
                        npc: 700101,
                    },
                    {
                        id: 51004503,
                        content: "你说地方，我清完，委托只是这样而已。",
                        npc: 100001,
                    },
                    {
                        id: 51004504,
                        content: "专业，这才是狩月人该有的样子。抱歉试探了一下你，做我们这行的，总得多留个心眼。",
                        npc: 700101,
                    },
                    {
                        id: 51004505,
                        content: "去这张纸上的位置吧，和之前一样，除了女人之外的东西全清了。",
                        npc: 700101,
                    },
                ],
            },
            {
                id: 20021004,
                dialogues: [
                    {
                        id: 51004301,
                        content: "行啊，收了钱就走吧，我不希望在这附近见到你。",
                        npc: 700101,
                    },
                    {
                        id: 51004302,
                        content: "你是想找人清理附近的秽兽？就算不雇佣我，也会有人处理那些秽兽的。",
                        npc: 100001,
                    },
                    {
                        id: 51004303,
                        content: "有人处理？谁？那群把卡戎人当狗的杂碎？",
                        npc: 700101,
                    },
                    {
                        id: 51004304,
                        content: "你猜猜他们到时候打开门，发现这里住的是一个卡戎女人，他们会怎么办？",
                        npc: 700101,
                    },
                    {
                        id: 51004305,
                        content:
                            "（男人突然捂紧胸口，浑身战栗起来，像是伤口被扯痛一般。好一阵，他才止住颤抖，偏过头，吐出一口唾沫钉在地上。）",
                    },
                    {
                        id: 51004306,
                        content: "一个善良的卡戎女人，为了救一个重伤躺在路边的陌生人，砸伤了内城跑出来的烈犬。",
                        npc: 700101,
                    },
                    {
                        id: 51004307,
                        content: "就因为这点事，她被毒打一顿，拖出冰湖城的门，丢到这荒地里。",
                        npc: 700101,
                    },
                    {
                        id: 51004308,
                        content: "这……也许你可以想办法帮她离开冰湖城，换个地方生活。",
                        npc: 100001,
                    },
                    {
                        id: 51004309,
                        content: "……快了，快攒够了。",
                        npc: 700101,
                    },
                    {
                        id: 51004310,
                        content: "（男人转过身，面向帐篷的方向，僵硬的嘴角罕见地被撬开了一瞬，露出类似笑容的表情。）",
                    },
                    {
                        id: 51004311,
                        content: "（你似乎听见了朽木舒展时发出的干燥异响。）",
                    },
                ],
            },
            {
                id: 20021007,
                dialogues: [
                    {
                        id: 51004401,
                        content: "下水道里的什么是不会消失的？",
                    },
                ],
            },
        ],
    },
    {
        id: 200211,
        quests: [
            {
                id: 20021100,
                dialogues: [
                    {
                        id: 51003801,
                        content: "你……卡戎……我的同类……",
                        npc: 700012,
                    },
                    {
                        id: 51003802,
                        content: "（眼前的少女喃喃地说着，眼神似乎是在看你，又似乎是在看着未知的远方。）",
                    },
                ],
            },
            {
                id: 20021101,
                dialogues: [
                    {
                        id: 51003813,
                        content: "费伊，原来你是跑到外城来了！可让我好找。",
                        npc: 700088,
                    },
                    {
                        id: 51003814,
                        content: "怎么了？收到我们精心准备的礼物不开心吗？我雇了两个卡戎小孩才弄到那么多虫子，花了一整天的零花钱呢！",
                        npc: 700088,
                    },
                    {
                        id: 51003815,
                        content: "快回去吧，你跑来这种地方，可把大伙儿“担心”坏了。",
                        npc: 700088,
                    },
                    {
                        id: 51003816,
                        content: "我……我不要回去……",
                        npc: 700012,
                    },
                    {
                        id: 51003817,
                        content: "哎，你们看，那边那个不是卡戎吗？",
                        npc: 700089,
                    },
                    {
                        id: 51003818,
                        content: "哈哈哈，我就说她是恶魔嘛！",
                        npc: 700088,
                    },
                    {
                        id: 51003819,
                        content: "原来你是跑到外城找亲戚啊，真有意思！",
                        npc: 700088,
                    },
                    {
                        id: 51003820,
                        content: "我不是！……不，不，我是……",
                        npc: 700012,
                    },
                    {
                        id: 51003821,
                        content: "女孩捂着耳朵逃开了。",
                    },
                    {
                        id: 51003821,
                        content: "女孩捂着耳朵逃开了。",
                    },
                    {
                        id: 51003821,
                        content: "女孩捂着耳朵逃开了。",
                    },
                ],
            },
            {
                id: 20021103,
                dialogues: [
                    {
                        id: 51004001,
                        content: "我该怎么做呢……？",
                        npc: 700104,
                    },
                ],
            },
            {
                id: 20021104,
                dialogues: [
                    {
                        id: 51004101,
                        content: "这个白头发的，不好惹啊！",
                        npc: 700088,
                    },
                    {
                        id: 51004102,
                        content: "喂……情况好像不太妙啊！我们还是先回去吧！",
                        npc: 700089,
                    },
                    {
                        id: 51004103,
                        content: "等等。",
                        npc: 100001,
                    },
                    {
                        id: 51004104,
                        content: "费伊已经和我这个恶魔签了一份协议，如果你们再找她的麻烦，我会在一分钟之内出现在你们面前。",
                        npc: 100001,
                    },
                    {
                        id: 51004105,
                        content: "你……你……哼！",
                        npc: 700088,
                    },
                    {
                        id: 51004106,
                        content: "学生们一溜烟逃走了。",
                    },
                ],
            },
        ],
    },
    {
        id: 200212,
        quests: [
            {
                id: 20021200,
                dialogues: [
                    {
                        id: 51008001,
                        content: "走，走开……不买月石的话就赶紧走……别把那群当兵的引来了……",
                        npc: 700113,
                    },
                    {
                        id: 51008002,
                        content:
                            "（男人瑟缩在角落，与他健硕的体格所给人的印象相去甚远。他的眼神躲闪，渴望将身旁的月石脱手，却迟疑着要不要向他人寻求帮助。）",
                    },
                    {
                        id: 51008009,
                        content: "只要你帮我找个买家，报酬分你七成，不，八成！拜托了，拜托！",
                        npc: 700113,
                    },
                    {
                        id: 51008010,
                        content: "（虽说答应了男人的委托，但他的神色和袋子上干涸的暗红色痕迹都宣告着这批月石的来路并不单纯。）",
                    },
                    {
                        id: 51008011,
                        content: "（贸然寻找买主也许会招来麻烦，也许，先确认一下这批月石的来历会更好？）",
                    },
                ],
            },
            {
                id: 20021203,
                dialogues: [
                    {
                        id: 51002701,
                        content: "咦，这不是曾经的模范劳工拉里吗？你平时身边不是老跟着几个兄弟的吗，咋今天就一个人了。",
                        npc: 700112,
                    },
                    {
                        id: 51002702,
                        content: "卫，卫戍部队？？！",
                        npc: 700114,
                    },
                    {
                        id: 51002703,
                        content:
                            "没事他们也不关键，倒是你啊，应该知道私自开采与贩卖月石都是违规行为的吧，我收到上级通知来……嘶，你这袋子上的血是怎么回事？",
                        npc: 700112,
                    },
                    {
                        id: 51002704,
                        content: "我，我……",
                        npc: 700114,
                    },
                    {
                        id: 51002705,
                        content: "别跑！{nickname}，搭把手！",
                        npc: 700112,
                    },
                ],
            },
            {
                id: 20021205,
                dialogues: [
                    {
                        id: 51008012,
                        content: "（这片草丛刚刚是不是有什么东西闪了一下？）",
                    },
                    {
                        id: 51008014,
                        content:
                            "（你翻了翻草丛，果然找到了一颗散发着微弱光亮的石头——月石。只是，月石上同样沾着暗红色的血迹，和男人袋子上的暗红痕迹一模一样。）",
                    },
                    {
                        id: 51008015,
                        content: "我可不觉得今天是什么运气好到足够随地捡月石的日子。更何况这种带着一抹血迹的月石可不常见……",
                        npc: 100001,
                    },
                    {
                        id: 51008016,
                        content: "吼——",
                    },
                    {
                        id: 51008017,
                        content: "先清理掉碍事的秽兽吧……",
                        npc: 100001,
                    },
                    {
                        id: 51008013,
                        content: "（你翻了翻草丛，什么都没找到。也许刚才只是眼花了吧。）",
                    },
                    {
                        id: 51008054,
                        content: "（清理掉这群碍眼的秽兽后，附近的地面上某些似乎被掩埋过的痕迹暴露了出来。你决定去检查一下这些新的线索。）",
                    },
                ],
            },
            {
                id: 20021206,
                dialogues: [
                    {
                        id: 51008018,
                        content: "（一片凌乱的残渣碎屑，是冰湖的碎石、折断的树枝、些许瓦砾碎片。看这个凌乱程度，这里想必经历过一场打斗。）",
                    },
                    {
                        id: 51008019,
                        content: "（残渣中夹杂着撕下来的劣质布料和棉絮，这些布料似乎和那个寻找买主的男人身上穿的衣物类似。）",
                    },
                    {
                        id: 51008021,
                        content: "（周围的脚印杂乱无章，但却并没有秽兽或野兽的蹄印，只有人类的脚印。）",
                    },
                    {
                        id: 51008020,
                        content: "（翻开那些碎屑，你又发现了一小块染血的月石。）",
                    },
                    {
                        id: 51008022,
                        content: "（一道重物被拖行的痕迹绵延至远处。）",
                    },
                    {
                        id: 51008023,
                        content: "嗯……我想，我大概能猜到这里发生过什么了。月石上血迹的来源是：",
                        npc: 100001,
                    },
                ],
            },
            {
                id: 20021207,
                dialogues: [
                    {
                        id: 51008033,
                        content: "你干了什么见不得人的事吧？",
                        npc: 100001,
                    },
                    {
                        id: 51008034,
                        content: "这枚月石你可能未必会有印象，但它一定记得你。它上面沾染的血迹的主人也永远不会忘了你的。",
                        npc: 100001,
                    },
                    {
                        id: 51008035,
                        content: "我……我听不懂你在说什么！",
                        npc: 700113,
                    },
                    {
                        id: 51008036,
                        content: "不用你帮忙了，什么月石，我听不懂！",
                        npc: 700113,
                    },
                    {
                        id: 51008037,
                        content: "没必要这样，卫戍部队马上就要到了。不过，我倒是有个法子可以帮你——前提是，这袋月石归我。",
                        npc: 100001,
                    },
                    {
                        id: 51008038,
                        content: "我……你……",
                        npc: 700113,
                    },
                    {
                        id: 51008039,
                        content: "当然，你也可以选择跟他们走，这完全是你的自由。",
                        npc: 100001,
                    },
                    {
                        id: 51008040,
                        content: "我可以在这里等你做选择， 但卫戍部队大概不会等你。在你犹豫这会儿的时间里，他们大概就要到喽。",
                        npc: 100001,
                    },
                    {
                        id: 51008041,
                        content: "我给你！我全都给你还不行么！",
                        npc: 700113,
                    },
                    {
                        id: 51008042,
                        content: "就是这袋该死的月石！如果不是偶然发现它，我的兄弟们应该都还活着的！我们现在应该已经快要休息了……",
                        npc: 700113,
                    },
                    {
                        id: 51008043,
                        content: "不不……我们今天的收获比往常还要好一点，没准今晚还能一起去一次水仙平原，每个人都能来上一杯满满的麦芽酒！",
                        npc: 700113,
                    },
                    {
                        id: 51008044,
                        content: "我们可以一醉方休，可以吹牛到半夜，明早再一起……",
                        npc: 700113,
                    },
                    {
                        id: 51008045,
                        content: "我……我不能给你！",
                        npc: 700113,
                    },
                ],
            },
        ],
    },
    {
        id: 200213,
        quests: [
            {
                id: 20021300,
                dialogues: [
                    {
                        id: 51005101,
                        content: "这不是{nickname}吗？",
                        npc: 700115,
                    },
                    {
                        id: 51005102,
                        content: "上回的事多谢你了！贫民窟那几家人拿到生活费以后，也一直托我向你致谢呢！",
                        npc: 700115,
                    },
                ],
            },
            {
                id: 20021304,
                dialogues: [
                    {
                        id: 51005201,
                        content: "你回来啦！",
                        npc: 700127,
                    },
                    {
                        id: 51005202,
                        content: "快和我说说，你调查到了什么大秘密！",
                        npc: 700127,
                    },
                ],
            },
        ],
    },
    {
        id: 200215,
        quests: [
            {
                id: 20021500,
                dialogues: [
                    {
                        id: 51005301,
                        content: "只要消毒得当，就能成为一盘好菜！",
                        npc: 700116,
                    },
                    {
                        id: 51005302,
                        content: "……腥味是没了，但这些水产本身的鲜甜味却没有激发出来……",
                        npc: 700116,
                    },
                    {
                        id: 51005303,
                        content:
                            "（面前这位男人语速飞快，布满血丝的双眼死死盯着手中的册子和身旁不知名的鱼虾，用还黏着葱叶的双手飞快地写着什么。）",
                    },
                ],
            },
            {
                id: 20021502,
                dialogues: [
                    {
                        id: 51005314,
                        content: "钓到了，回去找马库斯吧。",
                        npc: 100001,
                    },
                    {
                        id: 51005401,
                        content: "滚滚葱叶切段备用……鱼虾冲净后加入盐、醋，考虑到冰湖城人的口味也许应该再加点糖……",
                        npc: 700116,
                    },
                    {
                        id: 51005402,
                        content: "（马库斯木讷地接过原料，一边念叨着烹调方式一边拖着它们走远了。）",
                    },
                ],
            },
            {
                id: 20021503,
                dialogues: [
                    {
                        id: 51005403,
                        content:
                            "（一段时间后，马库斯不知从哪里突然冲出，直到摔倒在雪地里才意识到自己的失态，尴尬地笑着用手拂去身上的尘土。）",
                    },
                    {
                        id: 51005404,
                        content: "……抱歉。",
                        npc: 700116,
                    },
                    {
                        id: 51005405,
                        content: "你也尝尝味道怎么样？能不能感受到冰湖城特色风味？",
                        npc: 700116,
                    },
                    {
                        id: 51005406,
                        content:
                            "（他从怀里掏出一包密封的鱼虾，浸润在黝黑的酱汁中隐隐散发着晶莹的光芒。即使隔着密封的薄膜也能闻到浓郁的酱香。）",
                    },
                    {
                        id: 51005403,
                        content:
                            "（一段时间后，马库斯不知从哪里突然冲出，直到摔倒在雪地里才意识到自己的失态，尴尬地笑着用手拂去身上的尘土。）",
                    },
                    {
                        id: 51005404,
                        content: "……抱歉。",
                        npc: 700116,
                    },
                    {
                        id: 51005405,
                        content: "你也尝尝味道怎么样？能不能感受到冰湖城特色风味？",
                        npc: 700116,
                    },
                    {
                        id: 51005406,
                        content:
                            "（他从怀里掏出一包密封的鱼虾，浸润在黝黑的酱汁中隐隐散发着晶莹的光芒。即使隔着密封的薄膜也能闻到浓郁的酱香。）",
                    },
                    {
                        id: 51005407,
                        content: "不要用那么古板的思维看待菜肴。一个人一生中如果不挑战一下非常规食材，那么他人生的乐趣就减少了一半。",
                        npc: 700116,
                    },
                    {
                        id: 51005410,
                        content: "嗯……总之，还有些改良空间。",
                        npc: 700116,
                    },
                    {
                        id: 51005411,
                        content: "之后第二道菜也拜托你了，我的美食搭档！",
                        npc: 700116,
                    },
                    {
                        id: 51005408,
                        content: "哈哈，算了算了，看你都快哭出来了。",
                        npc: 700116,
                    },
                    {
                        id: 51005410,
                        content: "嗯……总之，还有些改良空间。",
                        npc: 700116,
                    },
                    {
                        id: 51005411,
                        content: "之后第二道菜也拜托你了，我的美食搭档！",
                        npc: 700116,
                    },
                    {
                        id: 51005409,
                        content: "哼。还好不是所有人都像你一样，对食材的多样性心存偏见。",
                        npc: 700116,
                    },
                    {
                        id: 51005410,
                        content: "嗯……总之，还有些改良空间。",
                        npc: 700116,
                    },
                    {
                        id: 51005411,
                        content: "之后第二道菜也拜托你了，我的美食搭档！",
                        npc: 700116,
                    },
                    {
                        id: 51005410,
                        content: "嗯……总之，还有些改良空间。",
                        npc: 700116,
                    },
                    {
                        id: 51005411,
                        content: "之后第二道菜也拜托你了，我的美食搭档！",
                        npc: 700116,
                    },
                ],
            },
            {
                id: 20021504,
                dialogues: [
                    {
                        id: 51005501,
                        content: "炖的方式更暖胃，作为开胃菜刚刚好，现在还缺……",
                        npc: 700117,
                    },
                    {
                        id: 51005502,
                        content: "（马库斯泛白的脸即使在冰湖的冷风吹拂下也不见一丝血色，不注意观察甚至会以为这是一尊被人遗弃的冰雕。）",
                    },
                    {
                        id: 51005503,
                        content: "（但他完全没关注环境的恶劣与身体的哀嚎。）",
                    },
                    {
                        id: 51005504,
                        content: "（他只是专注地念出一个个原料、调味与烹饪方式，又快速将其否掉，在脑海中拼凑着通向极致菜肴的道路。）",
                    },
                    {
                        id: 51005505,
                        content: "搭档，你来了！",
                        npc: 700117,
                    },
                    {
                        id: 51005506,
                        content: "话不多说，现在还差些月牙鱼，拜托了！",
                        npc: 700117,
                    },
                    {
                        id: 51005507,
                        content: "（听完马库斯的话你松了一口气。至少这次应该不会被要求试吃生食了。）",
                    },
                ],
            },
            {
                id: 20021506,
                dialogues: [
                    {
                        id: 51005315,
                        content: "钓到了，回去找马库斯吧。",
                        npc: 100001,
                    },
                    {
                        id: 51005601,
                        content:
                            "（马库斯站在原地剥着北风莓的果皮，一言不发，愈发像是一尊冰雕。但不时抽动的眉头表明，他正在忍受着某种先前没有的刺痛。）",
                    },
                    {
                        id: 51005604,
                        content: "这些血……",
                    },
                    {
                        id: 51005605,
                        content: "小事，摘北风莓的时候摔伤了而已。看你的样子，月牙鱼到手了啊，我就知道你做得到，谢了。",
                        npc: 700117,
                    },
                    {
                        id: 51005606,
                        content: "（马库斯不愿过多讨论自己的伤势，抬手将北风莓丢进锅里，搅拌均匀后舀出一勺汤汁轻抿了一口。）",
                    },
                    {
                        id: 51005607,
                        content: "新鲜的北风莓，加入汤汁的话果然让香气更浓了。",
                        npc: 700117,
                    },
                    {
                        id: 51005608,
                        content: "那月牙鱼也得换种处理方式……",
                        npc: 700117,
                    },
                    {
                        id: 51005609,
                        content: "（马库斯拖着受伤的身体完成剔油、翻焯、煨炖等一道道复杂又漫长的处理工序。）",
                    },
                    {
                        id: 51005610,
                        content: "（随着食物的香味在一点一滴的积累中迸发，他才从篝火旁起身，乘起满满一碗料理，期待着食客的评价。）",
                    },
                    {
                        id: 51005611,
                        content: "咳咳……完成了，你尝尝够好吃、够有特色吗？",
                        npc: 700117,
                    },
                ],
            },
            {
                id: 20021508,
                dialogues: [
                    {
                        id: 51005701,
                        content: "……",
                    },
                    {
                        id: 51005702,
                        content: "（第三次遇到马库斯时，他就静静地坐在那里，腿上放着一份饭盒。他的神情憔悴，皮肤干瘪，似是很久未曾入睡。）",
                    },
                    {
                        id: 51005703,
                        content: "（腹部的伤口依然没有得到妥善处置，若是在炎热的城市说不定那些伤口都会开始散发出腐臭的气息。）",
                    },
                ],
            },
        ],
    },
    {
        id: 200216,
        quests: [
            {
                id: 20021602,
                dialogues: [
                    {
                        id: 51005801,
                        content: "（面前的箱子无论如何都打不开。）",
                    },
                    {
                        id: 51005802,
                        content: "喂喂喂，你这家伙怎么随便动别人的宝贝啊！",
                        npc: 700123,
                    },
                ],
            },
            {
                id: 20021604,
                dialogues: [
                    {
                        id: 51005905,
                        content: "哈哈哈哈复活！笨蛋笨蛋，知道我们帝国三兄弟的厉害了吧！",
                        npc: 700123,
                    },
                    {
                        id: 51005906,
                        content: "笨蛋，蛋……我饿了。",
                        npc: 700125,
                    },
                    {
                        id: 51005907,
                        content: "把箱子抱走卖了钱就吃得起饭了，快走快走。",
                        npc: 700123,
                    },
                    {
                        id: 51005908,
                        content: "人可以走，箱子放下。",
                        npc: 700126,
                    },
                    {
                        id: 51005912,
                        content: "刚才我可全都看到了，箱子明明是{nickname}先捡到的。你们抢别人的东西不说，还在这儿敲诈。",
                        npc: 700126,
                    },
                    {
                        id: 51005913,
                        content: "（奥特赛德向你使了一个眼色，似乎在示意“他来解决你的麻烦”。）",
                    },
                    {
                        id: 51005914,
                        content: "谁说是你的了，这上面都写了人家的名了！",
                        npc: 700124,
                    },
                    {
                        id: 51005915,
                        content: "帝国三兄弟的宝贝，这写得还挺……狂野。",
                        npc: 700126,
                    },
                    {
                        id: 51005916,
                        content: "漂亮吧，我用这支油笔练了好久呢。",
                        npc: 700125,
                    },
                    {
                        id: 51005917,
                        content: "什么油笔这么好用，让我看看？",
                        npc: 700126,
                    },
                    {
                        id: 51005918,
                        content: "哼哼，冰湖城人都没什么见识嘛。喏，拿去给你开开眼。",
                        npc: 700123,
                    },
                    {
                        id: 51005919,
                        content: "（奥特赛德接过笔后拿在手里转了几圈，然后在大哥背上写下了一行字。）",
                    },
                    {
                        id: 51005920,
                        content: "好了，按照你们的说法，从现在起，你们就是我奥特赛德的跟班了。",
                        npc: 700126,
                    },
                    {
                        id: 51005921,
                        content: "嗯？啊？",
                        npc: 700123,
                    },
                    {
                        id: 51005922,
                        content: "啊……大哥背上确实写着……“奥特赛德的跟班”。还、还真是……",
                        npc: 700125,
                    },
                    {
                        id: 51005923,
                        content: "既然大哥成了奥特赛德的跟班，咱们又是大哥的小弟，所以咱、咱们也是这个奥特赛德的……？",
                        npc: 700125,
                    },
                    {
                        id: 51005924,
                        content: "好耶，人家是奥特赛德的跟班了。跟班是什么意思啊？",
                        npc: 700124,
                    },
                    {
                        id: 51005925,
                        content: "跟班就是……就是……",
                        npc: 700125,
                    },
                    {
                        id: 51005909,
                        content: "你打死了我两位兄弟，还踢我！哎哟，我胳膊被你踢断了，你赔钱！加倍！",
                        npc: 700125,
                    },
                    {
                        id: 51005910,
                        content: "（三哥依旧牢牢地抱着你的腿。）",
                    },
                    {
                        id: 51005911,
                        content: "干什么呢这是？拿开你的爪子。",
                        npc: 700126,
                    },
                    {
                        id: 51005912,
                        content: "刚才我可全都看到了，箱子明明是{nickname}先捡到的。你们抢别人的东西不说，还在这儿敲诈。",
                        npc: 700126,
                    },
                    {
                        id: 51005913,
                        content: "（奥特赛德向你使了一个眼色，似乎在示意“他来解决你的麻烦”。）",
                    },
                    {
                        id: 51005914,
                        content: "谁说是你的了，这上面都写了人家的名了！",
                        npc: 700124,
                    },
                    {
                        id: 51005915,
                        content: "帝国三兄弟的宝贝，这写得还挺……狂野。",
                        npc: 700126,
                    },
                    {
                        id: 51005916,
                        content: "漂亮吧，我用这支油笔练了好久呢。",
                        npc: 700125,
                    },
                    {
                        id: 51005917,
                        content: "什么油笔这么好用，让我看看？",
                        npc: 700126,
                    },
                    {
                        id: 51005918,
                        content: "哼哼，冰湖城人都没什么见识嘛。喏，拿去给你开开眼。",
                        npc: 700123,
                    },
                    {
                        id: 51005919,
                        content: "（奥特赛德接过笔后拿在手里转了几圈，然后在大哥背上写下了一行字。）",
                    },
                    {
                        id: 51005920,
                        content: "好了，按照你们的说法，从现在起，你们就是我奥特赛德的跟班了。",
                        npc: 700126,
                    },
                    {
                        id: 51005921,
                        content: "嗯？啊？",
                        npc: 700123,
                    },
                    {
                        id: 51005922,
                        content: "啊……大哥背上确实写着……“奥特赛德的跟班”。还、还真是……",
                        npc: 700125,
                    },
                    {
                        id: 51005923,
                        content: "既然大哥成了奥特赛德的跟班，咱们又是大哥的小弟，所以咱、咱们也是这个奥特赛德的……？",
                        npc: 700125,
                    },
                    {
                        id: 51005924,
                        content: "好耶，人家是奥特赛德的跟班了。跟班是什么意思啊？",
                        npc: 700124,
                    },
                    {
                        id: 51005925,
                        content: "跟班就是……就是……",
                        npc: 700125,
                    },
                    {
                        id: 51005901,
                        content: "嘘……别动，这种时候只要装死就好了。",
                        npc: 700123,
                    },
                    {
                        id: 51005902,
                        content: "我是死人，我是死人，我是死人……",
                        npc: 700124,
                    },
                    {
                        id: 51005903,
                        content: "你……你把我大哥二哥打死了……你、你赔我钱！！",
                        npc: 700125,
                    },
                    {
                        id: 51005904,
                        content: "（二哥无论你怎么打都死死抱着箱子，三哥则抱着你的大腿不让你离开，显然是讹定你了。）",
                    },
                ],
            },
        ],
    },
    {
        id: 200219,
        quests: [
            {
                id: 20021901,
                dialogues: [
                    {
                        id: 51006901,
                        content: "（列车售票亭吸引了你的注意：你回忆起从玛尔洁那里得到的“货物”，它们中的某一个似乎与“车票”有关。）",
                    },
                    {
                        id: 51006902,
                        content: "（你来得不凑巧，一个异国打扮的卡戎之民与售票员起了冲突。）",
                    },
                    {
                        id: 51006903,
                        content: "没钱就滚开！",
                        npc: 700147,
                    },
                    {
                        id: 51006904,
                        content: "天呐，我只想一问！你为何狂躁！",
                        npc: 700148,
                    },
                    {
                        id: 51006905,
                        content:
                            "哦好的，这位怪腔怪调的穷鬼先生，在我礼貌地告诉你票价后，你打算怎么做？搓搓自己漏不出一个子儿的破口袋对我颐指气使？",
                        npc: 700147,
                    },
                    {
                        id: 51006906,
                        content: "你在讲什么？你怎知我没——",
                        npc: 700148,
                    },
                    {
                        id: 51006907,
                        content: "知道什么？卡戎人兜里能有几个铜币？这里只属于富豪、贵族和高官，不欢迎穷光蛋！",
                        npc: 700147,
                    },
                    {
                        id: 51006908,
                        content:
                            "（异国人哆嗦着嘴唇，改换某种方言加以反击，然而什么也没听懂的售票员轻蔑地看了他一眼，不再理他，商人自讨没趣，悻悻离去。）",
                    },
                ],
            },
            {
                id: 20021903,
                dialogues: [
                    {
                        id: 51007101,
                        content: "（你和异国人走到售票亭前，售票员杰西卡上下打量你几眼，冷冷地开了口。）",
                    },
                    {
                        id: 51007102,
                        content: "怎么又来了个穷酸卡戎？",
                        npc: 700147,
                    },
                    {
                        id: 51007103,
                        content: "注意你的态度，我可不是什么“穷酸卡戎”。修普诺斯之家的老板你知道吧，他空置的那间宅子现在是我租着。",
                        npc: 100001,
                    },
                    {
                        id: 51007104,
                        content:
                            "哈？谁都知道那个臭脸大叔最讨厌外乡人，你说谎不打草稿吗？既然得了幻想症，就把自己关在那“大宅子”里哪儿也别去！",
                        npc: 700147,
                    },
                    {
                        id: 51007105,
                        content: "过分！请说词，让她止住刻薄语言！",
                        npc: 700148,
                    },
                ],
            },
            {
                id: 20021904,
                dialogues: [
                    {
                        id: 51006921,
                        content: "看你白白净净的，怎么也跟兄弟抢垃圾啊？",
                        npc: 700230,
                    },
                ],
            },
            {
                id: 20021906,
                dialogues: [
                    {
                        id: 51007190,
                        content: "收下吧，善良有龙氏同胞。这里还有一些谢礼。",
                        npc: 700148,
                    },
                    {
                        id: 51007191,
                        content: "送我的？",
                        npc: 100001,
                    },
                    {
                        id: 51007192,
                        content: "嗯！她的星星，是愿望。织星客的星星，是远方，是故乡。",
                        npc: 700148,
                    },
                    {
                        id: 51007180,
                        content: "你也有自己的星星。保存好你的星星，切记，不要丢进垃圾桶。",
                        npc: 700148,
                    },
                    {
                        id: 51007181,
                        content: "我名李安德，是织星客。前日子，生意有点赔，现在城门附近用心摆摊，请光顾！",
                    },
                ],
            },
        ],
    },
    {
        id: 200220,
        quests: [
            {
                id: 20022002,
                dialogues: [
                    {
                        id: 51006001,
                        content: "这个月的话，老猎人小队排行第一，卡米拉女士冷暴力受害者小队排行第二，目标是天生无敌大狩月人小队第三……",
                        npc: 700143,
                    },
                    {
                        id: 51006002,
                        content: "老队伍的名字都还是挺规矩的，但……哎，总有一天这个看板要会写不下的。",
                        npc: 700143,
                    },
                    {
                        id: 51006003,
                        content: "（水仙平原的侍者在看板前一边写着奇怪词汇一边喃喃自语，看上去非常专注地发着愁。）",
                    },
                    {
                        id: 51006004,
                        content: "你好，请问你这是……？",
                        npc: 100001,
                    },
                    {
                        id: 51006005,
                        content: "嗯？我在更新这个月的狩月人小队排名——卡米拉女士想出来的法子，整理这些狩月人们的数据。",
                        npc: 700143,
                    },
                    {
                        id: 51006006,
                        content: "每个月完成了多少委托呀，平均一次委托收了多少佣金呀，和委托人吵没吵过架之类。",
                        npc: 700143,
                    },
                    {
                        id: 51006007,
                        content: "所以你们如果要和奥特赛德一起结成新的小队的话，也最好商量一下自己的队伍名字，找我来登记。",
                        npc: 700143,
                    },
                    {
                        id: 51006008,
                        content: "原来是这样，之前白确实听到过一些抱怨，说这里的狩月人们看起来脾气都不是很好，不敢委托工作。",
                        npc: 700144,
                    },
                    {
                        id: 51006009,
                        content: "但是如果一个队伍起了什么汪汪队喵喵队之类的名字，就突然没那么可怕了——毕竟人们总说，喜欢小动物的没有坏人。",
                        npc: 700144,
                    },
                    {
                        id: 51006010,
                        content: "我看不见得，我之前的单人小队的名字也是小动物啊，怎么委托数就没见涨。",
                        npc: 700145,
                    },
                    {
                        id: 51006011,
                        content: "啊！狗耳朵是从哪里冒出来的！",
                        npc: 700144,
                    },
                    {
                        id: 51006012,
                        content: "这不是路过刚好看到我们的新朋友，过来看看，搭把手什么的？",
                        npc: 700145,
                    },
                    {
                        id: 51006013,
                        content: "你的小队名字是什么？",
                        npc: 100001,
                    },
                    {
                        id: 51006014,
                        content: "“食用昆虫研究队”……",
                        npc: 700145,
                    },
                    {
                        id: 51006015,
                        content: "首先我觉得我们提到小动物时一般想不到昆虫，然后我觉得你应该很清楚为什么这个名字不会带来更多委托……",
                        npc: 100001,
                    },
                    {
                        id: 51006016,
                        content: "就是就是，我刚刚还在想，奥特赛德怎么会给队伍起可爱小动物的名字，怎么想都不太可能！",
                        npc: 700144,
                    },
                    {
                        id: 51006017,
                        content: "你懂什么，这叫做与众不同，一眼就能让人留下印象，你觉得呢，{nickname}？是不是非常有冲击力。",
                        npc: 700145,
                    },
                ],
            },
            {
                id: 20022004,
                dialogues: [
                    {
                        id: 51006101,
                        content: "喔，这不是吵闹小白吗！后面跟着的是……食用昆虫研究队的赛特奥德！",
                        npc: 700146,
                    },
                    {
                        id: 51006102,
                        content:
                            "啊，我当是谁呢，原来是探险家皎皎啊。虽然刚刚叫对了我的小队名让我有一点感动，但只是几天不见，你又把我名字叫错了。",
                        npc: 700145,
                    },
                    {
                        id: 51006103,
                        content: "那是因为我的注意力总是在你带回来的记录上，等下次，我就一定会记对你的名字的！赛特奥德小哥。",
                        npc: 700146,
                    },
                    {
                        id: 51006104,
                        content: "那么吵闹小白，这位是？",
                        npc: 700146,
                    },
                    {
                        id: 51006105,
                        content: "{性别：他|她}呀，是{nickname}，我新认识的小仆从，现在我在引导{性别：他|她}成为一名合格的狩月人。",
                        npc: 700144,
                    },
                    {
                        id: 51006106,
                        content:
                            "那么，我再来向你介绍一下！她是探险家皎皎，我认识的皎皎之民中就数她最富有冒险精神，最喜欢收集各种冒险者的情报啦。",
                        npc: 700144,
                    },
                    {
                        id: 51006107,
                        content: "你看，就连奥特赛德的那个糟糕的小队名字，她都会记得！",
                        npc: 700144,
                    },
                    {
                        id: 51006108,
                        content:
                            "奥德赛特的起名水准虽然一般，但身手还是很厉害的！换做一般的狩月人，顶着这样一个小队名字，应该在一年前转行或者三个月前饿毙街头了。",
                        npc: 700146,
                    },
                    {
                        id: 51006109,
                        content: "饿毙……行吧，改，改吧。那么小个子你说的靠身手决定，是什么意思？",
                        npc: 700145,
                    },
                    {
                        id: 51006110,
                        content: "哼，你的疙瘩脑袋总算转过弯了，那么先让我来和探险家皎皎前辈解释一下发生了什么。",
                        npc: 700144,
                    },
                    {
                        id: 51006111,
                        content: "（白张牙舞爪地比划了奥特赛德对于旧小队名的喜爱，以及通过靠身手来统一意见的打算。）",
                    },
                    {
                        id: 51006112,
                        content: "喔，我明白了，是用那个挑战来决定啊，那我是不会输的！",
                        npc: 700145,
                    },
                    {
                        id: 51006113,
                        content: "嗯，你确实是挑战次数最多的几个人之一，但{nickname}应该没有见过我设下的挑战，让我来说明一下。",
                        npc: 700146,
                    },
                    {
                        id: 51006114,
                        content: "简单来说呢，我之所以会对狩月人这么熟悉，是因为我会观察各位的身手，再记录下来。",
                        npc: 700146,
                    },
                    {
                        id: 51006115,
                        content:
                            "但狩月人这么多，并且在他们执行委托时跟在后面也很危险，所以我就找了一个帮手——一位年长的，令人尊敬的，但是长得和你有些像的铁匠。",
                        npc: 700146,
                    },
                    {
                        id: 51006116,
                        content: "难道你说的是铁匠皎皎前辈？我们认识她呀！",
                        npc: 700144,
                    },
                    {
                        id: 51006117,
                        content: "喔，认识的话就好说了，你们应该见过她的手艺。",
                        npc: 700146,
                    },
                    {
                        id: 51006118,
                        content:
                            "我拜托她做了一个魔法小玩意，能够在各个地方留下记号。那个记号只要被人碰一下，就会显出一段文字，也能记录下附近的人的行动。",
                        npc: 700146,
                    },
                    {
                        id: 51006119,
                        content:
                            "要是有人完成了文字要求的行动，就算是完成了挑战。要是结果足够好，就可以在我这里拿到一些报酬。所以说，我是最清楚怎么摸清狩月人身手的了。",
                        npc: 700146,
                    },
                    {
                        id: 51006120,
                        content: "我可太熟悉这些挑战了，小个子这下失算了，我都不知道怎么输。",
                        npc: 700145,
                    },
                    {
                        id: 51006121,
                        content:
                            "你先冷静一下，我只看最后的挑战结果。那么如果这位{nickname}{性别：小兄弟|小姑娘}也没问题的话，就来这里找我吧。",
                        npc: 700146,
                    },
                    {
                        id: 51006122,
                        content: "（探险家皎皎掏出笔，在你手中的冰湖城地图上做了一个标记。）",
                    },
                ],
            },
            {
                id: 20022005,
                dialogues: [
                    {
                        id: 51006201,
                        content: "好，那么在开始之前我讲解一下规则：在我说开始之后，沿着我标记的发光圈圈一直向前就好！",
                        npc: 700146,
                    },
                    {
                        id: 51006202,
                        content: "别担心，别看那个奥特赛文那么有信心，但是我更看好你，加油加油。",
                        npc: 700146,
                    },
                    {
                        id: 51006201,
                        content: "好，那么在开始之前我讲解一下规则：在我说开始之后，沿着我标记的发光圈圈一直向前就好！",
                        npc: 700146,
                    },
                    {
                        id: 51006202,
                        content: "别担心，别看那个奥特赛文那么有信心，但是我更看好你，加油加油。",
                        npc: 700146,
                    },
                ],
            },
            {
                id: 20022006,
                dialogues: [
                    {
                        id: 51006305,
                        content: "刚刚是发挥失常了吧，别着急，再来一次，我相信你！",
                        npc: 700146,
                    },
                    {
                        id: 51006301,
                        content: "驾轻就熟，我赢定了。",
                        npc: 700145,
                    },
                    {
                        id: 51006303,
                        content: "不是？怎么屋顶还有狗？",
                        npc: 700145,
                    },
                    {
                        id: 51006304,
                        content: "汪汪——",
                    },
                    {
                        id: 51006401,
                        content: "哦，{nickname}身手不错嘛，那么我们现在去进行第二场测试，跟着我来。",
                        npc: 700146,
                    },
                    {
                        id: 51006402,
                        content: "奥德特赛也抓紧赶上，不要跟丢了。",
                        npc: 700146,
                    },
                    {
                        id: 51006302,
                        content: "哎？谁往地上泼油？",
                        npc: 700145,
                    },
                ],
            },
            {
                id: 20022007,
                dialogues: [
                    {
                        id: 51006501,
                        content: "这一个测试的规则也很简单：我说开始后，面前会出现我拜托铁匠皎皎前辈做的气球。",
                        npc: 700146,
                    },
                    {
                        id: 51006502,
                        content: "瞄准，然后打爆它就好！",
                        npc: 700146,
                    },
                ],
            },
            {
                id: 20022008,
                dialogues: [
                    {
                        id: 51006601,
                        content: "奇怪了，我的子弹呢？",
                        npc: 700145,
                    },
                    {
                        id: 51006602,
                        content: "……可恶，刚刚手上沾了油，装弹好麻烦。",
                        npc: 700145,
                    },
                    {
                        id: 51006603,
                        content: "别装弹了，{nickname}已经完成测试了。",
                        npc: 700146,
                    },
                    {
                        id: 51006305,
                        content: "刚刚是发挥失常了吧，别着急，再来一次，我相信你！",
                        npc: 700146,
                    },
                ],
            },
            {
                id: 20022009,
                dialogues: [
                    {
                        id: 51006701,
                        content: "恭喜你，{nickname}，我的眼光没错，你是一位潜力十足的狩月人。",
                        npc: 700146,
                    },
                    {
                        id: 51006702,
                        content: "哼哼，按照之前的约定，新的小队名字，就由你来取啦！奥特赛德，你有意见吗？",
                        npc: 700144,
                    },
                    {
                        id: 51006703,
                        content: "我抗议！你们一定是在针对我！",
                        npc: 700145,
                    },
                    {
                        id: 51006704,
                        content: "怎么可能，我是专业的狩月人能力记录者，不会偏袒谁，也不会针对谁。",
                        npc: 700146,
                    },
                    {
                        id: 51006705,
                        content: "除非……",
                        npc: 700146,
                    },
                    {
                        id: 51006706,
                        content: "除非？",
                        npc: 100001,
                    },
                    {
                        id: 51006707,
                        content:
                            "除非有人和这个奥特赛德一样，简直把完成挑战当成营生的手段一样！每次我新布设了一批记号，他都第一个过去挑战，再冲到我这边要报酬，坏透了！",
                        npc: 700146,
                    },
                    {
                        id: 51006708,
                        content: "只要他去过一次的挑战，就没几个人再能超过他拿到报酬！搞得别人都不愿意参加了！所以我要让他尝一尝苦头！",
                        npc: 700146,
                    },
                    {
                        id: 51006709,
                        content: "你报复我居然是因为这个？！还有你终于叫对我的名字了，之前是不是都是故意的？",
                        npc: 700145,
                    },
                ],
            },
        ],
    },
    {
        id: 200221,
        quests: [
            {
                id: 20022102,
                dialogues: [
                    {
                        id: 51007317,
                        content: "好复杂的下水道，要不是你带我进来肯定会迷路。",
                        npc: 700172,
                    },
                    {
                        id: 51007318,
                        content: "我偶尔也会迷路。",
                        npc: 100001,
                    },
                    {
                        id: 51007319,
                        content: "嗯……就连经常来下水道探险的狩月人也会迷路，这个下水道的规模也太过巨大了。",
                        npc: 700172,
                    },
                    {
                        id: 51007320,
                        content:
                            "对了，在海伯利亚的官方正史里，他们国家最早就是在冰湖城建立的。所以才会有这么一个和地面建筑差不多大的下水道吧。",
                        npc: 700172,
                    },
                    {
                        id: 51007321,
                        content: "感觉这里的墙壁要更古老一些。",
                        npc: 100001,
                    },
                    {
                        id: 51007322,
                        content: "应该是随着当时冰湖城的扩建不断完善的吧，好像冰湖城一开始是就是一个卡戎的定居点……",
                        npc: 700172,
                    },
                    {
                        id: 51007323,
                        content: "啊，你这倒提醒我了，虽然外面的是冻土终年封冻，地面的建筑不断翻新，但是下水道说不定没有彻底翻新过。",
                        npc: 700172,
                    },
                    {
                        id: 510073231,
                        content: "工艺与设施好像都不太一样，越是早的部分，会有更多的砖石结构，而新修的部分会有更多的机械……",
                        npc: 700172,
                    },
                    {
                        id: 510073232,
                        content: "应该能写一篇报告，不过有点偏向城市史……不知道这方面之前有没有人做过啊……",
                        npc: 700172,
                    },
                    {
                        id: 510073233,
                        content: "啊，抱歉，我想问题入神了。但确实我获得灵感了，你能再带我去看看其他地方吗？你觉得意思的地方，都行。",
                        npc: 700172,
                    },
                ],
            },
            {
                id: 20022104,
                dialogues: [
                    {
                        id: 51007345,
                        content: "（没过多久，雪莉就拎着两个大袋子跑到了你的面前。）",
                    },
                    {
                        id: 51007346,
                        content: "大师！这是考古协会最新收到的帝国皇家钦定史书《海伯利亚史》第三十二编，小小敬意，希望大师不要嫌弃！",
                        npc: 700174,
                    },
                    {
                        id: 51007347,
                        content:
                            "（虽说是不要嫌弃，但雪莉丝毫没有给你拒绝的机会，硬是把两大袋子书塞到了你的手中，然后一边道谢一边蹦跳着跑远了。）",
                    },
                ],
            },
        ],
    },
    {
        id: 200222,
        quests: [
            {
                id: 20022200,
                dialogues: [
                    {
                        id: 51007902,
                        content: "（达顿看到你后立马兴奋地冲了过来，一股浓厚的香水味包裹着下水道的气息向你袭来，直熏得你眼睛生疼。）",
                    },
                    {
                        id: 51007903,
                        content:
                            "亲爱的朋友，你来得太是时候了，现在体验本项目，你就刚刚好是第100位参与者了！不光不要钱啊，我还送你钱呢！怎么样，要不要来试试！",
                        npc: 700069,
                    },
                    {
                        id: 51007904,
                        content: "（你敏锐地注意到达顿眼神中的躲闪——这个项目想必并不是那么受欢迎。）",
                    },
                ],
            },
            {
                id: 20022202,
                dialogues: [
                    {
                        id: 51007908,
                        content: "你这项目靠谱吗……为什么我们一直在钻下水道。",
                        npc: 100001,
                    },
                    {
                        id: 51007909,
                        content: "那当然！卢卡的水上滑梯听过没，大伙顺着流水的管子从高处一路滑下来，别提多好玩多刺激了。",
                        npc: 700191,
                    },
                    {
                        id: 51007910,
                        content:
                            "虽然去卢卡一趟的钱，这城里大部分人一辈子都攒不出，但我这项目和“水上滑梯”一模一样，你不需要出冰湖城，就能体验到同样的快乐！",
                        npc: 700191,
                    },
                    {
                        id: 51007911,
                        content:
                            "便宜实惠安全有趣这些词，简直就是给它量身打造的。看，咱们帝国下水道这些管子，不是比卢卡那些破烂塑料货高级多了吗！",
                        npc: 700191,
                    },
                    {
                        id: 51007912,
                        content: "（达顿说着拍了拍身旁的管道，一枚螺丝顿时崩飞了出去，他却仿佛没看到一般示意你赶紧钻进去。）",
                    },
                    {
                        id: 51007914,
                        content: "嗨呀没关系的，第一次玩总会有点紧张，但这不有我在嘛！我等你平复下心情，准备好了再找我就行。",
                        npc: 700191,
                    },
                    {
                        id: 51007915,
                        content: "好吧好吧，那我就来给你示范一下怎么玩，你之后也帮我去雾区跟大伙宣传宣传我这项目哈。",
                        npc: 700191,
                    },
                    {
                        id: 51007916,
                        content: "（达顿说完便钻进了管道，待金属被挤压的咯吱咯吱声完全停息，你听到达顿拍了拍管道的内壁对你说。）",
                    },
                    {
                        id: 51007917,
                        content:
                            "哎呦你没先体验真是可惜了，我这管子里不仅擦得干净，还很香哩。行了，滑梯出口就在前面，我先滑过去了哈，回见！",
                        npc: 700191,
                    },
                ],
            },
            {
                id: 20022203,
                dialogues: [
                    {
                        id: 51007918,
                        content: "（咯吱作响的管道将附近的秽兽吸引了过来，待你清理完这些小麻烦后，达顿的声音从身旁的管道传来。）",
                    },
                    {
                        id: 51007919,
                        content: "太——好——玩——啦——我——们——终——点——见——",
                        npc: 700191,
                    },
                ],
            },
            {
                id: 20022204,
                dialogues: [
                    {
                        id: 51007920,
                        content:
                            "（终点除了一滩水什么也没有。趴在管道上仔细聆听，你能听到咯吱声还在不断地从终点前方传来。你知道，达顿滑过头了。）",
                    },
                ],
            },
            {
                id: 20022205,
                dialogues: [
                    {
                        id: 51007921,
                        content: "（一只又一只的秽兽被喷出了管道，拦住了你的去路。）",
                    },
                    {
                        id: 51007922,
                        content: "唔——呃——呕——",
                        npc: 700191,
                    },
                    {
                        id: 51007923,
                        content:
                            "（从错误出口喷出来的达顿面色苍白，趴在地上狂吐不止，显然“滑梯”颇为颠簸——这个“下水道滑梯”并没有他所说的那么安全有趣。）",
                    },
                ],
            },
        ],
    },
    {
        id: 200223,
        quests: [
            {
                id: 20022300,
                dialogues: [
                    {
                        id: 51007501,
                        content: "嗯……实验对象1号，就决定是你了！",
                        npc: 700011,
                    },
                    {
                        id: 51007502,
                        content: "（眼前的孩子正满脸期待地看着你。）",
                    },
                ],
            },
            {
                id: 20022301,
                dialogues: [
                    {
                        id: 51007543,
                        content: "好耶！那就听好咯——",
                        npc: 700011,
                    },
                    {
                        id: 51007544,
                        content: "问题1：你为什么只有一只角？",
                        npc: 700011,
                    },
                ],
            },
        ],
    },
    {
        id: 200224,
        quests: [
            {
                id: 20022401,
                dialogues: [
                    {
                        id: 51007601,
                        content: "老鼠们去哪儿了呢……",
                        npc: 700204,
                    },
                    {
                        id: 51007602,
                        content: "（男孩伸长了脖子，好奇地打量着下水道入口。）",
                    },
                ],
            },
            {
                id: 20022402,
                dialogues: [
                    {
                        id: 51007646,
                        content: "原来下水道里面这么宽阔……",
                        npc: 700204,
                    },
                    {
                        id: 51007647,
                        content: "（一团灰色的影子从角落里闪现，似乎是只小老鼠。）",
                    },
                    {
                        id: 51007648,
                        content: "啊，你看到了吗？那只断了一截尾巴的小老鼠我见过，它是老鼠战士的同伴！",
                        npc: 700204,
                    },
                    {
                        id: 51007649,
                        content: "哎呀！怎么溜走了？",
                        npc: 700204,
                    },
                    {
                        id: 51007650,
                        content: "它好像不记得我啊……",
                        npc: 700204,
                    },
                    {
                        id: 51007651,
                        content: "（男孩皱起了小小的眉头，似乎陷入了思考。）",
                    },
                    {
                        id: 51007652,
                        content:
                            "{$XiAoTag(Value_1,Value_2)$|蛋蛋:西比尔}{性别：哥哥|姐姐}，你觉得动物有情感吗？我很想弄明白，可是我听不懂它们的语言……",
                        npc: 700204,
                    },
                ],
            },
            {
                id: 20022403,
                dialogues: [
                    {
                        id: 51007660,
                        content: "看，那就是老鼠们的家！",
                        npc: 700204,
                    },
                    {
                        id: 51007661,
                        content:
                            "（老鼠窝中传来“吱——吱——”的尖锐叫声，伴随着一阵微妙的臭气，但西奥并没有退缩。他睁大了眼睛，认真地观察着老鼠们的行动。）",
                    },
                    {
                        id: 51007662,
                        content: "（小老鼠们正在为了争夺半块饼而互相撕咬。）",
                    },
                    {
                        id: 51007663,
                        content: "啊……他们好像……不是太爱护同伴。",
                        npc: 700204,
                    },
                    {
                        id: 51007664,
                        content: "（注意到有人接近，一部分小老鼠受到了惊吓，慌张地逃走了。）",
                    },
                    {
                        id: 51007665,
                        content: "呃……他们好像……也不太勇敢。",
                        npc: 700204,
                    },
                    {
                        id: 51007666,
                        content: "（剩下的几只老鼠忽然眼露凶光，朝你们发起了攻击！）",
                    },
                    {
                        id: 51007667,
                        content: "啊啊啊——怎么平白无故地袭击人呀，太没有礼貌了吧？！",
                        npc: 700204,
                    },
                    {
                        id: 51007668,
                        content: "{$XiAoTag(Value_1,Value_2)$|蛋蛋:西比尔}{性别：哥哥|姐姐}，我们快逃！",
                        npc: 700204,
                    },
                    {
                        id: 51007669,
                        content: "你先逃，我来对付它们。",
                        npc: 100001,
                    },
                ],
            },
            {
                id: 20022404,
                dialogues: [
                    {
                        id: 51007690,
                        content: "西奥，你又跑到哪里去了？天呐，瞧瞧你，怎么把衣服弄得这么脏！",
                        npc: 700205,
                    },
                    {
                        id: 51007691,
                        content: "妈妈……！我们刚才去下水道里观察老鼠了。",
                        npc: 700204,
                    },
                    {
                        id: 51007692,
                        content: "什么？那种肮脏的生物有什么值得观察的？",
                        npc: 700205,
                    },
                    {
                        id: 51007693,
                        content: "成天研究这些莫名其妙的玩意儿，偏偏就是不愿意好好上课……真是愁死我了……",
                        npc: 700205,
                    },
                    {
                        id: 51007694,
                        content: "（女人抱怨了一通后，终于注意到了你。她警惕地把西奥拉到了身后。）",
                    },
                    {
                        id: 51007695,
                        content: "你又是谁？就是你把这孩子带坏的吧？",
                        npc: 700205,
                    },
                    {
                        id: 51007670,
                        content:
                            "{$XiAoTag(Value_1,Value_2)$|蛋蛋:西比尔}{性别：哥哥|姐姐}，你回来啦！我刚才远远地观察了你战斗的情况，你好厉害呀！",
                        npc: 700204,
                    },
                    {
                        id: 51007671,
                        content: "“{$XiAoTag(Value_1,Value_2)$|蛋蛋:西比尔}拥有强大的战斗能力”……嗯，我记下了。",
                        npc: 700204,
                    },
                    {
                        id: 51007672,
                        content: "不过……唉，看来那些小老鼠并没有情感吧……",
                        npc: 700204,
                    },
                ],
            },
        ],
    },
    {
        id: 200225,
        quests: [
            {
                id: 20022501,
                dialogues: [
                    {
                        id: 51007702,
                        content:
                            "{$XiAoTag(Value_1,Value_2)$|蛋蛋:西比尔}{性别：哥哥|姐姐}，{$XiAoTag(Value_1,Value_2)$|蛋蛋:西比尔}{性别：哥哥|姐姐}，我在这里！",
                        npc: 700204,
                    },
                    {
                        id: 51007703,
                        content: "（男孩躲在建筑的阴影中，激动地向你挥手。）",
                    },
                    {
                        id: 51007704,
                        content: "又见面啦！",
                        npc: 700204,
                    },
                    {
                        id: 51007705,
                        content: "我后来去打听了哦，你的真名叫{nickname}对吧！真是的，怎么能骗小孩呢？",
                        npc: 700204,
                    },
                    {
                        id: 51007706,
                        content: "上次真是对不起，我妈妈好像很怕卡戎。",
                        npc: 700204,
                    },
                    {
                        id: 51007707,
                        content: "那天回去以后，妈妈拉着我说了一大堆话，什么“卡戎人都是好吃懒做的家伙，是天生的罪犯，非常危险”之类的。",
                        npc: 700204,
                    },
                    {
                        id: 51007708,
                        content: "其他大人说的也都差不多。但是我越想越觉得奇怪呀！",
                        npc: 700204,
                    },
                    {
                        id: 51007709,
                        content: "我想去了解卡戎人，但要么是我不敢跟他们说话，要么是他们不愿意和我聊天，所以你能给我讲讲他们的生活吗？",
                        npc: 700204,
                    },
                    {
                        id: 51007710,
                        content: "比起说，不如直接带你去看看吧。我这里还有相机，你可以拍点照片带回去好好想一想。",
                        npc: 100001,
                    },
                    {
                        id: 51007711,
                        content: "真的吗？谢谢你！",
                        npc: 700204,
                    },
                ],
            },
            {
                id: 20022502,
                dialogues: [
                    {
                        id: 51007712,
                        content:
                            "你看这些破旧的小摊，每天天不亮的时候便会支起来，很多卡戎之民就是这样谋生的。跟他们熟起来的话，说不定会给你打点折扣呢。",
                        npc: 100001,
                    },
                    {
                        id: 51007713,
                        content: "大家……很累很辛苦呢。",
                        npc: 700204,
                    },
                ],
            },
            {
                id: 20022503,
                dialogues: [
                    {
                        id: 51007714,
                        content: "这里就是大部分卡戎生活的地方了。",
                        npc: 100001,
                    },
                    {
                        id: 51007715,
                        content:
                            "唔嗯……房子破破的，啊，这是那个很凶的大叔在帮邻居修房顶呢。还有这些小朋友在玩的游戏，我在内城也和朋友们玩过。",
                        npc: 700204,
                    },
                    {
                        id: 51007716,
                        content: "我懂你的意思了，事实并不像妈妈说的那样，虽然有些卡戎人说话很凶、行为古怪……但我们索拉人里也有这种人啊。",
                        npc: 700204,
                    },
                    {
                        id: 51007717,
                        content: "除了头上的角以外，我觉得你们和我们没有什么不同。",
                        npc: 700204,
                    },
                    {
                        id: 51007718,
                        content: "这么明显的事实，只要稍微观察一下就明白了，为什么大家还是坚持那些错误的说法呢？",
                        npc: 700204,
                    },
                ],
            },
            {
                id: 20022504,
                dialogues: [
                    {
                        id: 51007723,
                        content:
                            "你来啦~嘿嘿，我以前就偷偷观察过，那里面住着的都是年纪不大的卡戎哥哥姐姐，经过今天的了解，我……我想和他们聊聊天！",
                        npc: 700204,
                    },
                    {
                        id: 51007724,
                        content: "{nickname}，你可以和我一起去吗？",
                        npc: 700204,
                    },
                    {
                        id: 51007725,
                        content: "…………",
                        npc: 100001,
                    },
                ],
            },
        ],
    },
    {
        id: 200227,
        quests: [
            {
                id: 20022701,
                dialogues: [
                    {
                        id: 51009001,
                        content: "新剧上映，新剧上映！那边的年轻人，要不要来体验一下？",
                        npc: 700240,
                    },
                    {
                        id: 51009002,
                        content: "叫我吗？",
                        npc: 100001,
                    },
                    {
                        id: 51009003,
                        content: "是的是的，盖雷亚剧院正在试演一种全新的戏剧——沉浸式戏剧！",
                        npc: 700240,
                    },
                    {
                        id: 51009004,
                        content:
                            "这是来自卢卡的全新演绎形式！你不会再像过去一样被按在观众席上，而是可以自己选择去哪儿，甚至自己成为故事的一部分……",
                        npc: 700240,
                    },
                    {
                        id: 51009005,
                        content:
                            "我们需要志愿者来完成这场伟大的艺术实验！现在正在上映的是一场英雄冒险故事，你要来参加吗？我们准备了特别的礼物相赠！",
                        npc: 700240,
                    },
                    {
                        id: 51009006,
                        content: "好，请跟我来！",
                        npc: 700240,
                    },
                    {
                        id: 51009007,
                        content: "好吧，等你有兴趣了再来找我就好！",
                        npc: 700240,
                    },
                ],
            },
            {
                id: 20022702,
                dialogues: [
                    {
                        id: 51009008,
                        content: "你回来了，要来参加<H>沉浸式戏剧</>的试演吗？",
                        npc: 700240,
                    },
                    {
                        id: 51009009,
                        content: "好，请跟我来！",
                        npc: 700240,
                    },
                    {
                        id: 51009010,
                        content: "好吧，等你有兴趣了再来找我就好！",
                        npc: 700240,
                    },
                ],
            },
        ],
    },
    {
        id: 200228,
        quests: [
            {
                id: 20022801,
                dialogues: [
                    {
                        id: 51009101,
                        content: "喔，年轻人原来你在这里啊。",
                        npc: 230002,
                    },
                    {
                        id: 51009102,
                        content: "老朽有些事情要找你，闲下来的话就来找老朽吧。",
                        npc: 230002,
                    },
                    {
                        id: 51009103,
                        content: "前辈这突然是怎么了？",
                        npc: 100001,
                    },
                    {
                        id: 51009104,
                        content: "就当是老朽多管闲事吧，看着初出茅庐的后辈就总想做点什么。",
                        npc: 230002,
                    },
                    {
                        id: 51009105,
                        content: "来自长辈的经验之一，明天的冒险必须要在今天就做好准备，总之先跟老朽来一趟吧。",
                        npc: 230002,
                    },
                    {
                        id: 51009106,
                        content: "既然铁匠前辈都这么说了，我们就先准备一下吧！",
                        npc: 230001,
                    },
                ],
            },
            {
                id: 20022802,
                dialogues: [
                    {
                        id: 51009107,
                        content: "这是？",
                        npc: 100001,
                    },
                    {
                        id: 51009108,
                        content: "你来了啊，年轻人。炉温正好，老朽也要活动活动筋骨了。",
                        npc: 230002,
                    },
                    {
                        id: 51009109,
                        content: "你的那把剑给了老朽不少灵感，这就给你露一手吧。",
                        npc: 230002,
                    },
                ],
            },
            {
                id: 20022804,
                dialogues: [
                    {
                        id: 51009110,
                        content: "完成了！",
                        npc: 230002,
                    },
                    {
                        id: 51009111,
                        content: "哇——铁匠前辈，好厉害！",
                        npc: 230001,
                    },
                ],
            },
        ],
    },
    {
        id: 200229,
        quests: [
            {
                id: 20022901,
                dialogues: [
                    {
                        id: 51009201,
                        content: "抱歉打扰到你，请容许我占用你英雄诗篇上那微不足道的一行用以自我介绍。",
                        npc: 230003,
                    },
                    {
                        id: 51009202,
                        content: "本人名叫阿米埃特，至于职业……本人所从事的事业比较难以用语言概括，因为那样做比较有违美学。",
                        npc: 230003,
                    },
                    {
                        id: 51009203,
                        content: "如果一定要用一个词去称呼本人的职业，那还请叫做——艺术家。",
                        npc: 230003,
                    },
                    {
                        id: 51009204,
                        content: "好可疑……",
                        npc: 100001,
                    },
                    {
                        id: 51009205,
                        content: "请不必无端怀疑，本人在这里徘徊只是因为一些<H>美学</>上的疑惑。",
                        npc: 230003,
                    },
                    {
                        id: 51009206,
                        content: "不知道你有没有这种感觉，朋友——最近的武器似乎都只注重杀伤力和成本，却忽略了锻造物应有的美学。",
                        npc: 230003,
                    },
                    {
                        id: 51009207,
                        content: "武器原本并非我主要的研究对象，只是你有没有发现，如今这座城市的士兵变得越来越粗鄙了。",
                        npc: 230003,
                    },
                    {
                        id: 51009208,
                        content:
                            "我想正是海伯利亚的炼金院放弃了他们的美学追求，使用者才会如此粗俗，不成体统。而本人把他们的装备在美学上加以矫正，却遭到了不公的对待……",
                        npc: 230003,
                    },
                    {
                        id: 51009209,
                        content: "“矫正”？你做了什么出格的事吗？",
                        npc: 100001,
                    },
                    {
                        id: 51009210,
                        content:
                            "出格？当然没有，只是趁换岗的时候把他们的武器和配饰稍加修改，和他们对我下达监禁十五日的处罚相比，谈何出格？",
                        npc: 230003,
                    },
                    {
                        id: 51009211,
                        content: "本人理解让所有人拥有基本的美学素养是一项艰巨的伟大事业，但我们不应该因为前路艰险就停下脚步——",
                        npc: 230003,
                    },
                    {
                        id: 51009212,
                        content: "本人以艺术名义起誓，上到传说英雄的利剑，下到聊以防身的小刀，无关出身无关价格，其本身都应具备美的要素！",
                        npc: 230003,
                    },
                    {
                        id: 51009213,
                        content: "哦？老朽好像听到了些很有趣的话。",
                        npc: 230002,
                    },
                    {
                        id: 51009214,
                        content: "这个后辈虽然从外表看起来不太靠谱，但似乎对武器的美学颇有一些见解。",
                        npc: 230002,
                    },
                    {
                        id: 51009215,
                        content:
                            "现在的武器总是粗枝大叶，锤锻造就的线条，淬炼形成的纹路，恰到好处的平衡，每一个环节都应该饱含锻造者的心血才是。",
                        npc: 230002,
                    },
                    {
                        id: 51009216,
                        content: "线条？纹路？平衡？",
                        npc: 230003,
                    },
                    {
                        id: 51009217,
                        content: "请等一等，这些和美学有什么关系？",
                        npc: 230003,
                    },
                    {
                        id: 51009218,
                        content: "啊？",
                        npc: 230002,
                    },
                    {
                        id: 51009219,
                        content: "美学真正的灵魂所在是色彩啊！色彩！",
                        npc: 230003,
                    },
                    {
                        id: 51009220,
                        content: "喔——原来是考虑这个方面吗？",
                        npc: 230002,
                    },
                    {
                        id: 51009221,
                        content: "你不生气吗，前辈？",
                        npc: 100001,
                    },
                    {
                        id: 51009222,
                        content: "虽然回答有些出乎意料，但涂装色彩的确是影响美观的一个因素，倒也确实有不少人比较在意。",
                        npc: 230002,
                    },
                    {
                        id: 51009223,
                        content: "我刚才发觉这位英雄的武器色调朴素，本想尊重您的个人喜好，但对艺术和美的追求又让本人控制不住向您搭话……",
                        npc: 230003,
                    },
                    {
                        id: 51009224,
                        content: "总之，这里有一份独家的染剂配方，还有一些染剂的试作品，还请务必试试。",
                        npc: 230003,
                    },
                    {
                        id: 51009225,
                        content: "无论是武器，还是穿戴的饰品。只要用了它，您与美学真谛之间的距离，便不再远不可及！",
                        npc: 230003,
                    },
                    {
                        id: 51009243,
                        content: "那边那位纯白无瑕的英雄，请留步！",
                        npc: 230003,
                    },
                    {
                        id: 51009244,
                        content: "对就是这边，能够来到我的面前，看来你我果然拥有美学上的共鸣。",
                        npc: 230003,
                    },
                ],
            },
            {
                id: 20022904,
                dialogues: [
                    {
                        id: 51009236,
                        content: "成色倒也还不错，涂层平整附着力也很强，不过老朽总觉得……",
                        npc: 230002,
                    },
                    {
                        id: 51009237,
                        content: "总觉得什么？",
                        npc: 100001,
                    },
                    {
                        id: 51009238,
                        content: "颜色是不是过于夸张了些？",
                        npc: 230002,
                    },
                ],
            },
        ],
    },
    {
        id: 200230,
        quests: [
            {
                id: 20023000,
                dialogues: [
                    {
                        id: 51009407,
                        content: "初次见面，我叫费恩。老师已经等您很久了，请跟我来。",
                        npc: 700306,
                    },
                    {
                        id: 51009408,
                        content: "老师？",
                        npc: 100001,
                    },
                    {
                        id: 51009409,
                        content: "不……唉我怎么忘了老师不让我在公开场合这么叫她。不过如果是您的话应该没问题吧……还请您不要外传。",
                        npc: 700306,
                    },
                    {
                        id: 51009401,
                        content: "请留步，{性别：尊贵的先生|美丽的女士}！",
                        npc: 700306,
                    },
                    {
                        id: 51009402,
                        content: "哦，我该用什么形容你？",
                        npc: 700306,
                    },
                    {
                        id: 51009403,
                        content:
                            "无言的狸猫为你吟唱诗篇，青绿的皓月将你镀上黄金。海兔为你的王冠镶上棕榈果做的宝石，而我在无人途径的垃圾桶旁歌颂你——",
                        npc: 700306,
                    },
                    {
                        id: 51009404,
                        content: "无论我的赞美能否俘获您的垂眸，还请您……还请您……",
                        npc: 700306,
                    },
                    {
                        id: 51009405,
                        content: "噢！这幅非凡的仪表！您一定就是大名鼎鼎的狩月人{nickname}{性别：先生|小姐}吧！",
                        npc: 700306,
                    },
                    {
                        id: 51009406,
                        content: "（我这么有名了吗？……不对，总觉得这句话后面不会接什么好事……）",
                        npc: 100001,
                    },
                    {
                        id: 51009407,
                        content: "初次见面，我叫费恩。老师已经等您很久了，请跟我来。",
                        npc: 700306,
                    },
                    {
                        id: 51009408,
                        content: "老师？",
                        npc: 100001,
                    },
                    {
                        id: 51009409,
                        content: "不……唉我怎么忘了老师不让我在公开场合这么叫她。不过如果是您的话应该没问题吧……还请您不要外传。",
                        npc: 700306,
                    },
                    {
                        id: 51009401,
                        content: "请留步，{性别：尊贵的先生|美丽的女士}！",
                        npc: 700306,
                    },
                    {
                        id: 51009402,
                        content: "哦，我该用什么形容你？",
                        npc: 700306,
                    },
                    {
                        id: 51009403,
                        content:
                            "无言的狸猫为你吟唱诗篇，青绿的皓月将你镀上黄金。海兔为你的王冠镶上棕榈果做的宝石，而我在无人途径的垃圾桶旁歌颂你——",
                        npc: 700306,
                    },
                    {
                        id: 51009404,
                        content: "无论我的赞美能否俘获您的垂眸，还请您……还请您……",
                        npc: 700306,
                    },
                    {
                        id: 51009405,
                        content: "噢！这幅非凡的仪表！您一定就是大名鼎鼎的狩月人{nickname}{性别：先生|小姐}吧！",
                        npc: 700306,
                    },
                    {
                        id: 51009406,
                        content: "（我这么有名了吗？……不对，总觉得这句话后面不会接什么好事……）",
                        npc: 100001,
                    },
                    {
                        id: 51009407,
                        content: "初次见面，我叫费恩。老师已经等您很久了，请跟我来。",
                        npc: 700306,
                    },
                    {
                        id: 51009408,
                        content: "老师？",
                        npc: 100001,
                    },
                    {
                        id: 51009409,
                        content: "不……唉我怎么忘了老师不让我在公开场合这么叫她。不过如果是您的话应该没问题吧……还请您不要外传。",
                        npc: 700306,
                    },
                ],
            },
            {
                id: 20023001,
                dialogues: [
                    {
                        id: 51009410,
                        content: "老师，我把{nickname}{性别：先生|小姐}带来了。",
                        npc: 700306,
                    },
                    {
                        id: 51009411,
                        content: "你来了，年轻的狩月人。",
                        npc: 700300,
                    },
                    {
                        id: 51009412,
                        content:
                            "呀，真是个可爱的孩子。你的容貌让我想起这座城市晶莹的初雪，还有那点缀于初雪之上，鸽血般的石榴石，多让人忍不住想要轻抚——",
                        npc: 700300,
                    },
                    {
                        id: 51009413,
                        content: "等等，你不要过来——",
                        npc: 100001,
                    },
                    {
                        id: 51009414,
                        content: "呵呵，原来你不喜欢这样的亲密接触。失礼了，很抱歉用这种看起来很可疑的方式邀请你，请容许我先自我介绍一下。",
                        npc: 700300,
                    },
                    {
                        id: 51009415,
                        content: "我叫薇奥莱塔，一名歌剧演员。",
                        npc: 700300,
                    },
                    {
                        id: 51009416,
                        content: "（他们唱歌剧的说话怎么一个比一个怪啊！）",
                        npc: 100001,
                    },
                    {
                        id: 51009417,
                        content: "如果你见过我，应该是在剧院里，或者是在附近的剧目海报上。",
                        npc: 700300,
                    },
                ],
            },
            {
                id: 20023002,
                dialogues: [
                    {
                        id: 51009448,
                        content: "薇奥莱塔女士说的地址就是这里，不过附近好像没什么住宅的样子。",
                        npc: 100001,
                    },
                    {
                        id: 51009449,
                        content: "旁边有个卫兵，过去打听一下吧。",
                        npc: 100001,
                    },
                    {
                        id: 51009450,
                        content: "你好，我想和你打听点事情。",
                        npc: 100001,
                    },
                    {
                        id: 51009451,
                        content: "我在忙，等我有空再说吧。奇怪，这里应该是这样啊……这唱机怎么了……",
                        npc: 700313,
                    },
                    {
                        id: 51009452,
                        content: "（男人焦头烂额地摆弄着地上的一台旧唱机。）",
                    },
                    {
                        id: 51009453,
                        content: "它坏掉了吗？",
                        npc: 100001,
                    },
                    {
                        id: 51009454,
                        content: "应该也不算坏掉……但有些年头了，偶尔会失灵。我明明记得这么来一下就行啊……",
                        npc: 700313,
                    },
                ],
            },
            {
                id: 20023004,
                dialogues: [
                    {
                        id: 51009457,
                        content: "这样应该就可以了。",
                        npc: 100001,
                    },
                    {
                        id: 51009458,
                        content: "有两下子啊，这样总算能听我的录音带了。啊，薇奥莱塔女士的歌喉——",
                        npc: 700313,
                    },
                    {
                        id: 51009459,
                        content: "你知道薇奥莱塔？",
                        npc: 100001,
                    },
                    {
                        id: 51009460,
                        content:
                            "这冰湖城有谁不知道吗？她的首部唱片都已经炒到了天价，我攒了三个月的薪水还买不起！唉，只能先听便宜录音带解解馋。",
                        npc: 700313,
                    },
                    {
                        id: 51009461,
                        content: "那就好说了，我要问的事刚好和薇奥莱塔女士有关。",
                        npc: 100001,
                    },
                    {
                        id: 51009462,
                        content: "（再三叮嘱对方务必保密后，向卫兵大概说明了薇奥莱塔女士遭遇骚扰的事。）",
                    },
                    {
                        id: 51009463,
                        content: "什么？居然有这种事？！这真的是太不成体统了！如果犯人真的住在这片街区，我一定帮你把他揪出来好好教训一顿！",
                        npc: 700313,
                    },
                    {
                        id: 51009464,
                        content: "倒也不用这么夸张……",
                        npc: 100001,
                    },
                    {
                        id: 51009465,
                        content:
                            "怎么就夸张了？我生平最见不得这种危害社会治安的败类，你放心，这一带的住户我都或多或少打过交道，只要有点线索我一定能把犯人抓到！",
                        npc: 700313,
                    },
                    {
                        id: 51009466,
                        content: "线索的话……这封信你有什么头绪吗？",
                        npc: 100001,
                    },
                    {
                        id: 51009467,
                        content: "什么信？我看看。",
                        npc: 700313,
                    },
                    {
                        id: 51009468,
                        content: "…………",
                        npc: 700313,
                    },
                    {
                        id: 51009469,
                        content: "…………",
                        npc: 100001,
                    },
                    {
                        id: 51009470,
                        content: "怎么了，你为什么不说话？",
                        npc: 100001,
                    },
                    {
                        id: 51009471,
                        content: "这……这对吗？这不对吧？我觉得这封信言辞恳切情感真挚，和骚扰信天差地别。",
                        npc: 700313,
                    },
                    {
                        id: 51009472,
                        content: "看来寄信的人已经找到了。刚才好像有人说要把犯人好好教训一顿？",
                        npc: 100001,
                    },
                    {
                        id: 51009473,
                        content:
                            "这是误会，一定是误会。我发誓我对薇奥莱塔女士一片真心——不是说薇奥莱塔女士最喜欢热情洋溢的表白吗？她怎么会说那是骚扰啊？",
                        npc: 700313,
                    },
                    {
                        id: 51009474,
                        content: "……难道是<H>那家伙在骗我</>……",
                        npc: 700313,
                    },
                    {
                        id: 51009475,
                        content: "等一下，我明白了！是你！你根本不是薇奥莱塔女士派来的，你是来拆散我们的！",
                        npc: 700313,
                    },
                    {
                        id: 51009476,
                        content: "你有什么证据证明是薇奥莱塔女士让你来的？依我看你就是在挑拨离间！",
                        npc: 700313,
                    },
                    {
                        id: 51009477,
                        content: "居然试图用这样的手段来破坏薇奥莱塔女士和追随者之间的信任，我必须要好好教训一下你！",
                        npc: 700313,
                    },
                    {
                        id: 51009478,
                        content: "你这人怎么……",
                        npc: 100001,
                    },
                    {
                        id: 51009479,
                        content: "（还是先想办法让这个自说自话的家伙冷静一下吧。）",
                        npc: 100001,
                    },
                ],
            },
            {
                id: 20023006,
                dialogues: [
                    {
                        id: 51009480,
                        content: "薇奥莱塔女士，是我……是我太弱小……",
                        npc: 700313,
                    },
                    {
                        id: 51009481,
                        content: "闹够了？看看这个吧。",
                        npc: 100001,
                    },
                    {
                        id: 51009482,
                        content: "这是，薇奥莱塔女士的缎带？她从十多年前第一次公开演出开始就一直带着的……",
                        npc: 700313,
                    },
                    {
                        id: 51009483,
                        content: "这也能认出来？",
                        npc: 100001,
                    },
                    {
                        id: 51009484,
                        content: "怎么可能认不出来！我跟你说这些干吗……",
                        npc: 700313,
                    },
                    {
                        id: 51009485,
                        content: "既然你拿着这个，那看来我是真的被拒绝了。我不会再去骚扰薇奥莱塔女士了，祝你们幸福。",
                        npc: 700313,
                    },
                ],
            },
            {
                id: 20023007,
                dialogues: [
                    {
                        id: 51009509,
                        content:
                            '"薇奥莱塔——或者我应该叫你，E·R女士。\n我已知晓你十六年来所有肮脏的秘密。\n午夜冰湖侧门外的水潭旁，一个人来，否则我不保证你学生的平安。"',
                    },
                    {
                        id: 51009510,
                        content: "…………",
                        npc: 100001,
                    },
                    {
                        id: 51009511,
                        content: "恐怕之前的那些信都只是幌子，是我过于放松警惕了。",
                        npc: 700300,
                    },
                    {
                        id: 51009512,
                        content: "抱歉，我恐怕要失陪了。你不必介怀，交给你的委托确确实实已经完成了，这是按照约定给你的报酬。",
                        npc: 700300,
                    },
                    {
                        id: 51009488,
                        content: "薇奥莱塔女士，我回来了。",
                        npc: 100001,
                    },
                    {
                        id: 51009489,
                        content: "辛苦你了，看起来问题已经解决了。",
                        npc: 700300,
                    },
                    {
                        id: 51009490,
                        content: "嗯，他不会再来骚扰你了。这条缎带也还给你，如果没有它，恐怕还要再被纠缠一段时间。",
                        npc: 100001,
                    },
                    {
                        id: 51009491,
                        content: "听说这条缎带，你从十几年前就一直戴着？",
                        npc: 100001,
                    },
                    {
                        id: 51009492,
                        content: "是的，这是一位友人留给我的纪念，她才华横溢，但却不受命运垂怜……",
                        npc: 700300,
                    },
                    {
                        id: 51009493,
                        content: "出于某些原因，她无法实现自己的梦想了，不过我可以，所以我希望能够让她也一起在舞台上闪耀。",
                        npc: 700300,
                    },
                    {
                        id: 51009494,
                        content: "所以在我第一次公演的时候，我亲自设计了一张海报，在黑白的画面里，只有一抹紫色格外亮眼——",
                        npc: 700300,
                    },
                    {
                        id: 51009495,
                        content:
                            "你应该听说过“千面的薇奥莱塔”这个称呼，我有着足以让自己变成另一个人的化妆技术，在每场演出都会根据角色用不同的容貌登台。",
                        npc: 700300,
                    },
                    {
                        id: 51009496,
                        content: "但唯独这条缎带，我每次都会戴上。久而久之，<H>它也就成了我独有的标志</>。",
                        npc: 700300,
                    },
                    {
                        id: 51009497,
                        content: "原来如此……",
                        npc: 100001,
                    },
                    {
                        id: 51009498,
                        content: "老师！",
                        npc: 700306,
                    },
                    {
                        id: 51009499,
                        content: "费恩，我应该教过你不要大呼小叫。",
                        npc: 700300,
                    },
                    {
                        id: 51009500,
                        content: "对不起……但是老师你必须看看这个！",
                        npc: 700306,
                    },
                    {
                        id: 51009501,
                        content: "又是一样的信？我明明已经警告过他了。",
                        npc: 100001,
                    },
                    {
                        id: 51009502,
                        content: "…………",
                        npc: 700300,
                    },
                    {
                        id: 51009503,
                        content: "薇奥莱塔女士？",
                        npc: 100001,
                    },
                    {
                        id: 51009504,
                        content: "已经过去了十六年了啊……但……为什么要伤害无关的人？",
                        npc: 700300,
                    },
                    {
                        id: 51009505,
                        content: "薇奥莱塔女士，你的脸色很不好。",
                        npc: 100001,
                    },
                    {
                        id: 51009506,
                        content: "抱歉，是我把事情想得太过简单了。我原本不想太过声张，但这次的事态已经不得不求助卫戍部队了。",
                        npc: 700300,
                    },
                    {
                        id: 51009507,
                        content: "发生了什么？",
                        npc: 100001,
                    },
                    {
                        id: 51009508,
                        content: "你看看这个。",
                        npc: 700300,
                    },
                    {
                        id: 51009513,
                        content:
                            "（似乎一起绑架案正在你眼前发生。虽然薇奥莱塔已经决心求助卫戍部队，但若有机会的话，也关注一下绑架案的后续动向吧。）",
                    },
                ],
            },
        ],
    },
    {
        id: 200231,
        quests: [
            {
                id: 20023100,
                dialogues: [
                    {
                        id: 51009602,
                        content: "（男孩焦急地拉住了你的衣角。）",
                    },
                    {
                        id: 510095121,
                        content: "……",
                        npc: 700303,
                    },
                    {
                        id: 51009603,
                        content: "多纳特大叔生病了，病得很严重……",
                        npc: 700303,
                    },
                    {
                        id: 51009604,
                        content: "大家都说，大{性别：哥哥|姐姐}你是这里最厉害的狩月人，而且还很好心……求求你救救他吧！",
                        npc: 700303,
                    },
                    {
                        id: 51009605,
                        content: "生病？找医生看过了吗？",
                        npc: 100001,
                    },
                    {
                        id: 51009606,
                        content: "已经找医生看过了，他们说……已经……",
                        npc: 700303,
                    },
                    {
                        id: 51009607,
                        content: "我、我的钱都给你，不够的话让我做什么都可以的……！",
                        npc: 700303,
                    },
                    {
                        id: 10010101,
                        content: "贝蕾，我……",
                        npc: 100001,
                    },
                    {
                        id: 51009602,
                        content: "（男孩焦急地拉住了你的衣角。）",
                    },
                    {
                        id: 510095121,
                        content: "……",
                        npc: 700303,
                    },
                ],
            },
            {
                id: 20023101,
                dialogues: [
                    {
                        id: 51009608,
                        content: "你说的那个大叔在哪里？",
                        npc: 100001,
                    },
                    {
                        id: 51009609,
                        content: "就在雾区的小巷里，跟我来！",
                        npc: 700303,
                    },
                ],
            },
            {
                id: 20023102,
                dialogues: [
                    {
                        id: 51009610,
                        content: "（男孩敲了敲门，但并没有人应答。）",
                    },
                    {
                        id: 51009611,
                        content: "哎？奇怪了，他刚才明明还在……",
                        npc: 700303,
                    },
                    {
                        id: 51009612,
                        content: "你知道他可能去哪里吗？",
                        npc: 100001,
                    },
                    {
                        id: 51009613,
                        content: "唔……啊，我想起来了！",
                        npc: 700303,
                    },
                    {
                        id: 51009614,
                        content: "多纳特大叔最近总念叨说想回“矿场”看看。好像叫什么雷姆的……",
                        npc: 700303,
                    },
                    {
                        id: 51009615,
                        content: "格雷姆废矿？",
                        npc: 100001,
                    },
                    {
                        id: 51009616,
                        content: "对，就是这个名字！大{性别：哥哥|姐姐}，你要去那里吗？也带我一起去吧！",
                        npc: 700303,
                    },
                    {
                        id: 51009617,
                        content: "多纳特大叔他病得很重，我好怕——",
                        npc: 700303,
                    },
                    {
                        id: 51009618,
                        content: "那里太危险了，我不能带一个小孩子去。如果找到了，我会带他回来。你在这里等着就好。",
                        npc: 100001,
                    },
                    {
                        id: 51009619,
                        content: "唔，好吧……那就麻烦你了！",
                        npc: 700303,
                    },
                    {
                        id: 51009620,
                        content: "多纳特……他是怎样一个人？",
                        npc: 100001,
                    },
                    {
                        id: 51009621,
                        content: "多纳特大叔是全冰湖城最好心的人！",
                        npc: 700303,
                    },
                    {
                        id: 51009622,
                        content: "他总是把吃的分给我们，还会拿钱给雾区的孩子买新衣服和书本。",
                        npc: 700303,
                    },
                    {
                        id: 51009623,
                        content:
                            "他还经常帮大家修补房屋和家具，给受伤的人送去药物，在大雪天收留无家可归的乞丐……贫民窟的每个人几乎都得到过他的帮助。",
                        npc: 700303,
                    },
                    {
                        id: 51009624,
                        content: "还有还有——",
                        npc: 700303,
                    },
                    {
                        id: 51009625,
                        content: "……呃，我的意思是，他长什么样？",
                        npc: 100001,
                    },
                    {
                        id: 51009626,
                        content: "哎？噢噢……对不起。",
                        npc: 700303,
                    },
                    {
                        id: 51009627,
                        content: "大叔四十岁出头，棕色头发，高高瘦瘦的……穿着很旧的衣服。",
                        npc: 700303,
                    },
                    {
                        id: 51009628,
                        content: "好，我记住了。",
                        npc: 100001,
                    },
                ],
            },
            {
                id: 20023103,
                dialogues: [
                    {
                        id: 51009629,
                        content: "咳、咳……",
                        npc: 700301,
                    },
                ],
            },
            {
                id: 20023105,
                dialogues: [
                    {
                        id: 51009646,
                        content: "咳……咳、咳……",
                        npc: 700301,
                    },
                    {
                        id: 51009647,
                        content: "你还好吗？",
                        npc: 100001,
                    },
                    {
                        id: 51009648,
                        content: "我没……咳、咳，没事……我们继续往前走吧，我要找的地方离这里不远了。",
                        npc: 700301,
                    },
                    {
                        id: 51009649,
                        content: "你对这里好像很熟悉？",
                        npc: 100001,
                    },
                    {
                        id: 51009650,
                        content: "是啊……我曾经是这里的矿工。十六年前，这里就是我每天工作都要经过的地方。",
                        npc: 700301,
                    },
                    {
                        id: 51009651,
                        content: "那时候，我们一天要在这里待上十多个小时，角角落落的路，就算闭上眼睛也不会走错。",
                        npc: 700301,
                    },
                ],
            },
            {
                id: 20023108,
                dialogues: [
                    {
                        id: 51009665,
                        content: "多纳特大叔，你可算回来了！",
                        npc: 700303,
                    },
                    {
                        id: 51009666,
                        content: "抱歉，孩子，让你担心了——咳……咳咳……",
                        npc: 700301,
                    },
                    {
                        id: 51009667,
                        content: "大叔，你又发病了！我带你去找医生。",
                        npc: 700303,
                    },
                    {
                        id: 51009668,
                        content: "不，不用了……这是我的报应，治不了的。",
                        npc: 700301,
                    },
                    {
                        id: 51009669,
                        content: "大叔，你怎么又在说这种话了——",
                        npc: 700303,
                    },
                    {
                        id: 51009670,
                        content:
                            "你忘了吗？有个冬天特别特别冷，我只能去工厂排废气的管道那里蹲着，这样就能暖和一些。大叔你也冻得打哆嗦，却把唯一一件厚棉衣给了我。",
                        npc: 700303,
                    },
                    {
                        id: 51009671,
                        content: "整条街都知道大叔是多好的人！为什么你总是把“报应”这种难听话挂在嘴边呢？",
                        npc: 700303,
                    },
                    {
                        id: 51009672,
                        content: "……难道和你说的“往事”有关？",
                        npc: 100001,
                    },
                    {
                        id: 51009673,
                        content: "嗯，那是十六年前……",
                        npc: 700301,
                    },
                    {
                        id: 51009674,
                        content:
                            "就和我的每一段无聊至极的人生经历一样，当矿工的那些年算不上好，但也不算太坏。每天有恰好做到精疲力尽的工作，也能换取让一家人吃饱的面包。",
                        npc: 700301,
                    },
                    {
                        id: 51009675,
                        content: "现在想想，虽然那些大人物从来没有给予我们公正的对待，但那时候反而是我这一生最无忧无虑的日子……",
                        npc: 700301,
                    },
                    {
                        id: 51009676,
                        content:
                            "可我的朋友西格，他就没有那么幸运了。病痛无端地降临到他唯一的家人——他的妹妹，维尔莉特身上，可怜那女孩才只有十八岁。",
                        npc: 700301,
                    },
                    {
                        id: 51009677,
                        content: "而当你觉得遇到很糟糕的事时，情况往往会变得更糟。",
                        npc: 700301,
                    },
                    {
                        id: 51009678,
                        content:
                            "格雷姆矿场运出来的月石变得一天比一天少，拿在手里的薪水也越来越微薄。渐渐地，面包从白面包变成黑面包，到后来连黑面包都混着麸皮和木屑。",
                        npc: 700301,
                    },
                    {
                        id: 51009679,
                        content: "维尔莉特的病，对于报酬只能勉强活命的西格来说，无异于亲耳听到对亲人宣告死刑。",
                        npc: 700301,
                    },
                    {
                        id: 51009680,
                        content:
                            "我还记得那个凌晨，西格向工友讨了很多暖身的廉价烈酒，我们就这样坐在格雷姆矿场前的石头上，一瓶一瓶地往身子里灌。",
                        npc: 700301,
                    },
                    {
                        id: 51009681,
                        content:
                            "他一边不像样地哭，一边回忆和妹妹相依为命的往事。他时而学着维尔莉特的样子唱起歌，时而低低咒骂着法布瑞斯·鲁斯福德。",
                        npc: 700301,
                    },
                    {
                        id: 51009682,
                        content: "法布瑞斯·鲁斯福德是谁？",
                        npc: 100001,
                    },
                    {
                        id: 51009683,
                        content: "工程炼金院的长官，当时格雷姆矿场的负责人。",
                        npc: 700301,
                    },
                    {
                        id: 51009684,
                        content: "我拍着西格的肩膀和他说，“骂他有什么用，还不是咱们没本事。你要是真有能耐，怎么不绑了他，干票大的？”",
                        npc: 700301,
                    },
                    {
                        id: 51009685,
                        content:
                            "……这十六年里，我无时无刻不在质问自己，如果那天我没有喝多酒，没有说出那些轻佻的昏话，一切悲剧是不是都不会发生。",
                        npc: 700301,
                    },
                    {
                        id: 51009686,
                        content: "难道，那位西格叔叔真的……",
                        npc: 700303,
                    },
                    {
                        id: 51009687,
                        content: "是的。某一天，西格突然辞去了矿场的工作，我去他家找他，却发现他和维尔莉特都已经不在那里了。",
                        npc: 700301,
                    },
                    {
                        id: 51009688,
                        content: "起初我以为他是带着维尔莉特离开了冰湖城，去其他地方求医……可一周后，我却收到了维尔莉特的来信。",
                        npc: 700301,
                    },
                    {
                        id: 51009689,
                        content:
                            "虽然我和西格是好兄弟，但从我认识西格起，维尔莉特就常常卧病在床，所以我和她也没见过几面。信是她用仅剩的铜币拜托一位过路的狩月人送到矿场的。",
                        npc: 700301,
                    },
                    {
                        id: 51009690,
                        content: "信上说，西格绑架了长官的女儿，希望讨要一笔赎金。维尔莉特请求我阻止他，不要让他一错再错。",
                        npc: 700301,
                    },
                    {
                        id: 51009691,
                        content: "他把那个女孩关在了城郊的一栋老房子里，当我找到那里时他非常震惊，但还是承认了自己的所作所为。",
                        npc: 700301,
                    },
                    {
                        id: 51009692,
                        content:
                            "我意识到正是我那晚的胡话打开了罪恶的匣子，我后悔极了。我本想劝阻他，但看到虚弱到已经说不出来话的维尔莉特，我还是犹豫了……",
                        npc: 700301,
                    },
                    {
                        id: 51009693,
                        content: "西格让我就当这件事情没有发生过，但随着排查越来越严格，我一想到这件事就会害怕到颤抖不止。",
                        npc: 700301,
                    },
                    {
                        id: 51009694,
                        content: "最后……最后……",
                        npc: 700301,
                    },
                    {
                        id: 51009695,
                        content: "你……揭发了他们？",
                        npc: 100001,
                    },
                    {
                        id: 51009696,
                        content: "我不该这么做，我不该这么做啊！",
                        npc: 700301,
                    },
                    {
                        id: 51009697,
                        content: "后来呢，后来他们怎么样了？",
                        npc: 700303,
                    },
                    {
                        id: 51009698,
                        content: "军团的长官亲自带人来抓捕西格，西格在抵抗的时候不慎点燃了屋子。",
                        npc: 700301,
                    },
                    {
                        id: 51009699,
                        content:
                            "我冲进去想要救人，但最后却只在混乱中救出了维尔莉特。她是那样害怕，整张脸都被熏成煤黑，只有眼窝被止不住的泪水冲出两道泪痕。",
                        npc: 700301,
                    },
                    {
                        id: 51009700,
                        content: "我怕维尔莉特被她哥哥牵连，就把她藏在运水的桶里，瞒过了军团的视线。",
                        npc: 700301,
                    },
                    {
                        id: 51009701,
                        content: "最后，西格被军团的人抓到，而那位长官的女儿……大家只在废墟中找到她烧成焦炭的遗体。",
                        npc: 700301,
                    },
                    {
                        id: 51009702,
                        content:
                            "在那之后，愤怒的长官直接绕过审判流程，亲自将西格处决。而维尔莉特……我把检举的赏金都给了她，趁乱把她送出了冰湖城，希望她不要被牵连……",
                        npc: 700301,
                    },
                    {
                        id: 51009703,
                        content: "我至今还能想起我送她离开时，她那副憔悴但又愤怒的表情，她当时戴着的，就是这条紫罗兰色的缎带……",
                        npc: 700301,
                    },
                    {
                        id: 51009704,
                        content: "她说她会永远离开冰湖城，永远不想再见到我。",
                        npc: 700301,
                    },
                    {
                        id: 51009705,
                        content: "是啊……谁会想见到祸从口出导致朋友铤而走险，后来又因为一时胆怯害死两条人命的懦夫呢？",
                        npc: 700301,
                    },
                    {
                        id: 51009713,
                        content: "（多纳特的声音逐渐虚弱，随即倒在了地上。）",
                    },
                    {
                        id: 51009714,
                        content: "大叔？多纳特大叔？！",
                        npc: 700303,
                    },
                    {
                        id: 51009715,
                        content: "呼……还好，看起来只是身体虚弱加上精神过度紧张晕过去了。你看好他，不要让他再乱跑了。",
                        npc: 100001,
                    },
                    {
                        id: 51009716,
                        content: "嗯，我会叫来大家一起看好多纳特大叔的。",
                        npc: 700303,
                    },
                    {
                        id: 51009717,
                        content: "对了，大{性别：哥哥|姐姐}……",
                        npc: 700303,
                    },
                    {
                        id: 51009718,
                        content: "怎么了？",
                        npc: 100001,
                    },
                    {
                        id: 51009719,
                        content: "大叔他……真的是个坏人吗？",
                        npc: 700303,
                    },
                ],
            },
        ],
    },
    {
        id: 200232,
        quests: [
            {
                id: 20023201,
                dialogues: [
                    {
                        id: 51009760,
                        content:
                            "（你听到了一阵微小的震颤声，如同躲藏在箱子背后的小精灵赶在天亮前离开了孩子的床头。当回过神来的时候，你意识到那位箱子小姐似乎已经离开了。）",
                    },
                    {
                        id: 51009761,
                        content: "（躲在箱子里的那个声音……不知道为什么就顺着她的想法聊下去了。）",
                        npc: 100001,
                    },
                    {
                        id: 51009762,
                        content: "（可能是谁家的小孩子在乱跑，不能就这么放着不管，还是找周围的人问问吧。）",
                        npc: 100001,
                    },
                    {
                        id: 51009723,
                        content: "难享安眠……难享安眠！",
                        npc: 700309,
                    },
                    {
                        id: 51009724,
                        content: "可怜的人啊，你是否同我一样？身处冰冷的回廊，焦急地观望，那因爱与希冀而闪烁的星光……",
                        npc: 700309,
                    },
                    {
                        id: 51009725,
                        content: "（你听到街角的歌声。环顾四望，却并未发现唱歌的人。要继续在周围看看吗？）",
                    },
                    {
                        id: 51009838,
                        content: "哒……哒哒……",
                        npc: 700309,
                    },
                    {
                        id: 51009726,
                        content: "哒……哒哒……",
                        npc: 700309,
                    },
                    {
                        id: 51009727,
                        content: "谁？谁在那里？",
                        npc: 100001,
                    },
                    {
                        id: 51009728,
                        content: "哦，抱歉，我好像吓到了你？我在这里，稍微往前五步。对，就是这边。",
                        npc: 700309,
                    },
                    {
                        id: 51009729,
                        content: "你好，今夜无法入眠的朋友。",
                        npc: 700309,
                    },
                ],
            },
            {
                id: 20023202,
                dialogues: [
                    {
                        id: 51009763,
                        content: "请问……你是谁？从刚才开始似乎就一直在我家附近转悠。",
                        npc: 700302,
                    },
                    {
                        id: 51009764,
                        content: "是有委托找我吗，找人？还是收集素材？其他的委托也不是不接，但必须合法。",
                        npc: 700302,
                    },
                    {
                        id: 51009765,
                        content: "委托？",
                        npc: 100001,
                    },
                    {
                        id: 51009766,
                        content: "嗯？原来你不是来找我发委托的？",
                        npc: 700302,
                    },
                    {
                        id: 51009767,
                        content: "好吧，看来“狩月人吉赛尔”的名气没有卡米拉说的那么响。",
                        npc: 700302,
                    },
                    {
                        id: 51009768,
                        content: "狩月人吉赛尔……这么一说我好像听到过——",
                        npc: 100001,
                    },
                    {
                        id: 51009769,
                        content: "倒也不用为了照顾我的心情这么说。",
                        npc: 700302,
                    },
                    {
                        id: 51009770,
                        content: "不……其实……",
                        npc: 100001,
                    },
                    {
                        id: 51009771,
                        content: "（向吉赛尔说明了她家屋后那个箱子的事。）",
                    },
                    {
                        id: 51009772,
                        content: "你是说，我家房后的木箱说话了，还推荐你去听一场歌剧。嗯，我了解了。",
                        npc: 700302,
                    },
                    {
                        id: 51009773,
                        content: "……",
                        npc: 100001,
                    },
                    {
                        id: 51009774,
                        content: "你好像，反应和我想象中有点不一样？",
                        npc: 100001,
                    },
                    {
                        id: 51009775,
                        content:
                            "是吗？可能是我性格如此。无论是有小孩子淘气钻进去和你说话，还是箱子本身就会说话，对我来说都是可以接受的现实。",
                        npc: 700302,
                    },
                    {
                        id: 51009776,
                        content: "谢谢你把这件事告诉我，我会在这一带问一问的。",
                        npc: 700302,
                    },
                    {
                        id: 51009777,
                        content: "哦对了，我想起来了。你是{nickname}对吗？最近在狩月人圈子里评价很高的新星。",
                        npc: 700302,
                    },
                ],
            },
            {
                id: 20023203,
                dialogues: [
                    {
                        id: 51009785,
                        content: "（差不多应该够了。）",
                        npc: 100001,
                    },
                    {
                        id: 51009786,
                        content: "（这些草药……都是些随处可见的品种，如果吉赛尔也是狩月人为什么要专门拜托我？）",
                        npc: 100001,
                    },
                    {
                        id: 51009787,
                        content: "（现在回想起来，她的态度也有些奇怪……）",
                        npc: 100001,
                    },
                    {
                        id: 51009788,
                        content: "（先把这些草药带回水仙平原吧，顺便向卡米拉打听一下。）",
                        npc: 100001,
                    },
                ],
            },
            {
                id: 20023204,
                dialogues: [
                    {
                        id: 51009802,
                        content:
                            "你好，亲爱的朋友。\n谢谢你愿意陪一个荒唐的箱子聊到深夜，也谢谢你给我踏上旅途的勇气。\n也许这么做有些对不起我的朋友和老师，但她们一定会理解我的选择。世界那么大，我会在其他的舞台和她们再见。\n还有，请不要责怪吉赛尔，这是我自己的意愿。希望我的任性不会连累到其他人。\n啊，突然想起来我还没有对你说过我的名字。\n不过那个名字以后不会再用啦，让我想想……\n如果你以后遇到了一个叫普蒂妮的女孩，请一定要认出我，我也一定会认出你的。",
                    },
                    {
                        id: 51009803,
                        content: "看来你认识了一个奇怪的朋友，这应该是一段有趣的故事。",
                        npc: 200003,
                    },
                    {
                        id: 51009804,
                        content: "不……其实我也不知道具体发生了什么。",
                        npc: 100001,
                    },
                    {
                        id: 51009805,
                        content: "（和卡米拉讲述了最近两天发生的事。）",
                    },
                    {
                        id: 51009806,
                        content: "普蒂妮……",
                        npc: 200003,
                    },
                    {
                        id: 51009807,
                        content: "这个名字怎么了？",
                        npc: 100001,
                    },
                    {
                        id: 51009808,
                        content: "单论名字好像没什么特别的，不过箱子里的那个声音确实提到了前几天歌剧院的演出对吗？",
                        npc: 200003,
                    },
                    {
                        id: 51009809,
                        content: "嗯，还专门问过我那个女主角唱的怎么样。",
                        npc: 100001,
                    },
                    {
                        id: 51009810,
                        content: "实际上我从酒馆的客人那里听到了这样一则传闻……",
                        npc: 200003,
                    },
                    {
                        id: 51009811,
                        content: "他们中曾经有人观看过《普蒂妮》的彩排，当时的女主角并不是正式公演时登台的这位。",
                        npc: 200003,
                    },
                    {
                        id: 51009812,
                        content: "据他说那是一个更年轻的，但很有天赋的演员，但正式演出登台的，却还是以前的主演。",
                        npc: 200003,
                    },
                    {
                        id: 51009813,
                        content: "你是说……",
                        npc: 100001,
                    },
                    {
                        id: 51009814,
                        content: "只是些传闻罢了，并没有直接的证据能把这两件事联系起来。",
                        npc: 200003,
                    },
                    {
                        id: 51009815,
                        content: "不过，我对事情的真相也很好奇，如果你有空的话，可以继续调查一下。",
                        npc: 200003,
                    },
                    {
                        id: 51009816,
                        content: "（看来卡米拉也感到有些奇怪。不过可以确定的是，吉赛尔的确有些反常。）",
                        npc: 100001,
                    },
                    {
                        id: 51009817,
                        content: "（箱子里的那个女孩会是那位没能登台的演员吗……吉赛尔是否从一开始就知情？）",
                        npc: 100001,
                    },
                    {
                        id: 51009818,
                        content: "（在这里想也不会有什么结果，再去找吉赛尔问问吧。）",
                        npc: 100001,
                    },
                    {
                        id: 51009789,
                        content: "下午好，今天是想喝上一杯，还是在看委托？",
                        npc: 200003,
                    },
                    {
                        id: 51009790,
                        content: "我是来送东西的，是吉赛尔的委托，说让我把东西送到水仙平原就好。",
                        npc: 100001,
                    },
                    {
                        id: 51009791,
                        content: "吉赛尔？她的确不久前来过一趟，说让我帮忙把一个包裹转交给你。不过总感觉有些不对劲……委托的内容是什么？",
                        npc: 200003,
                    },
                    {
                        id: 51009792,
                        content: "（向卡米拉说明了吉赛尔委托自己采集草药的事。）",
                    },
                    {
                        id: 51009793,
                        content: "…………",
                        npc: 200003,
                    },
                    {
                        id: 51009794,
                        content: "有什么不对吗？",
                        npc: 100001,
                    },
                    {
                        id: 51009795,
                        content: "委托本身倒是没什么，不过为什么她会发出这种委托？",
                        npc: 200003,
                    },
                    {
                        id: 51009796,
                        content: "需求都是些很常见的风寒草药，她自己去收集的话一早上就能回来，没有必要专门请人去做。",
                        npc: 200003,
                    },
                    {
                        id: 51009797,
                        content: "说起来我的确听她提到过，她自己就是个狩月人。",
                        npc: 100001,
                    },
                    {
                        id: 51009798,
                        content:
                            "嗯，她以前做过卫戍官，十六年前因为某个案子的判决和上级起了矛盾离开卫戍部队做了狩月人。思维敏捷身手也不错，在圈子里名气不小。",
                        npc: 200003,
                    },
                    {
                        id: 51009799,
                        content: "算了，不提那些了。既然委托没什么问题，她也提前留过了口信，我就没什么好多说的。",
                        npc: 200003,
                    },
                    {
                        id: 51009800,
                        content: "这是她留给你的东西，拿好。",
                        npc: 200003,
                    },
                    {
                        id: 51009801,
                        content: "这是……委托的报酬，还有一封信？",
                        npc: 100001,
                    },
                ],
            },
            {
                id: 20023205,
                dialogues: [
                    {
                        id: 51009819,
                        content: "我说过，我早就说过！",
                        npc: 700307,
                    },
                    {
                        id: 51009820,
                        content: "就不该找那种来历不明的女人当家庭教师！就不该让罗莎琳去学什么声乐！",
                        npc: 700307,
                    },
                    {
                        id: 51009821,
                        content: "明明是你说要给她找点事做，不让她一天到晚想着到处乱跑！",
                        npc: 700308,
                    },
                    {
                        id: 51009822,
                        content: "是我说的，但我是让她有点事做才能老实待在家里，而不是变本加厉地往外跑搞得自己被绑匪盯上！",
                        npc: 700307,
                    },
                    {
                        id: 51009823,
                        content:
                            "还有你们，这群废物卫戍部队！你们到底是干什么吃的？好不容易查到这里有线索，就是因为你们效率太低，才让绑匪跑了！",
                        npc: 700307,
                    },
                    {
                        id: 51009824,
                        content: "……",
                        npc: 700313,
                    },
                    {
                        id: 51009825,
                        content: "该死，我为什么要在大街上对你们这些没脑子的家伙发脾气！我要用其他的渠道去找。",
                        npc: 700307,
                    },
                    {
                        id: 51009826,
                        content: "……呼，可算走了。",
                        npc: 700313,
                    },
                    {
                        id: 51009827,
                        content: "抱歉，闲杂人等请止步。",
                        npc: 700313,
                    },
                    {
                        id: 51009828,
                        content: "不好意思，我只是听到有争吵声，这里发生了什么？",
                        npc: 100001,
                    },
                    {
                        id: 51009829,
                        content: "我们收到举报，有人实施了绑架并把受害人囚禁于此，不过等卫戍部队赶到后这里已经没有人了。",
                        npc: 700313,
                    },
                    {
                        id: 51009830,
                        content: "我们已经封锁了这间住宅，如果你只是来看热闹的，就请不要继续靠近了。",
                        npc: 700313,
                    },
                    {
                        id: 51009831,
                        content: "好吧，刚才那二位是？",
                        npc: 100001,
                    },
                    {
                        id: 51009832,
                        content:
                            "马格努斯伯爵和他的夫人，受害人的父母。虽然我能理解女儿被人绑架的焦急，不过这二位还真是和传闻一样的臭脾气……",
                        npc: 700313,
                    },
                    {
                        id: 51009833,
                        content: "而且据说他们对女儿的控制欲也很强，说不定罗莎琳小姐就是受不了他们才往外跑。",
                        npc: 700313,
                    },
                    {
                        id: 51009834,
                        content: "咳……闲话说太多了。总之还请配合我们执行公务，如果有什么线索也请告知卫戍部队。",
                        npc: 700313,
                    },
                    {
                        id: 51009835,
                        content: "（吉赛尔和……箱子小姐，似乎都不在这里了。）",
                        npc: 100001,
                    },
                    {
                        id: 51009836,
                        content: "（绑架……？会和吉赛尔留在水仙平原的那封信有关吗？）",
                        npc: 100001,
                    },
                    {
                        id: 51009837,
                        content: "（暂时没有其他头绪，平时如果有空就多留意一下吧。）",
                        npc: 100001,
                    },
                ],
            },
        ],
    },
    {
        id: 200233,
        quests: [
            {
                id: 20023301,
                dialogues: [
                    {
                        id: 51009850,
                        content: "（这两天冰湖城发生了好多事，还涉及到绑架案之类的……）",
                        npc: 100001,
                    },
                    {
                        id: 51009851,
                        content: "（仔细想想，其中<H>几件事</>似乎和案件有千丝万缕的联系。）",
                        npc: 100001,
                    },
                    {
                        id: 51009852,
                        content: "（先简单梳理一下吧……）",
                        npc: 100001,
                    },
                    {
                        id: 51009853,
                        content:
                            "（十六年前的绑架案另有隐情，而薇奥莱塔女士很可能知道真相……吉赛尔绑架了她的学生，为的是与薇奥莱塔单独见面……）",
                        npc: 100001,
                    },
                    {
                        id: 51009854,
                        content: "（如果推断没错，现在吉赛尔应该已经见到薇奥莱塔了。）",
                        npc: 100001,
                    },
                    {
                        id: 51009855,
                        content: "（我还记得信上的那个地点，必须快点过去……希望没有什么不好的事发生。）",
                        npc: 100001,
                    },
                ],
            },
            {
                id: 20023302,
                dialogues: [
                    {
                        id: 51009856,
                        content: "看来你还算准时。",
                        npc: 700302,
                    },
                    {
                        id: 51009857,
                        content: "……",
                        npc: 700300,
                    },
                    {
                        id: 51009858,
                        content:
                            "都到了这个场合，你还打算一言不发吗？我可不是迂腐的法官，如果你想听到“你有权保持沉默”这种话，那可能要失望了。",
                        npc: 700302,
                    },
                    {
                        id: 51009859,
                        content: "你想让我说什么？先来让我听听吧，用这种卑劣的手段，你想得到的是怎样的答案？",
                        npc: 700300,
                    },
                    {
                        id: 51009860,
                        content: "你是在跟我装糊涂吗？还是说，你觉得你做过的恶行也像你的脸一样，可以被你高超的化妆技术轻易遮盖掉？",
                        npc: 700302,
                    },
                    {
                        id: 51009861,
                        content: "也罢，那我来帮你回忆一下吧。",
                        npc: 700302,
                    },
                    {
                        id: 51009862,
                        content:
                            "十六年前，冰湖城发生了一起绑架案，一个叫西格的年轻人绑架了时任格雷姆矿场负责人法布瑞斯·鲁斯福德的女儿——艾诺拉·鲁斯福德。",
                        npc: 700302,
                    },
                    {
                        id: 51009863,
                        content: "在抵抗抓捕的过程中，西格不慎点燃了房屋，导致了艾诺拉丧生，而他也因此被判处死刑。",
                        npc: 700302,
                    },
                    {
                        id: 51009864,
                        content: "那起陈年旧事我的确有所耳闻。真是一出令人扼腕的悲剧，愿那个可怜的女孩安息。",
                        npc: 700300,
                    },
                    {
                        id: 51009865,
                        content: "——但我只是近年来才来到冰湖城，那起案件，又和我有什么关系呢？",
                        npc: 700300,
                    },
                    {
                        id: 51009866,
                        content: "当然是因为，那场火灾有一个幸存者。",
                        npc: 700302,
                    },
                    {
                        id: 51009867,
                        content:
                            "根据一位知情人的说法，在火灾现场除了西格和艾诺拉以外，还有一个人——西格的妹妹，维尔莉特。一个与当年的艾诺拉年岁相仿的女孩。",
                        npc: 700302,
                    },
                    {
                        id: 51009868,
                        content: "在混乱的火灾现场，那位知情人救出了当时也在屋子里的维尔莉特……或者说，他<H>以为</>自己救出了维尔莉特。",
                        npc: 700302,
                    },
                    {
                        id: 51009869,
                        content:
                            "到此为止，我说的没错吧？十六年前杀害了维尔莉特，又假扮成她，利用她的身份蒙骗多纳特逃出了冰湖城的你，艾诺拉·鲁斯福德！",
                        npc: 700302,
                    },
                    {
                        id: 51009870,
                        content: "……呵，有趣的剧本，是不多见的悬疑题材呢。",
                        npc: 700300,
                    },
                    {
                        id: 51009871,
                        content: "说下去，我喜欢听。",
                        npc: 700300,
                    },
                    {
                        id: 51009872,
                        content: "这些年我一直在调查那桩案件，烧焦的尸体，幸存的维尔莉特，这一切都太过巧合。",
                        npc: 700302,
                    },
                    {
                        id: 51009873,
                        content: "这一切似乎都有着某种关联，但破碎的关键词之间缺少一条能将这一切连起来的线。",
                        npc: 700302,
                    },
                    {
                        id: 51009874,
                        content: "如果不是我在卫戍部队期间给法布瑞斯那个家伙当过几天护卫，并且凑巧听到了她女儿的歌声——",
                        npc: 700302,
                    },
                    {
                        id: 51009875,
                        content: "恐怕我永远都不会把这些和你联系起来，“千面的薇奥莱塔”。",
                        npc: 700302,
                    },
                    {
                        id: 51009876,
                        content: "我用各种方法试图调查你的生活习惯，比如……找一些人以送信的名义观察你。",
                        npc: 700302,
                    },
                    {
                        id: 51009877,
                        content: "原来那个卫兵是你派来的。",
                        npc: 700300,
                    },
                    {
                        id: 51009878,
                        content: "不，他的确是你的剧迷，我也只是稍稍煽动了一下罢了。多亏了他，我才最终确定了你的身份。",
                        npc: 700302,
                    },
                    {
                        id: 51009879,
                        content: "即便如此，我还是有一件事没有搞清楚。",
                        npc: 700302,
                    },
                    {
                        id: 51009880,
                        content: "在火灾中和维尔莉特调换身份，这种方法没有西格和维尔莉特的配合难以实施，你到底是怎么说服他们的？",
                        npc: 700302,
                    },
                    {
                        id: 51009881,
                        content: "我还以为你要问什么呢……这种事不是很简单吗？",
                        npc: 700300,
                    },
                    {
                        id: 51009882,
                        content: "我可是那个法布瑞斯的女儿，既然你曾经在父亲的手下工作过，就应该知道触碰他逆鳞的后果。",
                        npc: 700300,
                    },
                    {
                        id: 51009883,
                        content: "可怜的西格早就做好了牺牲自己的准备，但按父亲的作风，维尔莉特也无法幸免。",
                        npc: 700300,
                    },
                    {
                        id: 51009884,
                        content: "而我则告诉他们：唯一的办法，就是在拿到赎金后尽可能拖延时间，同时想办法制造混乱让维尔莉特逃跑。",
                        npc: 700300,
                    },
                    {
                        id: 51009885,
                        content: "真是可笑，惊慌失措的他居然真的独自去拖延卫戍部队，期待一个重病的小姑娘在火灾中逃出生天……",
                        npc: 700300,
                    },
                    {
                        id: 51009886,
                        content:
                            "我抓住了这个机会，杀死了那个碍事的小可怜，用她的身份摆脱了那栋破房子，也摆脱了我的父亲，摆脱了所有阻止我踏上舞台的一切。",
                        npc: 700300,
                    },
                    {
                        id: 51009887,
                        content: "……",
                        npc: 700302,
                    },
                    {
                        id: 51009888,
                        content: "啊呀，得到了自己十几年来日思夜想的真相，你看起来并不开心，吉赛尔女士。",
                        npc: 700300,
                    },
                    {
                        id: 51009889,
                        content: "不可理喻……就为了这种理由？就为了这种理由害死了两个人？！你把人命当成什么了！",
                        npc: 700302,
                    },
                    {
                        id: 51009890,
                        content: "那么你打算怎么做？去满世界宣扬薇奥莱塔的恶毒手段让我身败名裂？又或者……现在就为他们两人报仇？",
                        npc: 700300,
                    },
                    {
                        id: 51009891,
                        content: "……我原本只是想揭露这一切，然后把你交给卫戍部队。",
                        npc: 700302,
                    },
                    {
                        id: 51009892,
                        content:
                            "（吉赛尔从腰间拔出匕首，她愤怒的神情，让你似乎感觉自己听到了攥紧刀柄，又或者是几乎要把牙齿咬碎的碾磨声。）",
                    },
                    {
                        id: 51009893,
                        content:
                            "（如果再不阻止她，那柄利刃毫无疑问会在下一刻划开这冰湖城最美妙的歌喉。无论如何，一场命案是你不愿看到的。）",
                    },
                    {
                        id: 51010143,
                        content: "请等一下！",
                        npc: 100001,
                    },
                    {
                        id: 51009894,
                        content: "{nickname}？你为什么会在这里？",
                        npc: 700300,
                    },
                    {
                        id: 51009895,
                        content: "闪开，我无法容忍这样的败类继续活在世上！",
                        npc: 700302,
                    },
                    {
                        id: 51009896,
                        content: "（吉赛尔似乎因愤怒失去了理智，得想办法让她冷静下来。）",
                        npc: 100001,
                    },
                ],
            },
            {
                id: 20023304,
                dialogues: [
                    {
                        id: 51009951,
                        content: "这里已经重建了，但在我眼里，它的每一寸砖石都还是当年的样子。",
                        npc: 700300,
                    },
                    {
                        id: 51009952,
                        content: "维尔莉特，我又来看你了……和我们的作品一起。",
                        npc: 700300,
                    },
                    {
                        id: 51009953,
                        content:
                            "已经有聪明的家伙知道了我们的故事，但不知道为什么，我并不害怕，反而有些轻松。也许是因为我终于可以堂堂正正对你说……西格的事，对不起。",
                        npc: 700300,
                    },
                    {
                        id: 51009954,
                        content:
                            "（薇奥莱塔的指尖在墙壁上轻轻拂过，像是在和多年不见老友诉说着过往的经历。或许是发觉已经到了应当离别的时候，她才会选择在此刻回到这里。）",
                    },
                    {
                        id: 51009955,
                        content: "谢谢你们纵容我的任性……",
                        npc: 700300,
                    },
                    {
                        id: 51009956,
                        content: "所以，薇奥莱塔，你主动担下罪行还有另一个原因——西格的死并不在你的预料之中，对吗？",
                        npc: 100001,
                    },
                    {
                        id: 51009957,
                        content:
                            "……法布瑞斯·鲁斯福德，那是个冷酷无情的男人。那些矿工因为他几乎食不果腹，手下的卫戍部队也因为他的残暴管理苦不堪言。",
                        npc: 700300,
                    },
                    {
                        id: 51009958,
                        content:
                            "就连自己的亲生女儿，那个男人也不留情面地否定她的一切，践踏她的梦想，禁锢她的自由，强迫那个可怜的孩子按照他规划好的无趣的人生去成长。",
                        npc: 700300,
                    },
                    {
                        id: 51009959,
                        content:
                            "可就是这样一个冷酷无情的人，却因为亲生女儿的死，越过了所有的审判流程亲自将绑架犯处决——即使那会让他被名利场上的敌人抓住把柄，最终被解职。",
                        npc: 700300,
                    },
                    {
                        id: 51009960,
                        content:
                            "我设想过无数种方案，要怎么在逃出他的掌控之后，再想办法悄悄把书信送到法庭上去，这样就能把西格救出来。但我唯独没想到……",
                        npc: 700300,
                    },
                    {
                        id: 51009961,
                        content: "你的父亲比你想象中爱你……",
                        npc: 700302,
                    },
                    {
                        id: 51009962,
                        content:
                            "……后来，我无数次想要说出实情，但海伯利亚只是起点，她的作品还需要我传遍整个世界——我必须遵守我的承诺，至少我必须要这么想。",
                        npc: 700300,
                    },
                    {
                        id: 51009963,
                        content:
                            "所以当你找上我的时候，我反而感到有些轻松……我已经有了很多学生，他们都是拥有天赋的孩子，他们可以代替我把《普蒂妮》带上更多更广阔的舞台。",
                        npc: 700300,
                    },
                    {
                        id: 51009964,
                        content: "而你，只需要在这里承认吉赛尔的指控，就可以洗去西格身上本不属于他的罪名。",
                        npc: 100001,
                    },
                    {
                        id: 51009965,
                        content: "……我会跟你走的，吉赛尔。但必须在你放了罗莎琳·马格努斯之后。",
                        npc: 700300,
                    },
                    {
                        id: 51009966,
                        content: "不管是为了我自己，还是为了西格和维尔莉特，她都绝对不能有事。",
                        npc: 700300,
                    },
                    {
                        id: 51009967,
                        content: "……她已经离开冰湖城了。",
                        npc: 700302,
                    },
                    {
                        id: 51009968,
                        content: "什么？",
                        npc: 700300,
                    },
                    {
                        id: 51009969,
                        content: "既然你作为声乐老师和她的父母打过交道，就应该知道她所面临的处境。",
                        npc: 700302,
                    },
                    {
                        id: 51009970,
                        content: "雏鸟为了摆脱囚笼不惜折断翅膀，作为师徒，你们两个倒是如出一辙。",
                        npc: 700302,
                    },
                    {
                        id: 51009971,
                        content: "原来你从一开始就在骗我……",
                        npc: 700300,
                    },
                    {
                        id: 51009972,
                        content: "我也不会想到会和你关系如此密切的人会突然跑过来雇我“绑架”她，我只是利用下这小小的巧合罢了。",
                        npc: 700302,
                    },
                    {
                        id: 51009973,
                        content: "怎么样，我的演技是不是也还不错？是时候考虑接下来要不要转行了。",
                        npc: 700302,
                    },
                    {
                        id: 51009974,
                        content: "吉赛尔不打算做狩月人了？",
                        npc: 100001,
                    },
                    {
                        id: 51009975,
                        content: "呵，也多亏了马格努斯家大小姐的绑架案闹得满城风雨，接下来很长一段时间我也得避避风头了。",
                        npc: 700302,
                    },
                    {
                        id: 51009976,
                        content: "至于薇奥莱塔……",
                        npc: 700302,
                    },
                    {
                        id: 51009977,
                        content: "{nickname}，你来做决定吧。既然你比我先一步查清真相，就由你来选择怎么处置她吧。",
                        npc: 700302,
                    },
                    {
                        id: 51009978,
                        content: "这样就好吗，吉赛尔？",
                        npc: 100001,
                    },
                    {
                        id: 51009979,
                        content: "我不知道。<H>揭露真相，她也许会因当年的欺骗行径名誉扫地，无法再登台演出。隐瞒真相，那西格的冤屈……</>",
                        npc: 700302,
                    },
                    {
                        id: 51009980,
                        content: "我现在脑子很乱，或许现在让你做决定才是正确的选择。",
                        npc: 700302,
                    },
                    {
                        id: 51009981,
                        content: "如果是你做出的决定……我会接受的。",
                        npc: 700300,
                    },
                ],
            },
            {
                id: 20023305,
                dialogues: [
                    {
                        id: 51010012,
                        content: "早上好，薇奥莱塔女士。",
                        npc: 100001,
                    },
                    {
                        id: 51010013,
                        content: "你们来了，给，这是你们二位的门票。",
                        npc: 700300,
                    },
                    {
                        id: 51010014,
                        content: "那我就不客气了。",
                        npc: 700302,
                    },
                    {
                        id: 51010015,
                        content: "请便，让《普蒂妮》传遍世界是维尔莉特的遗愿，只是少收两张票而已，她不会有意见的。",
                        npc: 700300,
                    },
                    {
                        id: 51010016,
                        content: "只是……",
                        npc: 700300,
                    },
                    {
                        id: 51010017,
                        content: "你在想罗莎琳小姐吗？",
                        npc: 100001,
                    },
                    {
                        id: 51010018,
                        content: "嗯，虽说是给她的送行演出，但我也不知道她是否还在冰湖城中，能否看到这场她最喜欢的戏。",
                        npc: 700300,
                    },
                    {
                        id: 51010019,
                        content: "别看我啊，为了不让她再被父母抓回去，连我也不知道她现在的行踪。",
                        npc: 700302,
                    },
                    {
                        id: 51010029,
                        content: "呼，的确是一出好戏，差点让我忘了我最讨厌这种人多的封闭空间。",
                        npc: 700302,
                    },
                    {
                        id: 51010030,
                        content: "感觉稍微能够理解他们很多人为什么这么喜欢舞台了。",
                        npc: 100001,
                    },
                    {
                        id: 51010031,
                        content: "只希望一个两个的以后都让人省点心……我可不想再接到让我绑架委托人的单了。",
                        npc: 700302,
                    },
                    {
                        id: 51010032,
                        content: "虽然我自己也没什么资格说她们，明明我也是个钻了十几年牛角尖的怪人。",
                        npc: 700302,
                    },
                    {
                        id: 51010033,
                        content: "我稍微有点好奇你为什么对这件案子这么执着。",
                        npc: 100001,
                    },
                    {
                        id: 51010034,
                        content: "……我可以不说吗？",
                        npc: 700302,
                    },
                    {
                        id: 51010035,
                        content: "如果你不愿意那就算了，没关系。",
                        npc: 100001,
                    },
                    {
                        id: 51010036,
                        content: "算了，对你这么好说话的人还讲谜语就没意思了。",
                        npc: 700302,
                    },
                    {
                        id: 51010037,
                        content: "多纳特应该告诉过你，是他举报了西格的绑架行为。而当时收到举报的人，就是我。",
                        npc: 700302,
                    },
                    {
                        id: 51010038,
                        content:
                            "最初为了避免打草惊蛇，我的计划是，我一个人秘密前去和西格谈判，争取解救人质……但是考虑到事关长官的女儿，我犹豫再三，还是汇报给了他。",
                        npc: 700302,
                    },
                    {
                        id: 51010039,
                        content: "但后续你也知道了，艾诺拉……薇奥莱塔的父亲，盛怒之下驳回了我的方案，直接带着大队人马包围了那栋房子。",
                        npc: 700302,
                    },
                    {
                        id: 51010040,
                        content: "如果当初我能够坚持自己的想法，说不定这一切都不会发生。",
                        npc: 700302,
                    },
                    {
                        id: 51010041,
                        content: "虽然有些对不起薇奥莱塔，可至少西格不会因为虚假的罪名被处死。",
                        npc: 700302,
                    },
                    {
                        id: 51010042,
                        content: "吉赛尔……",
                        npc: 100001,
                    },
                    {
                        id: 51010043,
                        content: "我……能理解长官的心情，不管是谁都无法接受女儿死于非命。但我无法赞同在调查清楚一切之前就做出决断。",
                        npc: 700302,
                    },
                    {
                        id: 51010044,
                        content: "我不是为了这样才进入卫戍部队的。",
                        npc: 700302,
                    },
                    {
                        id: 51010045,
                        content: "卫戍部队少了这么一个正义感强烈的人是他们的损失。",
                        npc: 100001,
                    },
                    {
                        id: 51010046,
                        content: "这是在夸我吗？",
                        npc: 700302,
                    },
                    {
                        id: 51010047,
                        content:
                            "反正都是过去的事了，现在事情解决了，接下来我想想办法，看看能不能把绑架纵火案的部分真相公开……当然，前提是隐瞒薇奥莱塔的真实身份。",
                        npc: 700302,
                    },
                    {
                        id: 51010048,
                        content: "找不到艾诺拉本人的话，没有足够证据能说服卫戍部队的人翻案吧？",
                        npc: 100001,
                    },
                    {
                        id: 51010049,
                        content: "卫戍部队？没那个必要，我打算把消息告诉报社或者其他什么机构，在坊间传播的效果可比那些死板的公文要好多了。",
                        npc: 700302,
                    },
                    {
                        id: 51010050,
                        content: "这样真的能行吗……",
                        npc: 100001,
                    },
                    {
                        id: 51010051,
                        content:
                            "人们总是愿意相信某件事的背后另有隐情，只有这样才会显得自己拥有独立思考的智慧。这次就让我小小的利用一下这种心理吧。",
                        npc: 700302,
                    },
                    {
                        id: 51010052,
                        content: "……啊！",
                        npc: 700305,
                    },
                    {
                        id: 51010053,
                        content: "抱……抱歉，我刚才没看路！没受伤吧？有没有哪里不舒服？",
                        npc: 700305,
                    },
                    {
                        id: 51010054,
                        content: "我没事，下次注意就好。",
                        npc: 100001,
                    },
                    {
                        id: 51010055,
                        content: "嗯——",
                        npc: 700305,
                    },
                    {
                        id: 51010056,
                        content: "我的脸上怎么了吗？",
                        npc: 100001,
                    },
                    {
                        id: 51010057,
                        content: "没什么，嘻嘻……谢谢你的草药。啊，约定好的时间要过了！",
                        npc: 700305,
                    },
                    {
                        id: 51010058,
                        content: "草药……？等一下你东西掉了！",
                        npc: 100001,
                    },
                    {
                        id: 51010059,
                        content: "——送给你了！！",
                        npc: 700305,
                    },
                    {
                        id: 51010060,
                        content: "现在的年轻人还真是风风火火。",
                        npc: 700302,
                    },
                    {
                        id: 51010061,
                        content: "说什么送给我了……这上面好像绣了字，是那个女孩的名字吗？",
                        npc: 100001,
                    },
                    {
                        id: 51010062,
                        content: "……普蒂妮？",
                        npc: 100001,
                    },
                    {
                        id: 51010063,
                        content: "如果你以后遇到了一个叫普蒂妮的女孩，请一定要认出我，我也一定会认出你的。",
                    },
                    {
                        id: 51010064,
                        content: "怎么了，你笑什么？",
                        npc: 700302,
                    },
                    {
                        id: 51010065,
                        content: "如果连吉赛尔都没有认出来的话，看来有千面的不止是薇奥莱塔。",
                        npc: 100001,
                    },
                    {
                        id: 51010066,
                        content: "人生的剧目不止有一场，我们总会在新的舞台再见。在那之前，祝你旅途愉快，箱子小姐。",
                        npc: 100001,
                    },
                    {
                        id: 51010024,
                        content: "你找到了薇奥莱塔为你安排的座位，在观众席等待着演出开场。",
                    },
                    {
                        id: 51010025,
                        content: "随着看台的灯光逐渐熄灭，洪亮的女声唱白带着你的期待与好奇从幕布后侵染到整个演出厅。",
                    },
                    {
                        id: 51010026,
                        content: "看台下异常安静，尚未习惯这种环境的你稍稍有些不安。",
                    },
                    {
                        id: 51010027,
                        content: "控制住对精彩桥段的赞美并非易事，你害怕自己无意识的感叹扰了他人雅兴。",
                    },
                    {
                        id: 51010028,
                        content: "不过这种担忧是多余的——为剧中人所牵动的你甚至忘记了鼓掌，直至演出结束……",
                    },
                ],
            },
            {
                id: 20023306,
                dialogues: [
                    {
                        id: 51010078,
                        content: "你找到了薇奥莱塔为你安排的座位，在观众席等待着演出开场。",
                    },
                    {
                        id: 51010079,
                        content: "随着看台的灯光逐渐熄灭，洪亮的女声唱白带着你的期待与好奇从幕布后侵染到整个演出厅。",
                    },
                    {
                        id: 51010080,
                        content: "看台下异常安静，尚未习惯这种环境的你稍稍有些不安。",
                    },
                    {
                        id: 51010081,
                        content: "控制住对精彩桥段的赞美并非易事，你害怕自己无意识的感叹扰了他人雅兴。",
                    },
                    {
                        id: 51010082,
                        content: "不过这种担忧是多余的——",
                    },
                    {
                        id: 51010083,
                        content: "为剧中人所牵动的你甚至忘记了鼓掌，直至演出结束……",
                    },
                    {
                        id: 51010067,
                        content: "……",
                        npc: 100001,
                    },
                    {
                        id: 51010068,
                        content: "早上好，{nickname}，怎么看起来不太开心？",
                        npc: 700300,
                    },
                    {
                        id: 51010069,
                        content: "薇奥莱塔女士……",
                        npc: 100001,
                    },
                    {
                        id: 51010070,
                        content: "好啦，不用再说了。明明要退休的是我，怎么反倒是你在难过。",
                        npc: 700300,
                    },
                    {
                        id: 51010071,
                        content: "你只是做出了每一个坚守底线的人会做出的选择，不要为此有负担。就当是帮忙抓到了一个离家出走的孩子，好吗？",
                        npc: 700300,
                    },
                    {
                        id: 51010072,
                        content: "看来人都到齐了？",
                        npc: 700302,
                    },
                    {
                        id: 51010073,
                        content: "吉赛尔女士也来了，给，这是二位的门票。",
                        npc: 700300,
                    },
                    {
                        id: 51010074,
                        content: "那我就不客气了。已经和卫戍部队的朋友们打过招呼了，直到演出结束前他们都不会有动作。",
                        npc: 700302,
                    },
                    {
                        id: 51010075,
                        content: "非常感谢。演出快要开始了，我先失陪去后台了。",
                        npc: 700300,
                    },
                    {
                        id: 51010076,
                        content: "那我们也进去吧，虽然好像是我导致的，不过薇奥莱塔的告别演出的确让人期待。",
                        npc: 700302,
                    },
                    {
                        id: 51010077,
                        content: "好。",
                        npc: 100001,
                    },
                    {
                        id: 51010084,
                        content: "吉赛尔，我需要你给我一个解释！",
                        npc: 700304,
                    },
                    {
                        id: 51010085,
                        content: "哦？无所不知的法布瑞斯大人，有什么事是需要我来给你解释的？",
                        npc: 700302,
                    },
                    {
                        id: 51010086,
                        content: "是你举报了薇奥莱塔就是艾诺拉，可我带人来到了后台，那里一个人也没有！",
                        npc: 700304,
                    },
                    {
                        id: 51010087,
                        content: "是这件事啊……没想到您居然亲自来了，真是负责任的长官。",
                        npc: 700302,
                    },
                    {
                        id: 51010088,
                        content: "别跟我阴阳怪气！我命令你，马上带我找到艾诺拉！",
                        npc: 700304,
                    },
                    {
                        id: 51010089,
                        content:
                            "您似乎忘了一件事，我现在已经不是卫戍部队的人了，您也不是。我只是作为一介平民向卫戍部队提供了一些线索而已。",
                        npc: 700302,
                    },
                    {
                        id: 51010090,
                        content: "所以我没有义务听从你的命令，噢，也许你可以给“狩月人吉赛尔”发一份委托？",
                        npc: 700302,
                    },
                    {
                        id: 51010091,
                        content: "你……！发委托就发委托！",
                        npc: 700304,
                    },
                    {
                        id: 51010092,
                        content: "好的，我不接。",
                        npc: 700302,
                    },
                    {
                        id: 51010093,
                        content: "你耍我？！",
                        npc: 700304,
                    },
                    {
                        id: 51010094,
                        content: "毕竟我现在有绑架伯爵千金的嫌疑，狩月人业务也只能暂停咯。",
                        npc: 700302,
                    },
                    {
                        id: 51010095,
                        content: "说到底，如果当年您老老实实听从我的建议推进谈判，如今也不会有这么多麻烦事。",
                        npc: 700302,
                    },
                    {
                        id: 51010096,
                        content: "你这女人……算我瞎了眼，居然信了你能找到艾诺拉。",
                        npc: 700304,
                    },
                    {
                        id: 51010097,
                        content: "艾诺拉……我的女儿，我会找到你的……至于你，以后别再让我看到你！",
                        npc: 700304,
                    },
                    {
                        id: 51010098,
                        content: "求之不得。",
                        npc: 700302,
                    },
                    {
                        id: 51010099,
                        content: "吉赛尔，你还好吧？",
                        npc: 100001,
                    },
                    {
                        id: 51010100,
                        content: "我很好，在卫戍部队的时候可没机会这么和他说话，心情好多了。",
                        npc: 700302,
                    },
                    {
                        id: 51010101,
                        content: "刚刚那个人是……",
                        npc: 100001,
                    },
                    {
                        id: 51010102,
                        content: "法布瑞斯·鲁斯福德，薇奥莱塔的亲生父亲，还是和十六年前一样沉不住气。",
                        npc: 700302,
                    },
                    {
                        id: 51010103,
                        content: "薇奥莱塔女士呢？",
                        npc: 100001,
                    },
                    {
                        id: 51010104,
                        content: "跑了，法布瑞斯带人闯进后台的时候那里一个人都没有。",
                        npc: 700302,
                    },
                    {
                        id: 51010105,
                        content: "……啊！",
                        npc: 700305,
                    },
                    {
                        id: 51010106,
                        content: "抱……抱歉，我刚才没看路！没受伤吧？有没有哪里不舒服？",
                        npc: 700305,
                    },
                    {
                        id: 51010107,
                        content: "我没事，下次注意就好。",
                        npc: 100001,
                    },
                    {
                        id: 51010108,
                        content: "嗯——",
                        npc: 700305,
                    },
                    {
                        id: 51010109,
                        content: "我的脸上怎么了吗？",
                        npc: 100001,
                    },
                    {
                        id: 51010110,
                        content: "没什么，嘻嘻……谢谢你的草药。",
                        npc: 700305,
                    },
                    {
                        id: 51010111,
                        content: "约定的时间要来不及了哦。",
                        npc: 700311,
                    },
                    {
                        id: 51010112,
                        content: "啊抱歉了我得走了！来了来了，等等我！",
                        npc: 700305,
                    },
                    {
                        id: 51010113,
                        content: "什么草药……？等一下，你东西掉了！",
                        npc: 100001,
                    },
                    {
                        id: 51010114,
                        content: "——送给你了！！",
                        npc: 700305,
                    },
                    {
                        id: 51010115,
                        content: "现在的年轻人还真是风风火火。",
                        npc: 700302,
                    },
                    {
                        id: 51010116,
                        content: "说什么送给我了……这上面好像绣了字，是那个女孩的名字吗？",
                        npc: 100001,
                    },
                    {
                        id: 51010117,
                        content: "勇敢的蝴蝶挣脱了茧，向着天空振翅，她随风隐去，就像一枝紫罗兰消失在花海。",
                        npc: 700311,
                    },
                    {
                        id: 51010118,
                        content: "她可能很长一段时间都不会再同你我见面了……所以收下这份临别的礼物吧，她珍视的朋友。",
                        npc: 700311,
                    },
                    {
                        id: 51010119,
                        content: "临别的礼物……这上面好像绣了字，是那个女孩的名字吗？",
                        npc: 100001,
                    },
                    {
                        id: 51010120,
                        content: "……普蒂妮？",
                        npc: 100001,
                    },
                    {
                        id: 51010121,
                        content: "如果你以后遇到了一个叫普蒂妮的女孩，请一定要认出我，我也一定会认出你的。",
                    },
                    {
                        id: 51010122,
                        content: "原来是这样啊，看来箱子小姐她平安踏上自己的旅途了。这么说来你是——",
                        npc: 100001,
                    },
                    {
                        id: 51010123,
                        content: "嘘——虽然我认可你们的揭发，但还是会保守秘密的孩子更可爱哦。",
                        npc: 700311,
                    },
                    {
                        id: 51010124,
                        content: "就这么暴露身份，你不怕我再找麻烦？",
                        npc: 700302,
                    },
                    {
                        id: 51010125,
                        content:
                            "“薇奥莱塔”不会再登台，可我短期内并不打算离开这里。当然，就算你再次揭发，我也不会有怨言。只是事关我的另一位学生，我无法弃之不顾。",
                        npc: 700311,
                    },
                    {
                        id: 51010126,
                        content: "……",
                        npc: 700302,
                    },
                    {
                        id: 51010127,
                        content: "……感谢你的沉默。",
                        npc: 700311,
                    },
                    {
                        id: 51010128,
                        content: "那么失陪了，愿二位度过一个美妙的假日。",
                        npc: 700311,
                    },
                    {
                        id: 51010129,
                        content: "哈，我就知道，那样的女人怎么可能乖乖束手就擒。",
                        npc: 700302,
                    },
                    {
                        id: 51010130,
                        content: "你看起来好像有点高兴？",
                        npc: 100001,
                    },
                    {
                        id: 51010131,
                        content: "这样吗？说实话，我也纠结过到底要不要牺牲活人的生活去换死者的清白……",
                        npc: 700302,
                    },
                    {
                        id: 51010132,
                        content: "如你所见，我做出了选择，这是吉赛尔的执着。",
                        npc: 700302,
                    },
                    {
                        id: 51010133,
                        content: "不过既然能在二选一的局面被打破后而感到开心，说明我这十六年来也有了成长不是吗？",
                        npc: 700302,
                    },
                    {
                        id: 51010134,
                        content: "要是十六年前的我也能像现在一样，或许就不会有人因此逝去了。",
                        npc: 700302,
                    },
                    {
                        id: 51010135,
                        content: "这不是你的错，吉赛尔。",
                        npc: 100001,
                    },
                    {
                        id: 51010136,
                        content: "放心，我没有难过，我只是在想“狩月人吉赛尔”歇业后要去做点什么。",
                        npc: 700302,
                    },
                    {
                        id: 51010137,
                        content: "我放弃当演员了，看过薇奥莱塔的演出之后很难再夸下这种海口啊……",
                        npc: 700302,
                    },
                ],
            },
        ],
    },
    {
        id: 200234,
        quests: [
            {
                id: 20023401,
                dialogues: [
                    {
                        id: 51012101,
                        content: "喵，喵喵！",
                        npc: 700334,
                    },
                    {
                        id: 51012102,
                        content: "（离得老远，野猫就兴奋地叫着，一蹦一跳地朝你跑来。）",
                    },
                    {
                        id: 51012103,
                        content: "喵。",
                        npc: 700334,
                    },
                    {
                        id: 51012104,
                        content:
                            "（它看起来很有精神，并不需要你陪它玩或者给它找吃的。而是围着你的脚转了两圈后跑向了休憩之所的方向，转头看着你，似乎想要你跟上去。） ",
                    },
                ],
            },
            {
                id: 20023402,
                dialogues: [
                    {
                        id: 51012107,
                        content: "（野猫从休憩之所附近的草丛里叼出一条硬邦邦的冻鱼，歪头看着你，似乎那便是它的谢礼。）",
                    },
                    {
                        id: 51012108,
                        content: "（你捡起冻鱼，有什么叮叮当当地从冻鱼口中掉了出来——哦，那是几枚闪着暗淡光泽的铜币……）",
                    },
                    {
                        id: 51012109,
                        content: "你是记住了我的味道，所以给我准备了礼物吗？",
                        npc: 100001,
                    },
                    {
                        id: 51012110,
                        content: "喵——",
                        npc: 700335,
                    },
                    {
                        id: 51012111,
                        content: "（野猫好似听懂了你的话一般长叫了一声，亲昵地用头蹭着你的脚。）",
                    },
                ],
            },
        ],
    },
    {
        id: 200301,
        quests: [
            {
                id: 20030106,
                dialogues: [
                    {
                        id: 51100104,
                        content: "究竟怎么了！白龙神君呢！白龙神君难道不保佑我了吗！",
                        npc: 700319,
                    },
                    {
                        id: 51100105,
                        content: "这半路杀出的没头没脑没由来的家伙又是谁？",
                        npc: 700319,
                    },
                    {
                        id: 51100106,
                        content: "这一切的一切的……到底怎么回事！",
                        npc: 700319,
                    },
                ],
            },
        ],
    },
    {
        id: 200303,
        quests: [
            {
                id: 20030300,
                dialogues: [
                    {
                        id: 51102001,
                        content: "二位英雄请留步。",
                        npc: 700322,
                    },
                    {
                        id: 51102002,
                        content: "什么事？",
                        npc: 100001,
                    },
                    {
                        id: 51102003,
                        content: "说来唐突，阁下可曾听闻玄天口谕？",
                        npc: 700322,
                    },
                    {
                        id: 51102004,
                        content: "玄天口谕？那是什么东西？",
                        npc: 700363,
                    },
                    {
                        id: 51102005,
                        content: "即是于思绪中回荡之声，其声若……若来自九霄天外，如同严父，又似慈母……",
                        npc: 700322,
                    },
                    {
                        id: 51102006,
                        content: "（那个声音，难道他说的是……）",
                        npc: 100001,
                    },
                    {
                        id: 51102007,
                        content: "你也听到过那个声音？",
                        npc: 100001,
                    },
                    {
                        id: 51102008,
                        content: "什么叫“也”？敢情还真听过？",
                        npc: 700322,
                    },
                    {
                        id: 51102009,
                        content: "嗯？明明是你先问的，你怎么好像一幅很惊讶的样子？",
                        npc: 700363,
                    },
                    {
                        id: 51102010,
                        content: "没没没，只是确信了您就是在下苦苦等候的英雄，一时有感而发。",
                        npc: 700322,
                    },
                    {
                        id: 51102011,
                        content: "咱们言归正传，在下偶得天机，如今时机已到，便与英雄透露一二……",
                        npc: 700322,
                    },
                    {
                        id: 51102012,
                        content: "什么天机，说来听听？",
                        npc: 100001,
                    },
                    {
                        id: 51102013,
                        content: "莫急莫急，这第一句，“重山叠水之外，孤帆朽木之间”。",
                        npc: 700322,
                    },
                    {
                        id: 51102014,
                        content: "听起来像是在说黑市旁的那艘沉船……那里有什么？",
                        npc: 100001,
                    },
                    {
                        id: 51102015,
                        content: "英雄果然聪慧，在下正是得这第一条口谕才走访此间。",
                        npc: 700322,
                    },
                    {
                        id: 51102016,
                        content: "在下观得二位仪表堂堂器宇不凡，又有霞光普照，定是财运亨通之人。这预言所示之处，应是二位的财源所在了。",
                        npc: 700322,
                    },
                    {
                        id: 51102017,
                        content: "那我们就四处走走看看，见到可疑的地方就挖开，说不定能找到什么宝藏呢！",
                        npc: 700363,
                    },
                    {
                        id: 51102018,
                        content: "如果真要那么简单就能找到宝藏，恐怕他也不会在这抓人帮忙了。",
                        npc: 100001,
                    },
                    {
                        id: 51102019,
                        content:
                            "此言差矣，生死有命富贵在天，在下岂有篡天改命之能？该是二位的命数，在下不过指点一二，只求与鸿运之人结缘罢了。",
                        npc: 700322,
                    },
                    {
                        id: 51102020,
                        content: "若二位不信，在下这卦分文不取，等二位去一探究竟再回来不迟。",
                        npc: 700322,
                    },
                ],
            },
            {
                id: 20030301,
                dialogues: [
                    {
                        id: 51102025,
                        content: "这是……五枚铜币？",
                        npc: 100001,
                    },
                    {
                        id: 51102026,
                        content: "哦，果真有所收获，看来喻示所言非虚。",
                        npc: 700322,
                    },
                    {
                        id: 51102027,
                        content: "好小气，这真的是宝藏吗，不会是哪个小朋友偷偷藏的零花钱吧？",
                        npc: 700363,
                    },
                    {
                        id: 51102028,
                        content: "这……英雄莫怪，这一遭乃是必经之路，兴许下一程就有收获了呢？",
                        npc: 700322,
                    },
                    {
                        id: 51102029,
                        content: "总感觉你在骗我……",
                        npc: 100001,
                    },
                    {
                        id: 51102030,
                        content: "话不能这么说，在下只是遇到有缘人便多言几句，并无意强求。",
                        npc: 700322,
                    },
                    {
                        id: 51102031,
                        content: "这第二句，“枯骨独卧折戟侧，苔深犹照石海空”。是否要前去寻这地方，英雄自便就是。",
                        npc: 700322,
                    },
                    {
                        id: 51102032,
                        content: "（折戟……石海……？听起来有些熟悉，有时间的话还是去看看吧。）",
                        npc: 100001,
                    },
                ],
            },
            {
                id: 20030302,
                dialogues: [
                    {
                        id: 51102033,
                        content: "那个神秘兮兮的家伙说的地方应该就在这附近……",
                        npc: 100001,
                    },
                    {
                        id: 51102034,
                        content: "这个地方好阴森，真的会有宝藏吗？",
                        npc: 700363,
                    },
                    {
                        id: 51102035,
                        content: "如果真有宝藏，就不会有人把这件事告诉别人了吧？",
                        npc: 100001,
                    },
                    {
                        id: 51102036,
                        content: "吼——",
                        npc: 210087,
                    },
                    {
                        id: 51102037,
                        content: "又是这些大黑狗，到底是从哪里冒出来的！",
                        npc: 700363,
                    },
                    {
                        id: 51102038,
                        content: "快躲到我身后。",
                        npc: 100001,
                    },
                    {
                        id: 51102039,
                        content: "真是的，怎么突然冒出来这么多怪物，还好我们很强，要是一般人来这可就糟了。",
                        npc: 700363,
                    },
                    {
                        id: 51102040,
                        content: "很强的是……“我们”？",
                        npc: 100001,
                    },
                    {
                        id: 51102041,
                        content: "啊这个……还是不要找什么宝藏了，我们快离开这吧？",
                        npc: 700363,
                    },
                    {
                        id: 51102042,
                        content: "不着急，我们在这附近稍微走走吧，我有点好奇之前遇到的那个家伙到底想做什么。",
                        npc: 100001,
                    },
                ],
            },
            {
                id: 20030303,
                dialogues: [
                    {
                        id: 51102043,
                        content: "嗯？这是什么？",
                        npc: 700363,
                    },
                    {
                        id: 51102044,
                        content: "小仆从小仆从你快过来看，好像真的有宝藏诶！",
                        npc: 700363,
                    },
                    {
                        id: 51102045,
                        content: "那我们就不客气地收下啦！",
                        npc: 700363,
                    },
                    {
                        id: 51102046,
                        content: "且慢。",
                        npc: 700322,
                    },
                    {
                        id: 51102047,
                        content: "二位英雄，恐怕这些财物不能让你们带走。",
                        npc: 700322,
                    },
                    {
                        id: 51102048,
                        content: "你在这里干什么？",
                        npc: 100001,
                    },
                    {
                        id: 51102049,
                        content: "既然凶兽已驱，在下自然是取回应得之物。",
                        npc: 700322,
                    },
                    {
                        id: 51102050,
                        content: "多亏二位英雄“碰巧”来此除凶驱祸，不然在下埋在此处的积蓄怕是无法取回了。",
                        npc: 700322,
                    },
                    {
                        id: 51102051,
                        content: "如果是这样，一开始就实话实说不就好了？",
                        npc: 100001,
                    },
                    {
                        id: 51102052,
                        content: "此言差矣，在下若是寻求帮助，岂不是要凭空折损一笔报酬。",
                        npc: 700322,
                    },
                    {
                        id: 51102053,
                        content: "有道理……等等，这不就是让我们打白工嘛？！",
                        npc: 700363,
                    },
                    {
                        id: 51102054,
                        content: "是又如何？这些本就是在下的财产，二位总不能在大风九章之下强取豪夺吧？",
                        npc: 700322,
                    },
                    {
                        id: 51102055,
                        content: "你的财产？怕不是用你那套招摇撞骗得来的不义之财。",
                        npc: 100001,
                    },
                    {
                        id: 51102056,
                        content:
                            "这位英雄可不要凭空污人清白，未来之事皆无定数，在下不过是提出一种猜测，总有人愿意花些小钱为未来的发达买单。",
                        npc: 700322,
                    },
                    {
                        id: 51102057,
                        content: "至于能否兑现……就不在在下的能力范围之内了。",
                        npc: 700322,
                    },
                    {
                        id: 51102058,
                        content: "诚然，在下的做法有些不确定性，但既然大风九章从未降下裁决，英雄又如何能称之为招摇撞骗呢？",
                        npc: 700322,
                    },
                    {
                        id: 51102059,
                        content: "居然还一脸得意地解释起来了！这家伙惹我生气了！",
                        npc: 700363,
                    },
                    {
                        id: 51102060,
                        content: "……",
                        npc: 100001,
                    },
                    {
                        id: 51102061,
                        content: "小仆从你怎么不说话，你倒是想想办法啊。",
                        npc: 700363,
                    },
                ],
            },
            {
                id: 20030304,
                dialogues: [
                    {
                        id: 51102062,
                        content: "识相点就赶紧离开吧，若是再纠缠，恐怕大风九章就要对二位出手了。",
                        npc: 700322,
                    },
                    {
                        id: 51102063,
                        content: "怎么还不走？赖在这干嘛？",
                        npc: 700322,
                    },
                    {
                        id: 51102064,
                        content: "二位最好离那个箱子远点，不然在下就要叫人了！",
                        npc: 700322,
                    },
                    {
                        id: 51102065,
                        content: "在下真的要叫人了！",
                        npc: 700322,
                    },
                    {
                        id: 51102066,
                        content: "原来如此……",
                        npc: 100001,
                    },
                    {
                        id: 51102067,
                        content: "什……什么原来如此？",
                        npc: 700322,
                    },
                    {
                        id: 51102068,
                        content: "我本来还好奇你为什么要这么大费周章，还要自己跳出来亲自解说一番……",
                        npc: 100001,
                    },
                    {
                        id: 51102069,
                        content: "看来大风九章并没有认可这埋在荒郊野外的不义之财为你所有，所以你才要专门在我面前长篇大论试图劝退我们。",
                        npc: 100001,
                    },
                    {
                        id: 51102070,
                        content: "只要我像这样触碰到这个箱子，就会知道大风九章并不会生效，也就是说——这就是我捡到的。",
                        npc: 100001,
                    },
                    {
                        id: 51102071,
                        content: "真的诶，什么事都没有发生……",
                        npc: 700363,
                    },
                    {
                        id: 51102072,
                        content: "怪不得煜明说这黑市都是些鸡鸣狗盗之徒，大风九章竟被这样曲解利用……",
                        npc: 100001,
                    },
                    {
                        id: 51102073,
                        content: "你……你……",
                        npc: 700322,
                    },
                    {
                        id: 51102074,
                        content: "如何，要试试在大风九章之下强取豪夺吗？",
                        npc: 100001,
                    },
                    {
                        id: 51102075,
                        content: "就算你真的敢动手，你也打不过我们小仆从的哦~",
                        npc: 700363,
                    },
                    {
                        id: 51102076,
                        content: "你们……不要再让在下见到你们！否则肯定让你们吃不了兜着走！",
                        npc: 700322,
                    },
                    {
                        id: 51102077,
                        content: "哦是吗？如果下次再见你没能让我们吃不了兜着走，大风九章会不会觉得你在说谎呢？",
                        npc: 100001,
                    },
                    {
                        id: 51102078,
                        content: "你……我……哎！",
                        npc: 700322,
                    },
                    {
                        id: 51102079,
                        content: "哼，让你骗我们！宝箱~宝箱~看看里面有多少好东西吧。",
                        npc: 700363,
                    },
                    {
                        id: 51102080,
                        content: "（到头来还是没搞清楚那个声音是什么。）",
                        npc: 100001,
                    },
                    {
                        id: 51102081,
                        content: "（不过没想到会有人靠钻大风九章的空子牟利……这是抛下剑盾，将力量交予“规则”的结果？）",
                        npc: 100001,
                    },
                    {
                        id: 51102082,
                        content: "（虬先生……这也是你想让我看到的吗？）",
                        npc: 100001,
                    },
                ],
            },
        ],
    },
    {
        id: 200304,
        quests: [
            {
                id: 20030400,
                dialogues: [
                    {
                        id: 51104001,
                        content: "小仆从小仆从，听我说！锦鲤皎皎告诉了本魔王一个天大的秘密——",
                        npc: 700324,
                    },
                    {
                        id: 51104002,
                        content: "整个烟津渡最好吃最地道的小吃，就藏在这个码头的摊子里！这可是只有本地人才能知道的秘密，一般人她才不告诉！",
                        npc: 700324,
                    },
                    {
                        id: 51104003,
                        content: "就是前面的桂花糕摊位了，我们赶紧去看看吧！",
                        npc: 700324,
                    },
                ],
            },
            {
                id: 20030401,
                dialogues: [
                    {
                        id: 51104004,
                        content: "哥，这边这边！",
                        npc: 700327,
                    },
                    {
                        id: 51104005,
                        content: "别跑那么快啊，等等我！",
                        npc: 700326,
                    },
                    {
                        id: 51104006,
                        content: "哥，我想吃这个。",
                        npc: 700327,
                    },
                    {
                        id: 51104007,
                        content: "啊？桂花糕啊……明明说好不买这买那才带你出门的。",
                        npc: 700326,
                    },
                    {
                        id: 51104008,
                        content: "我没有买这买那，今天从出门到现在我明明只让你买了一次蜂蜜糍耙。",
                        npc: 700327,
                    },
                    {
                        id: 51104009,
                        content: "糍粑不好消化，刚吃完现在又要吃这桂花糕……",
                        npc: 700326,
                    },
                    {
                        id: 51104010,
                        content: "一会回家吃不下饭被阿娘骂事小，要是再晚上肚子胀到睡不着觉我可帮不了你。",
                        npc: 700326,
                    },
                    {
                        id: 51104011,
                        content: "我不管！今天吃不到桂花糕我就不回去了，到时候阿娘一着急你就惨咯。",
                        npc: 700327,
                    },
                    {
                        id: 51104012,
                        content: "行吧行吧，拗不过你。老板，要一份桂花糕。",
                        npc: 700326,
                    },
                    {
                        id: 51104013,
                        content: "好嘞。",
                        npc: 700328,
                    },
                    {
                        id: 51104014,
                        content: "呃……老板，桂花糕能卖半份……啊不，三分之一份吗？出门带的铜币好像不够了……",
                        npc: 700326,
                    },
                    {
                        id: 51104015,
                        content: "你这小家伙……罢了罢了。",
                        npc: 700328,
                    },
                    {
                        id: 51104016,
                        content: "我们家老爷子倒是交代过，要是有小孩子嘴馋也不用太计较，按老爷子说法，给你们两个小家伙出个谜语。",
                        npc: 700328,
                    },
                    {
                        id: 51104017,
                        content: "要是你俩能猜上来啊，这桂花糕送你们一份也行。",
                        npc: 700328,
                    },
                    {
                        id: 51104018,
                        content: "真的吗？",
                        npc: 700327,
                    },
                    {
                        id: 51104019,
                        content: "我骗你们两个小毛孩做什么。",
                        npc: 700328,
                    },
                    {
                        id: 51104020,
                        content: "小武，快说谢谢叔叔！",
                        npc: 700326,
                    },
                    {
                        id: 51104021,
                        content: "哎，莫着急谢，先听谜面。山腰悬玉钩，树杪挂银舟。圆缺妆台镜，阴晴刈麦秋。",
                        npc: 700328,
                    },
                ],
            },
            {
                id: 20030402,
                dialogues: [
                    {
                        id: 51104031,
                        content: "老板。",
                        npc: 100001,
                    },
                    {
                        id: 51104032,
                        content: "哟？看起来是外国客人，来给身边这位小朋友买点本地的桂花糕尝尝？",
                        npc: 700328,
                    },
                    {
                        id: 51104033,
                        content: "白才不是什么小朋友！听好了，你面前的可是将来要征服世界的光之魔王大人！",
                        npc: 700324,
                    },
                ],
            },
            {
                id: 20030405,
                dialogues: [
                    {
                        id: 51104070,
                        content: "是你们……出手相助，感激不尽。",
                        npc: 700325,
                    },
                    {
                        id: 51104071,
                        content: "老爷子！怎么回事，怎么让玄色狴犴缠上了，伤着没有？",
                        npc: 700328,
                    },
                    {
                        id: 51104072,
                        content: "我硬朗的很，能有什么事？倒是这两个娃娃吓得不轻，幸亏我就在附近，勉强护着他们。要是再晚一点……",
                        npc: 700333,
                    },
                    {
                        id: 51104073,
                        content: "你们两个小子，不快点回家在这荒郊野岭的乱逛干什么？",
                        npc: 700328,
                    },
                    {
                        id: 51104074,
                        content: "你认识这两个小娃娃？",
                        npc: 700333,
                    },
                    {
                        id: 51104075,
                        content: "码头上刚见过面，这小兄弟俩猜谜赢了咱们家的桂花糕回去。",
                        npc: 700328,
                    },
                    {
                        id: 51104076,
                        content: "对不起。是我不想晚归挨骂，才带着小武走这条近路……",
                        npc: 700326,
                    },
                    {
                        id: 51104077,
                        content: "哥……你不用道歉，怪我贪玩，误了回家的时辰。",
                        npc: 700327,
                    },
                    {
                        id: 51104078,
                        content: "好了，有事回去再说。浣儿，你先把这两个娃娃送回家去。",
                        npc: 700333,
                    },
                    {
                        id: 51104079,
                        content: "好，您也早点回去，回头和赵叔报个平安。多谢几位英雄出手，我先告辞了。",
                        npc: 700328,
                    },
                    {
                        id: 51104080,
                        content: "谢过应天尉，还有这两位异国的英雄了。若不是三位出手搭救，我这把老骨头怕是保不下那两个娃娃。",
                        npc: 700333,
                    },
                    {
                        id: 51104081,
                        content: "职责所在，不必言谢。",
                        npc: 700325,
                    },
                    {
                        id: 51104082,
                        content: "……恕我妄言，权当是我这匹夫老眼昏花。这位应天尉大人，我可曾在摊前见过你……与你的弟弟？",
                        npc: 700333,
                    },
                    {
                        id: 51104083,
                        content: "…………",
                        npc: 700325,
                    },
                    {
                        id: 51104084,
                        content: "嗯。",
                        npc: 700325,
                    },
                    {
                        id: 51104085,
                        content:
                            "那不会错了，我就说应天尉大人怎么有几分面熟。你是当时那位哥哥，还有个不听话的弟弟。就好像……就好像刚才那两个娃娃一样。",
                        npc: 700333,
                    },
                ],
            },
            {
                id: 20030408,
                dialogues: [
                    {
                        id: 51104094,
                        content: "又劳烦几位了，最近这地界一直都不太平。",
                        npc: 700333,
                    },
                    {
                        id: 51104095,
                        content:
                            "那里曾经有片桂花林。噢，倒也算不上林，只是几棵长在一起的桂花树罢了。但是那桂花开得好，一到时节，香气隔了山头都能闻到。",
                        npc: 700333,
                    },
                    {
                        id: 51104096,
                        content: "桂花树下啊，有个小村子。说是村子，其实也就零零散散几户人家。这边有块不大不小的田，几户人就靠它填饱肚子。",
                        npc: 700333,
                    },
                    {
                        id: 51104097,
                        content:
                            "这村子人家又少，离皓京也偏远，村里的孩子们没什么娱乐活动。我就让他们摘些桂花回来，做成桂花糕给孩子们分分。顺便出几个谜语让他们猜着玩。",
                        npc: 700333,
                    },
                    {
                        id: 51104098,
                        content:
                            "这谜语猜的最好的，当属……当属我的儿子。浣儿他从小机灵，我不求他出人头地，只希望他能平平安安长大，接过我这小本生意……",
                        npc: 700333,
                    },
                    {
                        id: 51104099,
                        content: "难道说……",
                        npc: 100001,
                    },
                    {
                        id: 51104100,
                        content: "呵呵。浣儿从小崇拜应天尉，某次执法时非要去看热闹，结果不小心卷进其中，在坏人手下丢了性命……",
                        npc: 700333,
                    },
                    {
                        id: 51104101,
                        content:
                            "几十年过去了，村里的人离的离散的散，我原本的名字，也没人记得了。后来的人啊，只知道我姓李，做得一手桂花糕，干脆都叫我桂花李。",
                        npc: 700333,
                    },
                    {
                        id: 51104102,
                        content:
                            "我这把老骨头再不想走，孤苦伶仃地也在这过不下去，只能去码头卖卖糕点。收养了个没爹没娘的小娃娃，还把儿子的名字给了他。",
                        npc: 700333,
                    },
                    {
                        id: 51104103,
                        content: "明明是我自己把他当儿子养，可他真叫我爹的时候，我反而心里难受。一到这时候，我就总会回到这里走走。",
                        npc: 700333,
                    },
                    {
                        id: 51104104,
                        content: "从这看下去，总会感觉那个小村子又回来了，它就在这，哪也没去。",
                        npc: 700333,
                    },
                    {
                        id: 51104105,
                        content: "孩子，你还记得，你第一次带着师弟来买桂花糕，我给你出的谜面吗？",
                        npc: 700333,
                    },
                    {
                        id: 51104106,
                        content: "风也愁，雨也愁，木樨归处秋复秋，无人共倚舟。",
                        npc: 700325,
                    },
                    {
                        id: 51104107,
                        content: "记性真不错。当年你们怎么也猜不出来，那是当然。只是我老头子随口的感慨罢了，哪有什么谜底。",
                        npc: 700333,
                    },
                    {
                        id: 51104108,
                        content:
                            "这么多年过去，儿子没了，但我有了徒弟，朋友没了，我又认识了愿意陪我喝酒的老伙伴。可唯独那桂花旁的小村子，终究是回不去了。",
                        npc: 700333,
                    },
                    {
                        id: 51104109,
                        content: "你还年轻，故人尚在，归处仍存，莫要像我老头子一般……",
                        npc: 700333,
                    },
                    {
                        id: 51104110,
                        content: "就到这吧，剩下几步路老朽自己回去也无事。多谢几位英雄出手相助了。",
                        npc: 700333,
                    },
                ],
            },
            {
                id: 20030409,
                dialogues: [
                    {
                        id: 51104111,
                        content: "煜明，没想到在这又见面了。上次在听鸦原一别后，刻舟托我带话给你……",
                        npc: 100001,
                    },
                    {
                        id: 51104112,
                        content: "他的心思我早已知晓，恕难遂其心愿……劳烦你们二位了。",
                        npc: 700325,
                    },
                    {
                        id: 51104113,
                        content: "喂喂，我说，你们明明曾经那么要好，还一起买桂花糕吃。有什么误会真的不能说开嘛？",
                        npc: 700324,
                    },
                    {
                        id: 51104114,
                        content: "……有人欲归家而故园不复。更有些人，故里虽在，却终不得回。",
                        npc: 700325,
                    },
                    {
                        id: 51104115,
                        content: "其中恩怨纠葛并非寥寥数语可以道明。更何况如今我需应天执法，他乃飘零中人，立场之别，已是天渊。",
                        npc: 700325,
                    },
                    {
                        id: 51104116,
                        content: "多谢两位从中调解……怕是让你们失望了。",
                        npc: 700325,
                    },
                    {
                        id: 51104117,
                        content: "白听不明白，好像很深奥的样子……不过既然你想清楚了，那我和小仆从也不多说什么了。",
                        npc: 700324,
                    },
                    {
                        id: 51104118,
                        content: "那我们先走了。你保重好身体，不要太拼命了。",
                        npc: 100001,
                    },
                    {
                        id: 51104119,
                        content: "师兄，山外山的大家都未曾怪你，你何必如此执拗？",
                    },
                    {
                        id: 51104120,
                        content: "罢了，今日我纵是与你大战三百回合也要带你回去！",
                    },
                    {
                        id: 51104121,
                        content: "……此去一别，不复当年，这或许就是天意。",
                        npc: 700325,
                    },
                    {
                        id: 51104122,
                        content: "故人尚在，归处仍存吗……终究只是个愿景罢了。",
                        npc: 700325,
                    },
                ],
            },
        ],
    },
    {
        id: 200305,
        quests: [
            {
                id: 20030500,
                dialogues: [
                    {
                        id: 51105001,
                        content: "灵灵好害怕……呜呜呜……白龙神君在上，能不能让奶奶来保护我……",
                        npc: 700329,
                    },
                    {
                        id: 51105002,
                        content: "只要白龙神君答应灵灵，灵灵就承认，自己的胆子确实比芝麻粒还小。对爹娘说不怕都是吹牛的！",
                        npc: 700329,
                    },
                ],
            },
            {
                id: 20030502,
                dialogues: [
                    {
                        id: 51105038,
                        content: "我好像知道是怎么回事了。真相只有一个——灵灵的奶奶变成了无由生，试图引起灵灵的注意。",
                        npc: 100001,
                    },
                    {
                        id: 51105039,
                        content: "虽然道理很简单，但能看到无由生的人毕竟很少，被误认为闹鬼也就理所当然了。",
                        npc: 100001,
                    },
                    {
                        id: 51105040,
                        content: "问题是……要如何向灵灵解释，这并非闹鬼，而是无由生的执念所致呢？",
                        npc: 100001,
                    },
                ],
            },
            {
                id: 20030503,
                dialogues: [
                    {
                        id: 51105047,
                        content: "{nickname}，又见面了。",
                        npc: 700330,
                    },
                    {
                        id: 51105048,
                        content: "今日前来，有什么急事吗，还是身体不适，需我以枯荣之术医治？",
                        npc: 700330,
                    },
                    {
                        id: 51105049,
                        content: "你将灵灵的事情告知扶疏。",
                    },
                    {
                        id: 51105050,
                        content: "竟是如此……这种牵挂家人的心情，我倒是十分理解。既然需要我的援手，我自然没有二话。",
                        npc: 700330,
                    },
                    {
                        id: 51105051,
                        content: "只是……我现在有些放不下的要紧事，无法前往那女孩身边。",
                        npc: 700330,
                    },
                    {
                        id: 51105052,
                        content: "但我可以在一件物品上施以祝由秘法，最好是和那无由生与女孩都有关联的东西，只要她带在身上就能看见无由生。",
                        npc: 700330,
                    },
                    {
                        id: 51105053,
                        content: "若你有头绪，就请把东西交予我施法，如何？",
                        npc: 700330,
                    },
                    {
                        id: 51105054,
                        content: "当然好，辛苦你了，扶疏。",
                        npc: 100001,
                    },
                ],
            },
            {
                id: 20030505,
                dialogues: [
                    {
                        id: 51105056,
                        content: "一路辛苦，我施法完毕后即刻给你。",
                        npc: 700330,
                    },
                    {
                        id: 51105057,
                        content: "一炷香后。",
                    },
                    {
                        id: 51105058,
                        content: "好了，这个法子只能维持半小时，但十分安全，不用担心。",
                        npc: 700330,
                    },
                    {
                        id: 51105059,
                        content: "麻烦你了。",
                        npc: 100001,
                    },
                    {
                        id: 51105060,
                        content: "那祖孙俩的思亲之心，想必一定十分急迫，快去吧。",
                        npc: 700330,
                    },
                    {
                        id: 51105055,
                        content: "这些应该够了，回去找扶疏吧。",
                        npc: 100001,
                    },
                ],
            },
            {
                id: 20030506,
                dialogues: [
                    {
                        id: 51105061,
                        content: "其实，你家并没有闹鬼，大概是无由生执念未消，所以一直留在你身边，不肯离去。",
                        npc: 100001,
                    },
                    {
                        id: 51105062,
                        content: "！",
                        npc: 700329,
                    },
                    {
                        id: 51105063,
                        content: "难道是奶奶！",
                        npc: 700329,
                    },
                    {
                        id: 51105064,
                        content: "灵灵每天都祈祷，希望奶奶能一直留在身边保护灵灵，原来已经实现了吗？",
                        npc: 700329,
                    },
                    {
                        id: 51105065,
                        content: "只是灵灵自己不知道而已……奶奶真好，白龙神君第二好！",
                        npc: 700329,
                    },
                    {
                        id: 51105066,
                        content:
                            "虽然再也看不见奶奶了，但灵灵可以和以前一样，陪着奶奶晒太阳，为奶奶读她看不清的报纸……对了，这次轮到灵灵去给奶奶唱摇篮曲了！",
                        npc: 700329,
                    },
                ],
            },
            {
                id: 20030508,
                dialogues: [
                    {
                        id: 51105107,
                        content: "爷爷快看，这是我给你带的促织娘！",
                        npc: 700329,
                    },
                    {
                        id: 51105108,
                        content: "萍萍，你什么时候回来的？",
                        npc: 700331,
                    },
                    {
                        id: 51105109,
                        content: "我已经回来一阵了！和爷爷待在一块也有好几天了，爷爷记得吗？",
                        npc: 700329,
                    },
                    {
                        id: 51105110,
                        content: "以后呀，爷爷再也不用一个人去捉促织娘了！我会陪着爷爷去采吿苍，去看书，还有一起做很多很多事情……",
                        npc: 700329,
                    },
                    {
                        id: 51105111,
                        content: "我不会再让爷爷一个人孤零零的了！",
                        npc: 700329,
                    },
                    {
                        id: 51105112,
                        content: "哦……哦……萍萍回来了，萍萍回来了。",
                        npc: 700331,
                    },
                    {
                        id: 51105113,
                        content: "爷爷还以为，再也见不到萍萍了，我就知道，萍萍一定会回来看我的。",
                        npc: 700331,
                    },
                    {
                        id: 51105114,
                        content: "萍萍之前不在这里，一定是没有找到回家的路……",
                        npc: 700331,
                    },
                    {
                        id: 51105115,
                        content: "是呀，前几天只是和爷爷捉迷藏！现在爷爷找到我了，我当然要理爷爷，以后我会在这里住很久很久……",
                        npc: 700329,
                    },
                    {
                        id: 51105116,
                        content: "爷爷可以一直看见我！",
                        npc: 700329,
                    },
                    {
                        id: 51105117,
                        content: "是嘛，真好啊……真好啊……我等到了……",
                        npc: 700331,
                    },
                    {
                        id: 51105118,
                        content: "谢谢你……谢谢你们……",
                        npc: 700331,
                    },
                ],
            },
        ],
    },
    {
        id: 200306,
        quests: [
            {
                id: 20030600,
                dialogues: [
                    {
                        id: 51103001,
                        content: "（行至附近，你突然感觉怀中的牵机方枢震动了起来。）",
                    },
                    {
                        id: 51103002,
                        content: "小仆从，什么声音？是什么东西在震？！",
                        npc: 200002,
                    },
                ],
            },
            {
                id: 20030601,
                dialogues: [
                    {
                        id: 51103013,
                        content: "公尚师傅，你怎么在这？",
                        npc: 100001,
                    },
                    {
                        id: 51103014,
                        content: "大惊小怪的干什么？",
                        npc: 700323,
                    },
                    {
                        id: 51103015,
                        content:
                            "我腿脚不好，懒得走动。察觉你们到了附近，便用牵机方枢指引你们过来。如何？这只是它千般妙用中的一种，要论其中更多门道……",
                        npc: 700323,
                    },
                    {
                        id: 51103016,
                        content: "还以为有什么大宝贝，原来是你……没劲。",
                        npc: 200002,
                    },
                    {
                        id: 51103017,
                        content: "叫我们过来，就是为了说这些吗？",
                        npc: 100001,
                    },
                    {
                        id: 51103018,
                        content: "唉，连机关的使用说明都不愿意听完。现在的年轻人，沉不下心来研究学问，着实浮躁啊。",
                        npc: 700323,
                    },
                    {
                        id: 51103019,
                        content: "我们小仆从日理万机，你再不说正题，我们可就要走了。",
                        npc: 200002,
                    },
                    {
                        id: 51103020,
                        content: "哎哎，可别走——",
                        npc: 700323,
                    },
                    {
                        id: 51103021,
                        content: "你二位怎么说也是机枢派荣誉学徒了。既然与我机枢派有缘，那我这引路人可得担起责任，让你们一品机枢之乐。",
                        npc: 700323,
                    },
                    {
                        id: 51103022,
                        content: "我在这里布置了数处机枢机关，皆为匠心打造，各有精妙设计。怎么样，是不是心动了，想赶紧体验一把？",
                        npc: 700323,
                    },
                ],
            },
            {
                id: 20030602,
                dialogues: [
                    {
                        id: 51103030,
                        content: "这个机枢考验的是你的记忆力，记住那些金色组件的位置，然后用牵机方枢把它们拉出来就行，也不难对吧。",
                        npc: 700323,
                    },
                    {
                        id: 51103031,
                        content: "干得好，不愧是我授予了机枢派名誉学徒的人。拿上你应得的奖励吧。",
                        npc: 700323,
                    },
                    {
                        id: 51103032,
                        content: "这种机枢会稍微复杂一点，你可得看仔细了。",
                        npc: 700323,
                    },
                    {
                        id: 51103033,
                        content: "这机枢门的位置会根据牵引的方向不同而产生变化，所以你得把它停在合适的位置，然后钻进去拿奖励，明白了吧？",
                        npc: 700323,
                    },
                    {
                        id: 51103028,
                        content: "我们现在玩的这个很简单，找到附近的机枢球，用你手里的牵机方枢把它们引到这个坑里就行，试试看。",
                        npc: 700323,
                    },
                    {
                        id: 51103029,
                        content: "不错，一点就通。",
                        npc: 700323,
                    },
                    {
                        id: 51103030,
                        content: "这个机枢考验的是你的记忆力，记住那些金色组件的位置，然后用牵机方枢把它们拉出来就行，也不难对吧。",
                        npc: 700323,
                    },
                    {
                        id: 51103031,
                        content: "干得好，不愧是我授予了机枢派名誉学徒的人。拿上你应得的奖励吧。",
                        npc: 700323,
                    },
                ],
            },
            {
                id: 20030603,
                dialogues: [
                    {
                        id: 51103032,
                        content: "这种机枢会稍微复杂一点，你可得看仔细了。",
                        npc: 700323,
                    },
                    {
                        id: 51103033,
                        content: "这机枢门的位置会根据牵引的方向不同而产生变化，所以你得把它停在合适的位置，然后钻进去拿奖励，明白了吧？",
                        npc: 700323,
                    },
                    {
                        id: 51103034,
                        content: "感觉如何？",
                        npc: 700323,
                    },
                ],
            },
        ],
    },
    {
        id: 200307,
        quests: [
            {
                id: 20030700,
                dialogues: [
                    {
                        id: 51125000,
                        content: "什么！妙趣那家伙今天也来不了！水土不服这都几天了啊！唉……那烟津渡的几场戏可怎么拍啊……",
                        npc: 700365,
                    },
                ],
            },
            {
                id: 20030701,
                dialogues: [
                    {
                        id: 51125025,
                        content: "可恶……没有力气！",
                        npc: 100001,
                    },
                    {
                        id: 51125026,
                        content: "兄弟们，上啊！",
                    },
                    {
                        id: 51125028,
                        content: "宵小退散！",
                        npc: 100001,
                    },
                    {
                        id: 51125029,
                        content: "这厮好生厉害，中了缚仙索还不落下风！兄弟们快撤！",
                    },
                    {
                        id: 51125030,
                        content: "哪里逃？！",
                        npc: 100001,
                    },
                    {
                        id: 51125031,
                        content: "还没结束呢……吃我正义的毒针！",
                        npc: 700366,
                    },
                    {
                        id: 51125032,
                        content: "（等下，台词里有“正义的毒针”吗？）",
                        npc: 100001,
                    },
                    {
                        id: 51125006,
                        content:
                            "甚好甚好。自我介绍一下，我们正在拍摄的照影叫《应天尉大战飘零人3：最后一战》，今天就得把烟津渡的戏全部拍完。",
                        npc: 700365,
                    },
                    {
                        id: 51125007,
                        content:
                            "但我们的主演这几天连床都下不来，更别提拍摄了。所以你来我们这客串一下应天尉吧。这个应天尉之前也没登过场，换个新人再合适不过。",
                        npc: 700365,
                    },
                    {
                        id: 51125008,
                        content: "可是我不会拍戏。",
                        npc: 100001,
                    },
                    {
                        id: 51125009,
                        content: "没事没事，这场戏简单得很，就是咱们华胥最常见的正义应天尉打败邪恶飘零人的故事。",
                        npc: 700365,
                    },
                    {
                        id: 51125010,
                        content: "文戏不长，你也不用背太多台词。主要体现的是那种正派的气质，基本往那一站感觉对了，就没问题。",
                        npc: 700365,
                    },
                    {
                        id: 51125011,
                        content: "横生！我们的临时主角找到了，赶紧过来对一下剧本，半个时辰以后开拍。",
                        npc: 700365,
                    },
                    {
                        id: 51125012,
                        content: "（远处一位衣着简朴的男人听罢，拿起手边厚厚的本子，嘴里一边咕哝着什么一边跑了过来。）",
                    },
                    {
                        id: 51125013,
                        content: "啧，你好，我叫横生，没有妙趣，也不是无由生。给，这是你的台本。",
                        npc: 700366,
                    },
                    {
                        id: 51125014,
                        content: "（你接过横生递来的台本。乍看下来确实没什么演出难度。只要<H>不出什么意外</>的话……）",
                    },
                    {
                        id: 51125015,
                        content: "一小时后……",
                    },
                    {
                        id: 51125016,
                        content: "我乃应天尉，上承天命，下斩邪祟。尔等飘零人，还不速速伏法！",
                        npc: 100001,
                    },
                    {
                        id: 51125017,
                        content: "哈哈哈哈……应天尉大人，你英明一世，糊涂一时，连中计了都浑然不知。你可识得此物？",
                        npc: 700366,
                    },
                    {
                        id: 51125018,
                        content: "这是……缚仙索……尔等竟用此阴毒计俩！",
                        npc: 100001,
                    },
                    {
                        id: 51125019,
                        content: "哼，有了此物，管你是狴犴还是应天尉，便是那高高在上的白龙神君，我也杀给你看！",
                        npc: 700366,
                    },
                    {
                        id: 51125020,
                        content: "今日我即使战死在此，也不容尔等宵小对神君放肆！",
                        npc: 100001,
                    },
                    {
                        id: 51125021,
                        content: "嘻嘻，看是你应天尉的命硬，还是我飘零人的刀子硬！弟兄们——",
                        npc: 700366,
                    },
                    {
                        id: 51125022,
                        content: "来嘞！",
                    },
                    {
                        id: 51125023,
                        content: "好，按照我们之前说的，接下来是今天的第一场打戏。三、二、一，开始——",
                        npc: 700365,
                    },
                ],
            },
            {
                id: 20030702,
                dialogues: [
                    {
                        id: 51125056,
                        content: "停停停！",
                        npc: 700365,
                    },
                    {
                        id: 51125057,
                        content: "横生，我是看出来了，以前有妙趣压着你，你再怎么抢戏都抢不过他，现在人家不在，你就彻底放飞自我了是吧。",
                        npc: 700365,
                    },
                    {
                        id: 51125058,
                        content: "这不是导演你教我们的吗，什么来着——优秀的演员要学会给自己的角色增加高光！",
                        npc: 700366,
                    },
                    {
                        id: 51125059,
                        content: "嘶……好像还真是我说的。",
                        npc: 700365,
                    },
                    {
                        id: 51125060,
                        content: "是吧是吧。",
                        npc: 700366,
                    },
                    {
                        id: 51125061,
                        content: "不对，再怎么说你演的也只是一个反派，后面要被正派应天尉大人一剑砍死的！你一个反派加什么高光！",
                        npc: 700365,
                    },
                    {
                        id: 51125062,
                        content:
                            "反派反派，我跟着导演你排了那么多年戏，你老让我演反派！就连妙趣请假了，还是不让我演那应天尉过过瘾，宁愿找个陌生人。",
                        npc: 700366,
                    },
                    {
                        id: 51125063,
                        content: "你看你那油里油气的样子，我说应天尉长这样，有人信吗？",
                        npc: 700365,
                    },
                    {
                        id: 51125064,
                        content:
                            "怎么就不行？你也说过，优秀的演员应该有“整容式演技”。真让我穿上应天尉的行头，我保证演得不比妙趣差！说到底，你还是不信任我的演技。",
                        npc: 700366,
                    },
                    {
                        id: 51125065,
                        content: "就这样吧，今天小爷我不演了！走了走了！",
                        npc: 700366,
                    },
                    {
                        id: 51125066,
                        content: "喂，喂，怎么就生气了！冷静一点！今天可是我们的最后期限啊！",
                        npc: 700365,
                    },
                    {
                        id: 51125067,
                        content: "…………{性别：兄弟|姑娘}你怎么看，现在这样拍下去确实不太行，要不，你俩换一下试试？",
                        npc: 700365,
                    },
                    {
                        id: 51125077,
                        content: "演了十几年反派，今天终于轮到我当正派了，哈哈哈哈哈哈！",
                        npc: 700379,
                    },
                    {
                        id: 51125078,
                        content: "嘿你看，我现在是应天尉哦，帅不帅？唰——飒——咻咻咻——啊！",
                        npc: 700379,
                    },
                    {
                        id: 51125079,
                        content: "导演，你看我说的吧，是不是活生生一名应天尉了！",
                        npc: 700379,
                    },
                    {
                        id: 51125080,
                        content: "这真的能行吗……算了，说不定入戏以后就不是这样了呢……来来来，都动起来，开拍开拍！",
                        npc: 700365,
                    },
                    {
                        id: 51125034,
                        content: "哼哼，应天尉大人，你再英明神武，也敌不过这背后的毒针吧！",
                        npc: 700366,
                    },
                    {
                        id: 51125035,
                        content: "你……你家族世代——",
                        npc: 100001,
                    },
                    {
                        id: 51125036,
                        content: "那又如何！",
                        npc: 700366,
                    },
                    {
                        id: 51125037,
                        content: "等等，我台词还没说完呢……",
                        npc: 100001,
                    },
                    {
                        id: 51125038,
                        content: "哦！嘿嘿，不好意思，不小心抢词了，重来，重来。",
                        npc: 700366,
                    },
                    {
                        id: 51125039,
                        content: "你……你家族世代为悬衡派香官，满门忠良，怎就出——",
                        npc: 100001,
                    },
                    {
                        id: 51125040,
                        content: "那又如何！",
                        npc: 700366,
                    },
                    {
                        id: 51125041,
                        content: "我台词还没说完呢！",
                        npc: 100001,
                    },
                    {
                        id: 51125042,
                        content: "哎呦你看我这整的，对不住对不住，演得太投入了。重新来重新来。",
                        npc: 700366,
                    },
                    {
                        id: 51125043,
                        content: "在我这句台词“你家族世代为悬衡派香官，满门忠良，怎就出了你这败类”说完之前，不许说台词，记住了么？",
                        npc: 100001,
                    },
                    {
                        id: 51125044,
                        content: "记住了记住了！这次一定不忘！",
                        npc: 700366,
                    },
                    {
                        id: 51125082,
                        content: "可恶……没有力气！",
                        npc: 700379,
                    },
                    {
                        id: 51125083,
                        content: "兄弟们，上啊！",
                    },
                    {
                        id: 51125091,
                        content: "等等，这不在剧本里吧。",
                        npc: 100001,
                    },
                    {
                        id: 51125092,
                        content: "咿嘻嘻嘻嘻，你这小毒针算什么啊。我手上这把，可是沾满了剧毒的大斧哦~",
                        npc: 700379,
                    },
                    {
                        id: 51125093,
                        content: "（怎么又在加戏！）",
                        npc: 100001,
                    },
                    {
                        id: 51125085,
                        content: "哼——宵小！嗬——退散！",
                        npc: 700379,
                    },
                    {
                        id: 51125086,
                        content: "这厮好生厉害，中了缚仙索还不落下风！兄弟们快撤！",
                    },
                    {
                        id: 51125087,
                        content: "呔！哪里逃！",
                        npc: 700379,
                    },
                    {
                        id: 51125088,
                        content: "看针！",
                        npc: 100001,
                    },
                    {
                        id: 51125089,
                        content: "哼！区区毒针，我避它锋芒！",
                        npc: 700379,
                    },
                ],
            },
            {
                id: 20030703,
                dialogues: [
                    {
                        id: 51125095,
                        content: "应天尉大人，你再英明神武，也敌不过这背后的毒针吧！",
                        npc: 100001,
                    },
                    {
                        id: 51125096,
                        content: "……………………",
                        npc: 700379,
                    },
                    {
                        id: 51125097,
                        content: "说台词啊！",
                        npc: 100001,
                    },
                    {
                        id: 51125098,
                        content: "什么词来着？",
                        npc: 700379,
                    },
                    {
                        id: 51125099,
                        content: "“你家族世代为悬衡派香官，满门忠良，怎就出了你这败类！”",
                        npc: 100001,
                    },
                    {
                        id: 51125100,
                        content:
                            "嘿，骂谁败类呢？怎么就败类了呢？你想想，我们在悬衡派干的那都是什么活啊，报酬没给多少，一天到晚烧个破香熏得要死，假期也没几天。",
                        npc: 700379,
                    },
                    {
                        id: 51125101,
                        content: "还整天受大风九章的条条框框拘束，连踹条路边的狗都不行，万一一不小心踹到了主人，还得担心被当成行凶。",
                        npc: 700379,
                    },
                    {
                        id: 51125102,
                        content: "等一下……",
                        npc: 100001,
                    },
                    {
                        id: 51125103,
                        content: "事儿办好了都是白龙神君英明神武，办砸了都是我们办事不力！还不如当个飘零人，逍遥自在！",
                        npc: 700379,
                    },
                    {
                        id: 51125104,
                        content: "嘻嘻，看是你应天尉的命硬，还是我飘零人的刀子硬！吃我正义的毒针！",
                        npc: 700379,
                    },
                    {
                        id: 51125106,
                        content: "精彩，一气呵成行云流水！果然横生你就是万里挑一的天选反派！",
                        npc: 700365,
                    },
                    {
                        id: 51125107,
                        content: "不拍了不拍了，收工！烟津渡这几场最后就靠我的导演剪辑版来救一救吧。",
                        npc: 700365,
                    },
                    {
                        id: 51125108,
                        content: "{性别：兄弟|姑娘}，这是你今天拍戏的报酬，拿好了。",
                        npc: 700365,
                    },
                    {
                        id: 51125109,
                        content: "（这一场荒唐的闹剧总算是落下了帷幕。横生如愿以偿地留下了他的高光时刻……或许。）",
                    },
                ],
            },
        ],
    },
    {
        id: 200308,
        quests: [
            {
                id: 20030800,
                dialogues: [
                    {
                        id: 51151013,
                        content: "刚进那仓库没走几步路，我寻思那货箱怎么如此眼熟，就顺着墙壁摸着走，结果你猜怎么着？",
                        npc: 700372,
                    },
                    {
                        id: 51151014,
                        content: "有话快说，一天到晚尽卖你那关子。",
                        npc: 700373,
                    },
                    {
                        id: 51151015,
                        content: "咱们里面就你进去过百年春那闹鬼的仓库，别吊大伙的胃口啦。",
                        npc: 700374,
                    },
                    {
                        id: 51151016,
                        content: "你们还是太年轻，沉不住气，那我就给你们说明白咯——我当时就顺着墙壁，摸着货箱，一步一步地走。",
                        npc: 700372,
                    },
                    {
                        id: 51151017,
                        content:
                            "我手上不是拿着蜡烛嘛，我就觉得……诶？这蜡烛怎么摇摆不定的？这屋子里明明也没风呀，结果，就在我一个晃神之间——！",
                        npc: 700372,
                    },
                    {
                        id: 51151018,
                        content: "哇啊啊！",
                        npc: 700374,
                    },
                    {
                        id: 51151019,
                        content: "笨蛋，叫什么？本来不吓人，你这一嗓子给我吓得够呛！继续说！",
                        npc: 700373,
                    },
                    {
                        id: 51151020,
                        content: "蜡烛，灭啦~~~",
                        npc: 700372,
                    },
                    {
                        id: 51151021,
                        content: "呜啊啊啊啊啊！",
                        npc: 700374,
                    },
                    {
                        id: 51151022,
                        content: "呜啊啊啊啊啊！",
                        npc: 700373,
                    },
                    {
                        id: 51151023,
                        content: "你这不是也被吓到了吗？",
                        npc: 700374,
                    },
                    {
                        id: 51151024,
                        content: "我这是被你吓到的！后来呢？后来发生什么了？",
                        npc: 700373,
                    },
                    {
                        id: 51151025,
                        content: "后面……我没了蜡烛看不见路，所以就顺着来路退出去咯。说了也奇怪，回程的时候顺风顺水，一点问题也没有。",
                        npc: 700372,
                    },
                    {
                        id: 51151026,
                        content: "看来这闹鬼的地方是有些玄乎……你身上不会沾了什么脏东西吧，这几天你可得好好去白龙神君那拜拜。",
                        npc: 700373,
                    },
                    {
                        id: 51151027,
                        content: "太可怕了，我每天回家的时候还要路过那间仓库呢，要是我也被那些家伙盯上……呜啊，好可怕！",
                        npc: 700374,
                    },
                    {
                        id: 51151028,
                        content: "闹鬼？华胥的幽灵不就是无由生嘛，所以说……是有无由生在捣乱？",
                        npc: 200002,
                    },
                    {
                        id: 51151029,
                        content: "管他是闹鬼还是闹事，天岚先生既然把仓库托付给我们，就是相信我们无论发生什么都能把事摆平！",
                        npc: 700373,
                    },
                    {
                        id: 51151030,
                        content: "兄弟们，话不多说，咱三今晚一起，把这仓库里的牛鬼蛇神全部赶走！成不成？",
                        npc: 700373,
                    },
                    {
                        id: 51151031,
                        content: "……",
                        npc: 700372,
                    },
                    {
                        id: 51151032,
                        content: "……",
                        npc: 700374,
                    },
                    {
                        id: 51151033,
                        content: "怎么不说话？哑巴了？",
                        npc: 700373,
                    },
                    {
                        id: 51151001,
                        content: "是说百年春角落那间仓库吗？那里不是早就租给天岚先生做供货仓库了吗？为何现在过来提起？",
                        npc: 700370,
                    },
                    {
                        id: 51151002,
                        content: "天岚先生自从上次跟船出海后迟迟未归，但他之前收购的一批香料都放在仓库里，已经放了好几个月。",
                        npc: 700371,
                    },
                    {
                        id: 51151003,
                        content: "你这话说的我都有些迷糊了。放着便放着呗，那间仓库的租金一直续到明年呢……",
                        npc: 700370,
                    },
                    {
                        id: 51151004,
                        content: "不是啊，望春姐，是最近百年春都在说，那仓库里闹鬼！",
                        npc: 700371,
                    },
                    {
                        id: 51151005,
                        content: "什……什么？！",
                        npc: 700370,
                    },
                    {
                        id: 51151006,
                        content: "是这样，之前有一批点货人想进去检查库存，结果刚进去就晕头转脑的，人没看到货就绕出门了。",
                        npc: 700371,
                    },
                    {
                        id: 51151007,
                        content: "后来有人不信邪，去了好些个胆子大的，都被这样恭恭敬敬“请”了出来。",
                        npc: 700371,
                    },
                    {
                        id: 51151008,
                        content: "如此说来，虽然未出现伤人事件，但也确实是个麻烦事，我知晓了，抽空我会派人去看看的。",
                        npc: 700370,
                    },
                    {
                        id: 51151047,
                        content: "之前咱们听了望春他们聊过后，我就去跟锦鲤皎皎打听了一下，如果她的消息没有出错……闹鬼的仓库就是这里了！",
                        npc: 200002,
                    },
                    {
                        id: 51151048,
                        content: "既然是百年春烦恼的事情，就交给我们来帮忙解决吧！狩月人的售后服务，包老板满意！",
                        npc: 200002,
                    },
                    {
                        id: 51151049,
                        content: "我们白天路过的房子是这间吗？",
                        npc: 100001,
                    },
                    {
                        id: 51151050,
                        content: "唔……门口我做了石头标记……嗯嗯！就是这间！",
                        npc: 200002,
                    },
                    {
                        id: 51151051,
                        content: "那就进去一探究竟吧。",
                        npc: 100001,
                    },
                    {
                        id: 51151052,
                        content: "出发出发！",
                        npc: 200002,
                    },
                    {
                        id: 51151009,
                        content: "小仆从，你有没有觉得这间房子有些诡异……",
                        npc: 200002,
                    },
                    {
                        id: 51151010,
                        content: "没有，是你想多了吧。",
                        npc: 100001,
                    },
                    {
                        id: 51151011,
                        content: "是吗？可我总觉得这里的温度要比百年春别的地方冷一些，还能听到……一些奇怪的声音……",
                        npc: 200002,
                    },
                    {
                        id: 51151012,
                        content: "如果你好奇的话，白天人来人往不太方便，我们晚上再来看看吧。",
                        npc: 100001,
                    },
                ],
            },
            {
                id: 20030801,
                dialogues: [
                    {
                        id: 51151009,
                        content: "小仆从，你有没有觉得这间房子有些诡异……",
                        npc: 200002,
                    },
                    {
                        id: 51151010,
                        content: "没有，是你想多了吧。",
                        npc: 100001,
                    },
                    {
                        id: 51151011,
                        content: "是吗？可我总觉得这里的温度要比百年春别的地方冷一些，还能听到……一些奇怪的声音……",
                        npc: 200002,
                    },
                    {
                        id: 51151012,
                        content: "如果你好奇的话，白天人来人往不太方便，我们晚上再来看看吧。",
                        npc: 100001,
                    },
                    {
                        id: 51151053,
                        content: "来了，接头暗号是？",
                        npc: 700373,
                    },
                    {
                        id: 51151054,
                        content: "接头暗号？",
                        npc: 100001,
                    },
                    {
                        id: 51151055,
                        content: "你忘了吗？宫廷月夜酒……",
                        npc: 700373,
                    },
                    {
                        id: 51151056,
                        content: "二百八一壶！",
                        npc: 200002,
                    },
                    {
                        id: 51151057,
                        content: "这就是最有名的接头暗号吗？",
                        npc: 100001,
                    },
                    {
                        id: 51151058,
                        content: "哼哼，小仆从对华胥的了解还是太肤浅啦~不像魔王大人，未卜先知，无所不知！",
                        npc: 200002,
                    },
                    {
                        id: 51151059,
                        content: "是你缠着锦鲤皎皎教你的吧。",
                        npc: 100001,
                    },
                    {
                        id: 51151060,
                        content: "你怎么知道的！",
                        npc: 200002,
                    },
                    {
                        id: 51151061,
                        content:
                            "哈哈。你们来之前，我早就绕着这房子转了两圈，除了檐角又长了些青苔之外，并无其他异样。等你们准备好了，咱们就进去。",
                        npc: 700373,
                    },
                    {
                        id: 51151062,
                        content: "好，我们走吧。",
                        npc: 100001,
                    },
                    {
                        id: 51151063,
                        content: "勇气可嘉，不愧是我看中的人，我这就……咦？",
                        npc: 700373,
                    },
                    {
                        id: 51151064,
                        content: "等等，我好像……没带开门的钥匙……",
                        npc: 700373,
                    },
                    {
                        id: 51151065,
                        content: "你也太粗心大意啦，这下我们该怎么进去？",
                        npc: 200002,
                    },
                    {
                        id: 51151066,
                        content:
                            "（一阵阴风吹来。“吱呀”一声，那本该紧锁的门，不知为何竟大敞开来。乍一望去，宛如一张黑漆漆的饕餮大口，似乎随时会将你们吞入……）",
                    },
                    {
                        id: 51151067,
                        content: "鬼啊！！！闹鬼啦！！！",
                        npc: 700373,
                    },
                    {
                        id: 51151068,
                        content: "（在你们面前，肖阿壮扭头就跑，眨眼间便已经没了踪影……）",
                    },
                    {
                        id: 51151069,
                        content: "不是……他……明明是他撺掇我们过来探险，这还没进去就被吓跑了？他今天在码头那样说话，我还以为他胆子很大呢！",
                        npc: 200002,
                    },
                    {
                        id: 51151070,
                        content: "白，你好好想想。他如果真的胆子很大，又为什么一定要拉上别人和他一起探险呢？",
                        npc: 100001,
                    },
                    {
                        id: 51151071,
                        content: "是哦，这么说好像有些道理。小仆从，还是你观察仔细。那现在要怎么办，我们还进去吗？",
                        npc: 200002,
                    },
                    {
                        id: 51151072,
                        content: "是不是需要展现一下我对华胥的了解了？华胥有句俗语，叫……来都来了。",
                        npc: 100001,
                    },
                    {
                        id: 51151001,
                        content: "是说百年春角落那间仓库吗？那里不是早就租给天岚先生做供货仓库了吗？为何现在过来提起？",
                        npc: 700370,
                    },
                    {
                        id: 51151002,
                        content: "天岚先生自从上次跟船出海后迟迟未归，但他之前收购的一批香料都放在仓库里，已经放了好几个月。",
                        npc: 700371,
                    },
                    {
                        id: 51151003,
                        content: "你这话说的我都有些迷糊了。放着便放着呗，那间仓库的租金一直续到明年呢……",
                        npc: 700370,
                    },
                    {
                        id: 51151004,
                        content: "不是啊，望春姐，是最近百年春都在说，那仓库里闹鬼！",
                        npc: 700371,
                    },
                    {
                        id: 51151005,
                        content: "什……什么？！",
                        npc: 700370,
                    },
                    {
                        id: 51151006,
                        content: "是这样，之前有一批点货人想进去检查库存，结果刚进去就晕头转脑的，人没看到货就绕出门了。",
                        npc: 700371,
                    },
                    {
                        id: 51151007,
                        content: "后来有人不信邪，去了好些个胆子大的，都被这样恭恭敬敬“请”了出来。",
                        npc: 700371,
                    },
                    {
                        id: 51151008,
                        content: "如此说来，虽然未出现伤人事件，但也确实是个麻烦事，我知晓了，抽空我会派人去看看的。",
                        npc: 700370,
                    },
                ],
            },
            {
                id: 20030803,
                dialogues: [
                    {
                        id: 51151123,
                        content: "呼~可算把两位无由生送走了，想不到这些无由生还挺有情有义的嘛……接下来就轮到……",
                        npc: 200002,
                    },
                    {
                        id: 51151124,
                        content: "小仆从，你带妙妙罐罐了吗？试试投喂这只魔灵吧！",
                        npc: 200002,
                    },
                    {
                        id: 51151123,
                        content: "呼~可算把两位无由生送走了，想不到这些无由生还挺有情有义的嘛……接下来就轮到……",
                        npc: 200002,
                    },
                    {
                        id: 51151124,
                        content: "小仆从，你带妙妙罐罐了吗？试试投喂这只魔灵吧！",
                        npc: 200002,
                    },
                ],
            },
        ],
    },
    {
        id: 200309,
        quests: [
            {
                id: 20030903,
                dialogues: [
                    {
                        id: 51160004,
                        content: "是这个刘姓女吗？可这是一个贪玩冻感冒了的小女孩，怎么看也和尾生的妻子不搭边。",
                        npc: 100001,
                    },
                    {
                        id: 51160005,
                        content: "难道是陈姓女？性别和年龄倒是对的上，但怎么看也只是眼睛不舒服的小病诶……",
                        npc: 200002,
                    },
                    {
                        id: 51160006,
                        content: "这是一个中年男人，显然和尾生描述里的妻子对不上号。",
                        npc: 100001,
                    },
                ],
            },
        ],
    },
    {
        id: 200311,
        quests: [
            {
                id: 20031101,
                dialogues: [
                    {
                        id: 51114000,
                        content: "这位{性别：小兄弟|姑娘}，请留步！可否帮个小忙？",
                        npc: 701015,
                    },
                    {
                        id: 51114001,
                        content: "我的孩子吵着想吃梨，但眼下我不便离开，可否请你帮我买两个来？放心，报酬不会少了你的。",
                        npc: 701015,
                    },
                ],
            },
            {
                id: 20031102,
                dialogues: [
                    {
                        id: 51114007,
                        content: "我把梨买回来了。",
                        npc: 100001,
                    },
                    {
                        id: 51114008,
                        content: "谢谢{性别：小兄弟|姑娘}！",
                        npc: 701015,
                    },
                    {
                        id: 51114009,
                        content: "哇，有梨吃了！",
                        npc: 701016,
                    },
                    {
                        id: 51114010,
                        content: "梨……我也想吃……",
                        npc: 701018,
                    },
                    {
                        id: 51114011,
                        content: "你这孩子，怎么能馋别人的东西！",
                        npc: 701017,
                    },
                    {
                        id: 51114012,
                        content: "无妨，恰好这里有两个梨，给孩子们一人一个吧。",
                        npc: 701015,
                    },
                    {
                        id: 51114013,
                        content: "（小杨伸手拿起了较大的那只梨。）",
                    },
                    {
                        id: 51114014,
                        content: "瞧瞧，你这孩子真不懂事，哥哥是客人，你应该把大的让给他。",
                        npc: 701015,
                    },
                    {
                        id: 51114015,
                        content: "哥哥，给你……",
                        npc: 701016,
                    },
                    {
                        id: 51114016,
                        content: "（小杨苦着脸把大梨递给了小张，小张欢天喜地地接了过去。）",
                    },
                    {
                        id: 51114017,
                        content: "不行，这怎么好意思！弟弟年纪小，你快把大的让给弟弟。",
                        npc: 701017,
                    },
                    {
                        id: 51114018,
                        content: "还是给你吧，弟弟……",
                        npc: 701018,
                    },
                    {
                        id: 51114019,
                        content: "（小张把大梨还了回去，他脸上的笑容也随之转移到了小杨脸上。）",
                    },
                    {
                        id: 51114020,
                        content: "张兄不必客气，小张这年纪正是长身体的时候，该多吃点。",
                        npc: 701015,
                    },
                    {
                        id: 51114021,
                        content: "这梨是你们买的，我们白拿来吃已经很惭愧了，怎么能还挑大的呢……",
                        npc: 701017,
                    },
                    {
                        id: 51114022,
                        content: "……",
                    },
                    {
                        id: 51114023,
                        content: "（两个孩子眼巴巴地看向你，似乎很希望你能结束这场推让。）",
                    },
                ],
            },
            {
                id: 20031103,
                dialogues: [
                    {
                        id: 51114005,
                        content: "你按照男人的交代，去附近的水果铺子买了两只梨。",
                    },
                    {
                        id: 51114006,
                        content: "只是当你回到原地的时候，这里的家长和小孩不知何时如同被复制一般变成了两组。",
                    },
                ],
            },
        ],
    },
    {
        id: 200312,
        quests: [
            {
                id: 20031202,
                dialogues: [
                    {
                        id: 51118027,
                        content: "等等！",
                        npc: 100001,
                    },
                    {
                        id: 51118028,
                        content: "哎？！",
                        npc: 701025,
                    },
                    {
                        id: 51118029,
                        content: "你就是朝雨吧！",
                        npc: 100001,
                    },
                    {
                        id: 51118030,
                        content: "（听到这个名字，男子显得很惊讶。他愣了一会儿，然后才开口。）",
                    },
                    {
                        id: 51118031,
                        content: "不……我不是朝雨。",
                        npc: 701025,
                    },
                    {
                        id: 51118032,
                        content: "你为何会知道这个名字？你认识他吗？",
                        npc: 701025,
                    },
                    {
                        id: 51118033,
                        content: "我认识他的妹妹，他妹妹一直在等他出现。",
                        npc: 100001,
                    },
                    {
                        id: 51118034,
                        content: "是吗……原来青青一直坐在门口，是想见哥哥啊。",
                        npc: 701025,
                    },
                    {
                        id: 51118035,
                        content: "但她怕是等不到了。",
                        npc: 701025,
                    },
                    {
                        id: 51118036,
                        content: "为什么？你是谁？",
                        npc: 100001,
                    },
                    {
                        id: 51118037,
                        content:
                            "我是朝雨的旧友。几年前，我们在同一个商队出海远航时，不慎遭遇了海难。朝雨他……为了救不通水性的我，不幸去世了。",
                        npc: 701025,
                    },
                    {
                        id: 51118038,
                        content: "这份救命之恩，我无以为报……但至少不忍看他疼爱的幼妹伤心，所以就想了这个办法。",
                        npc: 701025,
                    },
                    {
                        id: 51118039,
                        content: "在青青成年之前，我会假装成朝雨，每年给她送来礼物和信件。",
                        npc: 701025,
                    },
                    {
                        id: 51118040,
                        content: "竟然是这样……",
                        npc: 100001,
                    },
                    {
                        id: 51118041,
                        content: "是的……所以，还请你对青青保密。",
                        npc: 701025,
                    },
                    {
                        id: 51118042,
                        content: "我明白了。",
                        npc: 100001,
                    },
                ],
            },
            {
                id: 20031203,
                dialogues: [
                    {
                        id: 51118043,
                        content: "（你思考了一会儿，然后敲了敲门。）",
                    },
                    {
                        id: 51118062,
                        content: "（青青打着哈欠走了出来。）",
                    },
                ],
            },
        ],
    },
    {
        id: 200313,
        quests: [
            {
                id: 20031301,
                dialogues: [
                    {
                        id: 51153001,
                        content: "不对味，不对味，这味怎么不对啊？老板，你是不是做了什么手脚。这茶汤与我<H>记忆中的滋味</>分明相差甚远！",
                        npc: 701091,
                    },
                ],
            },
            {
                id: 20031302,
                dialogues: [
                    {
                        id: 51153002,
                        content: "这位客人，究竟是哪里不对，哪里味道不一样，你倒是说出个一二来啊？",
                        npc: 701090,
                    },
                    {
                        id: 51153003,
                        content:
                            "你在这里红口白牙瞎说，这不是在砸我的买卖吗！这位白衣服{性别：小兄弟|姑娘}，我看你在这儿站了一阵子了，不然你来评评理？",
                        npc: 701090,
                    },
                ],
            },
            {
                id: 20031304,
                dialogues: [
                    {
                        id: 51153022,
                        content: "经蒹葭浦至浮星埠，我幼时常走这条路去看船，没想到如今它竟变得如此危险。",
                        npc: 701091,
                    },
                    {
                        id: 51153023,
                        content: "果然时移世易，不可同日而语。",
                        npc: 701091,
                    },
                    {
                        id: 51153024,
                        content: "我们继续前进吧，百年春就在前面了。",
                        npc: 701091,
                    },
                ],
            },
            {
                id: 20031305,
                dialogues: [
                    {
                        id: 51153043,
                        content: "在胡老板热情的招待下，陈白沙一次性喝下了十多杯不同的花茶。",
                        npc: 0,
                    },
                    {
                        id: 51153025,
                        content: "陈老兄，哪阵风把你吹来了。久不见面，这一趟出海还顺利吗？",
                        npc: 701092,
                    },
                    {
                        id: 51153026,
                        content: "你不在的日子里，兄弟可挂心你了。为了我们一同长大的交情，我好茶好酒都给你留着，就等你回来一同品尝。",
                        npc: 701092,
                    },
                    {
                        id: 51153027,
                        content: "来来来二位请坐，请上座！我好好给你讲讲这些日子里发生的事！",
                        npc: 701092,
                    },
                    {
                        id: 51153028,
                        content: "（胡老板滔滔不绝地讲述起了近日的见闻，你和陈白沙只能等待着他回过神来……）",
                        npc: 0,
                    },
                    {
                        id: 51153029,
                        content: "对了老兄，我见到你激动得都忘了，你这趟来是为了什么事？",
                        npc: 701092,
                    },
                    {
                        id: 51153030,
                        content: "我来找一款花茶……",
                        npc: 701091,
                    },
                    {
                        id: 51153031,
                        content: "花茶，那还不容易！伙计们，把最好的端上来！",
                        npc: 701092,
                    },
                    {
                        id: 51153032,
                        content: "（伙计们一溜烟地端上了十多款花茶。）",
                        npc: 0,
                    },
                    {
                        id: 51153033,
                        content: "陈老兄，你先尝尝这款莲花茶。清晨日未出之时将茶叶置入菡萏中经日，如此反复数次，焙干后，香美异常。",
                        npc: 701092,
                    },
                    {
                        id: 51153034,
                        content: "（陈白沙尝了尝这杯莲花茶。）",
                        npc: 0,
                    },
                    {
                        id: 51153035,
                        content: "确实不错，但是……",
                        npc: 701091,
                    },
                    {
                        id: 51153036,
                        content: "陈老兄，你再尝尝这款茉莉花茶。九窨一提，汤色黄绿明净，花香清雅，滋味清甜，花叶交错，犹如碧潭飘雪。",
                        npc: 701092,
                    },
                    {
                        id: 51153037,
                        content: "（陈白沙又尝了尝这杯茉莉花茶。）",
                        npc: 0,
                    },
                    {
                        id: 51153038,
                        content: "多谢招待，只是……",
                        npc: 701091,
                    },
                    {
                        id: 51153039,
                        content: "陈老兄，你再试试这款桂花茶。汤色通透，滋味醇厚，花茶一体，清雅有蜜香。",
                        npc: 701092,
                    },
                    {
                        id: 51153040,
                        content: "（陈白沙只得喝下了这杯桂花茶。）",
                        npc: 0,
                    },
                    {
                        id: 51153041,
                        content: "好茶是好茶，就是……",
                        npc: 701091,
                    },
                    {
                        id: 51153042,
                        content: "不合适，对不对？别急，再尝尝这个！",
                        npc: 701092,
                    },
                    {
                        id: 51153044,
                        content: "不……嗝……不行了……我再也喝不下了……",
                        npc: 701091,
                    },
                    {
                        id: 51153045,
                        content: "怎么样，找到还可入口的没有？",
                        npc: 701092,
                    },
                    {
                        id: 51153046,
                        content: "我……我……嗝……",
                        npc: 701091,
                    },
                    {
                        id: 51153047,
                        content: "我来替他说吧，我们在找二十年前浮星埠茶摊子卖的碎末子。",
                        npc: 100001,
                    },
                    {
                        id: 51153048,
                        content: "碎末子？你们找它做什么，又不是什么好东西。",
                        npc: 701092,
                    },
                    {
                        id: 51153049,
                        content: "确实不过是街上摊子卖的大碗茶。只是这位织星客对此念念不忘，一定要找到他所说的“旧时的滋味”不可。",
                        npc: 100001,
                    },
                    {
                        id: 51153050,
                        content: "陈老兄，这些茶里有哪款让你想起以前的滋味的吗？",
                        npc: 701092,
                    },
                    {
                        id: 51153051,
                        content: "一次性……嗝……喝太多，分……嗝……不出来了。",
                        npc: 701091,
                    },
                    {
                        id: 51153052,
                        content: "唉……老兄，让我来替你想想吧。",
                        npc: 701092,
                    },
                    {
                        id: 51153053,
                        content: "二十年前，我们俩都还是在蒹葭浦的河滩上赤着脚玩泥巴的野孩子。",
                        npc: 701092,
                    },
                    {
                        id: 51153054,
                        content: "没想到二十年过去，一个往西，一个往东，好几年也见不上一面。",
                        npc: 701092,
                    },
                    {
                        id: 51153055,
                        content: "时光飞逝，有什么味道是永久不变的呢……",
                        npc: 701092,
                    },
                    {
                        id: 51153056,
                        content: "我……我知道了！",
                        npc: 701091,
                    },
                    {
                        id: 51153057,
                        content: "（陈白沙迅速地从地上爬了起来，目光炯炯地看着你。）",
                        npc: 0,
                    },
                    {
                        id: 51153058,
                        content: "{nickname}小友……",
                        npc: 701091,
                    },
                ],
            },
            {
                id: 20031306,
                dialogues: [
                    {
                        id: 51153070,
                        content: "（陈白沙大口将茶水灌进了口里，随即累得倒下了。）",
                        npc: 0,
                    },
                    {
                        id: 51153071,
                        content: "是你想找的滋味吗？",
                        npc: 100001,
                    },
                    {
                        id: 51153072,
                        content: "有八分像了，还有两分差在哪里呢……",
                        npc: 701091,
                    },
                    {
                        id: 51153073,
                        content: "我记得……记得……",
                        npc: 701091,
                    },
                    {
                        id: 51153074,
                        content: "你回想起了什么？",
                        npc: 100001,
                    },
                    {
                        id: 51153075,
                        content: "我想起十数年前，蒹葭浦还没犯烛阴之灾的日子。我和伙伴一同在河滩上玩泥沙、磨螺壳的时候。",
                        npc: 701091,
                    },
                    {
                        id: 51153076,
                        content: "我想起那时也是这样的天，白云悠悠从头顶飘过。似乎永无烦恼，永无忧虑。",
                        npc: 701091,
                    },
                    {
                        id: 51153077,
                        content: "是从什么时候开始，我决定当一名织星客的呢……又是从什么时候开始，我们各奔东西，各自万里未归，异乡为客的呢……",
                        npc: 701091,
                    },
                    {
                        id: 51153078,
                        content: "你最早喝到这碗茶，是在什么时候？",
                        npc: 100001,
                    },
                    {
                        id: 51153079,
                        content: "我年幼时，有一次父亲带着我，沿着蒹葭浦走去浮星埠看船。路途遥远，我累极了，也兴奋极了。",
                        npc: 701091,
                    },
                    {
                        id: 51153080,
                        content:
                            "我们在茶摊喝茶，不远处的大海波光粼粼，商船穿梭往来，码头上人声喧哗，还是孩子的我，一下被这场景所深深吸引。",
                        npc: 701091,
                    },
                    {
                        id: 51153081,
                        content: "也许从第一次见到大海起，就注定了我未来会远远地离开这片土地，走到天涯海角去。",
                        npc: 701091,
                    },
                    {
                        id: 51153082,
                        content: "但是再一次见到这片天空，还是会感慨万千啊……",
                        npc: 701091,
                    },
                    {
                        id: 51153083,
                        content: "（陈白沙默然不语，在地上躺了好一会儿，似乎在深思些什么。）",
                        npc: 0,
                    },
                    {
                        id: 51153084,
                        content: "小友，我明白了。",
                        npc: 701091,
                    },
                    {
                        id: 51153085,
                        content: "再也不会有和从前一模一样的茶叶的味道了，就像不会有和从前一样的日子。",
                        npc: 701091,
                    },
                    {
                        id: 51153086,
                        content: "我所怀念的不过是逝去的岁月，和再也回不去的小时候。",
                        npc: 701091,
                    },
                    {
                        id: 51153087,
                        content: "再见了，小友，这些报酬你请收好。",
                        npc: 701091,
                    },
                    {
                        id: 51153088,
                        content: "你要去哪里？",
                        npc: 100001,
                    },
                    {
                        id: 51153089,
                        content: "已经过去的不可再追回，现在的一切尚在手中。",
                        npc: 701091,
                    },
                    {
                        id: 51153090,
                        content: "我已经喝不到二十年前的茶了，但是我现在仍然能和我的父亲一起散步、谈天说地、走去港口看船。",
                        npc: 701091,
                    },
                    {
                        id: 51153091,
                        content: "我要回家了。",
                        npc: 701091,
                    },
                    {
                        id: 51153063,
                        content: "你端着一壶茶来这儿，就是你说的……好主意？",
                        npc: 100001,
                    },
                    {
                        id: 51153064,
                        content: "哈哈，我想明白了。既然想要找那时的味道，自然也要重现当时的情境不是。",
                        npc: 701091,
                    },
                    {
                        id: 51153065,
                        content: "那时我整日在这片河滩上狂奔，兴许等我跑得渴了累了，就能找到当时的味道了。",
                        npc: 701091,
                    },
                    {
                        id: 51153066,
                        content: "小友不妨和我来比试一番。",
                        npc: 701091,
                    },
                    {
                        id: 51153063,
                        content: "你端着一壶茶来这儿，就是你说的……好主意？",
                        npc: 100001,
                    },
                    {
                        id: 51153064,
                        content: "哈哈，我想明白了。既然想要找那时的味道，自然也要重现当时的情境不是。",
                        npc: 701091,
                    },
                    {
                        id: 51153065,
                        content: "那时我整日在这片河滩上狂奔，兴许等我跑得渴了累了，就能找到当时的味道了。",
                        npc: 701091,
                    },
                    {
                        id: 51153066,
                        content: "小友不妨和我来比试一番。",
                        npc: 701091,
                    },
                ],
            },
        ],
    },
    {
        id: 200315,
        quests: [
            {
                id: 20031500,
                dialogues: [
                    {
                        id: 51155101,
                        content: "我们先去跟他接触一下，稳住他，探探口风。要是把他逼急了直接在这种地方引爆“大烟花”，那就危险了。",
                        npc: 100001,
                    },
                    {
                        id: 51155001,
                        content: "小仆从小仆从，你刚刚听到没有！",
                        npc: 200002,
                    },
                    {
                        id: 51155002,
                        content: "听到什么？",
                        npc: 100001,
                    },
                    {
                        id: 51155003,
                        content: "“大烟花”！！",
                        npc: 200002,
                    },
                    {
                        id: 51155004,
                        content: "刚刚黑市那个家伙在用通讯器和同伙聊天，说他们从帝国进了一批“大烟花”的货！那可是“大烟花”啊——",
                        npc: 200002,
                    },
                    {
                        id: 51155005,
                        content:
                            "你记得吧？狩月人委托排行榜上，最危险、最艰辛、最有挑战性的委托之一，就是拆掉神弃者同盟安装的超级危险炸弹“大烟花”！",
                        npc: 200002,
                    },
                    {
                        id: 51155006,
                        content: "要是在这里爆炸了，不知道会炸死多少人！这里的摊子通通都要被炸上天！天啊，这简直就是——烟津渡史上最大危机！",
                        npc: 200002,
                    },
                ],
            },
            {
                id: 20031502,
                dialogues: [
                    {
                        id: 51155201,
                        content: "听说你这里能买到“大烟花”？",
                        npc: 100001,
                    },
                    {
                        id: 51155202,
                        content: "……什么人？谁介绍你来的？",
                        npc: 701093,
                    },
                ],
            },
            {
                id: 20031503,
                dialogues: [
                    {
                        id: 51155301,
                        content: "小仆从，这可怎么办哇！你说我们现在收拾东西回冰湖城还来不来得及……",
                        npc: 200002,
                    },
                    {
                        id: 51155302,
                        content: "看来已经没法通过对话解决了，好在他对我们还没什么防备。",
                        npc: 100001,
                    },
                    {
                        id: 51155303,
                        content: "白，等会你去吸引他的注意力，我绕到后面控制住他。",
                        npc: 100001,
                    },
                    {
                        id: 51155304,
                        content: "唔……好，好，小仆从你要小心啊……",
                        npc: 200002,
                    },
                    {
                        id: 51155305,
                        content: "虽然情况非常非常紧急，但你可千万别把他弄伤了。要是不小心引来了狴犴，我们还是得交代在这里。",
                        npc: 200002,
                    },
                    {
                        id: 51155306,
                        content: "放心，这事我熟，也不是第一次干了。用剑鞘就好。",
                        npc: 100001,
                    },
                    {
                        id: 51155307,
                        content: "喂，商量好了没啊！",
                        npc: 701093,
                    },
                    {
                        id: 51155308,
                        content: "啊哦哦哦哦，来了来了！",
                        npc: 200002,
                    },
                ],
            },
            {
                id: 20031504,
                dialogues: [
                    {
                        id: 51155401,
                        content: "怎么，钱没带够啊？看在虬先生的面子上，我可以再给你们打个折扣。",
                        npc: 701093,
                    },
                    {
                        id: 51155501,
                        content: "好机会！",
                        npc: 100001,
                    },
                    {
                        id: 51155502,
                        content: "几个意思，黑吃黑啊！！兄弟们按住这家伙！",
                        npc: 701093,
                    },
                ],
            },
            {
                id: 20031505,
                dialogues: [
                    {
                        id: 51155601,
                        content: "别，别过来！",
                        npc: 701094,
                    },
                    {
                        id: 51155602,
                        content:
                            "（你收敛力道，成功吓退了几个黑市商人。其中一人一边跑，一边顺手推倒了装着“大烟花”的箱子，想要以此拦住你。）",
                    },
                    {
                        id: 51155603,
                        content: "趴下！",
                        npc: 100001,
                    },
                    {
                        id: 51155604,
                        content: "（危急关头，你一把抓起白滚到一边，白颤抖地抓着你的衣角吱哇乱叫。几秒过后，你听到了身后传来了阵阵轰鸣……）",
                    },
                    {
                        id: 51155605,
                        content: "（但预想之中的爆炸冲击并没有向你们袭来，只有一道绚烂的烟花绽放在了微茫市的上空。）",
                    },
                    {
                        id: 51155606,
                        content: "啊？",
                        npc: 100001,
                    },
                    {
                        id: 51155607,
                        content: "哎呦……为了几箱走私来的破烟花至于这样吗……我不要钱了还不行吗……兄弟们，风紧扯呼……",
                        npc: 701094,
                    },
                    {
                        id: 51155608,
                        content:
                            "（黑市商人们离开了，只留下你和白呆愣在原地。随着微茫市上空绽放起了第一道烟花，烟津渡各处的天空也陆陆续续升起了五颜六色的花火。）",
                    },
                    {
                        id: 51155609,
                        content: "这是……什么情况……",
                        npc: 100001,
                    },
                    {
                        id: 51155610,
                        content: "原来……他说的“大烟花”，真的就只是“大烟花”啊……",
                        npc: 200002,
                    },
                ],
            },
        ],
    },
    {
        id: 400111,
        quests: [
            {
                id: 40011101,
                dialogues: [
                    {
                        id: 51105201,
                        content: "一年一度的银烛狂欢节结束了，一切似乎都回复平静。水仙平原也理应恢复到一如既往的喧嚣气氛。",
                    },
                    {
                        id: 51105202,
                        content: "但事实却并非如此……一连串的意外给本该人人尽兴的狂欢蒙上阴影。",
                    },
                    {
                        id: 51105203,
                        content: "于是，一件略带喧闹的小事在狂欢结束后的某天，悄然发生。",
                    },
                    {
                        id: 51105204,
                        content: "……唉，没什么动力啊，总感觉没玩够。",
                        npc: 700349,
                    },
                    {
                        id: 51105205,
                        content: "银烛狂欢就这么收场，真没意思，我一点灵感都没有了。",
                        npc: 700350,
                    },
                    {
                        id: 51105206,
                        content: "……",
                        npc: 200003,
                    },
                    {
                        id: 51105207,
                        content: "怎么回事，大家都一副无精打采的样子。按照以往来说，卡米拉应该开始让大家别瘫在座位上影响生意了。",
                        npc: 700352,
                    },
                    {
                        id: 51105208,
                        content: "结果就连卡米拉也懒得说话。",
                        npc: 700352,
                    },
                    {
                        id: 51105209,
                        content: "啊！我知道了，一定是银烛狂欢大家玩得太累了，所以需要休息一段时间。",
                        npc: 700352,
                    },
                    {
                        id: 51105210,
                        content: "不是的，并且恰恰相反，是因为今年的银烛狂欢由于剧院发生的意外，没有最后的收尾就匆忙结束了。",
                        npc: 700349,
                    },
                    {
                        id: 51105211,
                        content: "就总觉得……提不起劲啊，狂欢的氛围开始没多久，就戛然而止了。这比一开始没有开始狂欢还要难受。",
                        npc: 700349,
                    },
                    {
                        id: 51105212,
                        content: "原来如此，也不是不能理解，就像很多时候我想要帮助别人，帮到一半才发现事情已经解决了一样，就是会很泄气！",
                        npc: 700352,
                    },
                    {
                        id: 51105213,
                        content: "没错！就好像是最终消失了的梦中灵感、打到一半但是没有打出来的喷嚏……甚至我都想不出第三个合适的比喻来形容。",
                        npc: 700350,
                    },
                    {
                        id: 51105214,
                        content: "总之就是，没有生机！",
                        npc: 700350,
                    },
                    {
                        id: 51105215,
                        content: "听起来有些严重……",
                        npc: 700352,
                    },
                    {
                        id: 51105216,
                        content: "不行，我得想想办法，找人一起来帮帮忙，否则大家变不回之前正常的样子啦。",
                        npc: 700352,
                    },
                    {
                        id: 51105217,
                        content: "该找谁呢……哦！她们，找她们准没错。毕竟她们一直以来都情绪稳定，不会受任何外界影响。",
                        npc: 700352,
                    },
                    {
                        id: 51105218,
                        content: "我只要问问她们是怎样不受外界影响，保持工作热情的，就一定能借助她们的心得，让整个冰湖城重新打起精神来。",
                        npc: 700352,
                    },
                ],
            },
            {
                id: 40011102,
                dialogues: [
                    {
                        id: 51105301,
                        content: "三位前辈，如何让冰湖城焕发生机，就拜托你们了！",
                        npc: 700352,
                    },
                    {
                        id: 51105302,
                        content: "喔，虽然老朽只懂如何锻造，但是看到白这么热情，确实不好推辞啊。",
                        npc: 700353,
                    },
                    {
                        id: 51105303,
                        content: "虽然我一直为大家在休息时提供饮品和补给，但如果所有人一直都在休息的话，那也是不对的。",
                        npc: 700354,
                    },
                    {
                        id: 51105304,
                        content:
                            "嗯嗯，白这份心意很好，冰湖城在我的记录里一直是北方的都市，要是大家都一直提不起劲，我就要把记录变成北方的睡城啦。",
                        npc: 700355,
                    },
                    {
                        id: 51105305,
                        content: "对吧，我也觉得，所以呀，让我们一起来想想办法，让大家都振作起来吧。",
                        npc: 700352,
                    },
                    {
                        id: 51105306,
                        content: "依老朽之见啊，方法很简单——",
                        npc: 700353,
                    },
                    {
                        id: 51105307,
                        content: "没有其他的方法了，那就是——",
                        npc: 700354,
                    },
                    {
                        id: 51105308,
                        content: "是啊，我一下子就想到了——",
                        npc: 700355,
                    },
                    {
                        id: 51105309,
                        content: "是什么呢！",
                        npc: 700352,
                    },
                    {
                        id: 51105310,
                        content: "锻造！\n经商！\n冒险！",
                    },
                    {
                        id: 51105311,
                        content: "这不是完全不一样嘛！！！",
                        npc: 700352,
                    },
                    {
                        id: 51105312,
                        content: "并且与其说是方法，不如说是三位前辈各自擅长的事情！",
                        npc: 700352,
                    },
                    {
                        id: 51105313,
                        content: "哦？这确实是出乎我的意料之外。",
                        npc: 700353,
                    },
                    {
                        id: 51105314,
                        content: "我还以为你们俩和我想的完全一样。",
                        npc: 700355,
                    },
                    {
                        id: 51105315,
                        content: "……嗯，原来你们不来卖东西是因为真的觉得经商不是最重要的，有点失望。",
                        npc: 700354,
                    },
                    {
                        id: 51105316,
                        content: "停，停一下三位前辈。这样吧，既然你们各自都觉得自己在干的事情能够让人振奋精神，那，那我来挨个试一遍好了。",
                        npc: 700352,
                    },
                    {
                        id: 51105317,
                        content: "好，那么就从我这里开始吧，和老朽一起挥动铁锤，一定会打起精神的。",
                        npc: 700353,
                    },
                    {
                        id: 51105318,
                        content: "好，铁匠前辈，我之前没有干过这种活，你教一教我。",
                        npc: 700352,
                    },
                    {
                        id: 51105319,
                        content: "简单的简单的，拿起铁锤，深吸一口气，砸——",
                        npc: 700353,
                    },
                    {
                        id: 51105320,
                        content: "一边砸，一遍想着别人看到你锻造出的东西满意地露出笑容，就会产生动力。",
                        npc: 700353,
                    },
                    {
                        id: 51105321,
                        content: "并且呀，有节奏地敲击铁锤，看着火花迸出，每锤一次都会涌现出成就感。",
                        npc: 700353,
                    },
                    {
                        id: 51105322,
                        content: "嗯……好的，我明白了，总的来说就是，挥舞铁锤会让人感到振奋。",
                        npc: 700352,
                    },
                    {
                        id: 51105323,
                        content: "那么让白来试一试……呜哇，好重……",
                        npc: 700352,
                    },
                    {
                        id: 51105324,
                        content: "白举起铁锤，用力挥舞了起来。",
                    },
                    {
                        id: 51105325,
                        content: "嗯，确实抡起大锤来会让人感觉力量从身体里涌出……",
                        npc: 700352,
                    },
                    {
                        id: 51105326,
                        content: "要不就号召大家一起来打铁锻造吧，一定能感到快乐的！",
                        npc: 700352,
                    },
                    {
                        id: 51105327,
                        content: "随着白挥舞锤子的时间越来越长，她的速度也逐渐变慢……",
                    },
                    {
                        id: 51105328,
                        content: "好累……我挥不动了……",
                        npc: 700352,
                    },
                    {
                        id: 51105329,
                        content: "不行，我累坏了，我必须立刻睡觉……晚安……",
                        npc: 700352,
                    },
                    {
                        id: 51105330,
                        content: "并且我得出一个结论，这种方法不太适合……让大家振奋精神。",
                        npc: 700352,
                    },
                    {
                        id: 51105331,
                        content: "所以啊，这样是不行的，过度地劳动只会让大家变得更加疲惫。",
                        npc: 700354,
                    },
                    {
                        id: 51105332,
                        content: "本来狂欢节就是为了让大家休息才设立的，敲敲打打的声音只适合作为狂欢节的背景音乐。",
                        npc: 700354,
                    },
                    {
                        id: 51105333,
                        content: "是这样吗？哎呀，能做背景音乐也很好啦，那么接下来该你啦。让我们见识见识什么叫做经商能够带来活力。",
                        npc: 700353,
                    },
                    {
                        id: 51105334,
                        content: "哼哼，我看你是一直待在屋内打铁，根本不知道外面发生过什么。",
                        npc: 700354,
                    },
                    {
                        id: 51105335,
                        content: "跟我来吧，顺便把睡着的白给一起抬出去。",
                        npc: 700354,
                    },
                ],
            },
            {
                id: 40011103,
                dialogues: [
                    {
                        id: 51105401,
                        content: "咦？我怎么在广场上啦？难道是因为我挥舞锤子的力气太大，把自己甩飞出去啦？",
                        npc: 700352,
                    },
                    {
                        id: 51105402,
                        content: "那你们没事吧？有没有受伤？",
                        npc: 700352,
                    },
                    {
                        id: 51105403,
                        content: "不是啦，只是刚刚你太用力，累坏了而已。",
                        npc: 700354,
                    },
                    {
                        id: 51105404,
                        content: "原来是这样……不过我刚刚要干什么来着。",
                        npc: 700352,
                    },
                    {
                        id: 51105405,
                        content: "是打算用经商来让冰湖城重新焕发生机哦。",
                        npc: 700354,
                    },
                    {
                        id: 51105406,
                        content: "哦对，想起来了，那么到底要怎么做，侍者前辈，请教教我！",
                        npc: 700352,
                    },
                    {
                        id: 51105407,
                        content: "唔，说起来其实也简单，就是制造商机，制造悬念，制造潮流，只要吊足大家的胃口，就能够唤出大家的热情。",
                        npc: 700354,
                    },
                    {
                        id: 51105408,
                        content: "而一旦想要拥有，想购买的情绪充斥着心胸，那么人们就会为此好好工作。这样就能让人们焕发活力。",
                        npc: 700354,
                    },
                    {
                        id: 51105409,
                        content: "话不多说，比如我这里就有准备好的银烛狂欢终场限定饮品，每购买一杯就能获得一个印章，",
                        npc: 700354,
                    },
                    {
                        id: 51105410,
                        content: "集齐五枚印章后可以获得限定款银色烛台一个，烛台总共有五种颜色款式还有斑斓之黑隐藏款。",
                        npc: 700354,
                    },
                    {
                        id: 51105411,
                        content: "来吧，白，吆喝起来！只要来买的人足够多，那么冰湖城就一定会重新焕发活力的！",
                        npc: 700354,
                    },
                    {
                        id: 51105412,
                        content: "噢！好耶！只要能够让冰湖城重新焕发生机我什么都会做的！",
                        npc: 700352,
                    },
                    {
                        id: 51105413,
                        content: "银烛狂欢终场限定饮品！购入获得限定款银色烛台！还有隐藏款！",
                        npc: 700352,
                    },
                    {
                        id: 51105414,
                        content: "只卖一天，今天卖完等到明年，快来看呀！",
                        npc: 700352,
                    },
                    {
                        id: 51105415,
                        content: "侍者皎皎与白的吆喝在广场上交织，不少人驻足观看，但随即摇摇头离去。",
                    },
                    {
                        id: 51105416,
                        content: "唔……会不会是吆喝的声音不够大……",
                        npc: 700352,
                    },
                    {
                        id: 51105417,
                        content: "不是的……只是听了感觉有一些内心疲惫。",
                        npc: 700360,
                    },
                    {
                        id: 51105418,
                        content: "咦？为什么？我们准备的饮料也很可口，烛台也很精致，为什么会疲惫呢？",
                        npc: 700354,
                    },
                    {
                        id: 51105419,
                        content: "因为我家里已经有七八个烛台啦、还有十几个银烛狂欢纪念牌、二十多个银烛狂欢纪念徽章。",
                        npc: 700360,
                    },
                    {
                        id: 51105420,
                        content: "银烛狂欢期间，城里的商家就和约好了一样，每一家都在推出什么银烛狂欢特制纪念品，偏偏每一家都做得很好。",
                        npc: 700360,
                    },
                    {
                        id: 51105421,
                        content: "大家一不留神，就买了好多……所以现在都是钱包空空，后悔花了很多钱的状态。",
                        npc: 700360,
                    },
                    {
                        id: 51105422,
                        content: "所以在银烛狂欢结束的时候看到你们还在这样叫卖，反而让我感到后悔和痛苦……",
                        npc: 700360,
                    },
                    {
                        id: 51105423,
                        content: "对不起，我……我不是故意的。",
                        npc: 700352,
                    },
                    {
                        id: 51105424,
                        content: "没有责怪你的意思啦，相反，我很感激你们能为了大家重新打起精神来能尝试各种方法。",
                        npc: 700360,
                    },
                    {
                        id: 51105425,
                        content: "请继续加油，我相信你们一定可以的！",
                        npc: 700360,
                    },
                    {
                        id: 51105426,
                        content: "好的！那么探险家前辈，最后的希望，靠你了！",
                        npc: 700352,
                    },
                    {
                        id: 51105427,
                        content: "嗯，确实也该是我出场的时候了。",
                        npc: 700355,
                    },
                    {
                        id: 51105428,
                        content: "那么我的答案是冒险——",
                        npc: 700355,
                    },
                    {
                        id: 51105429,
                        content: "银烛狂欢，大家都在冰湖城内狂欢，那么我有充分的理由认为大家是在城里憋坏了，是城墙让大家的心情压抑。",
                        npc: 700355,
                    },
                    {
                        id: 51105430,
                        content: "所以，如果大家都能去冰湖城外，与自然亲近，呼吸新鲜空气，心情就一定会变好的！",
                        npc: 700355,
                    },
                    {
                        id: 51105431,
                        content: "哦！听起来很有道理。那么，是不是找到泪湖边上风景最好的地方，让大家去那里欣赏风景就可以了！",
                        npc: 700352,
                    },
                    {
                        id: 51105432,
                        content: "不错，白很聪明嘛，已经完全知道我想要做什么了。",
                        npc: 700355,
                    },
                    {
                        id: 51105433,
                        content: "好，那我们出发！",
                        npc: 700352,
                    },
                ],
            },
            {
                id: 40011104,
                dialogues: [
                    {
                        id: 51105501,
                        content: "嗯，就是这里了，视野开阔没有拘束，适合让大家来放松身心。",
                        npc: 700352,
                    },
                    {
                        id: 51105502,
                        content: "没错，每当我来到这里，都觉得内心被治愈了一样，所以我相信其他人也一定能重新打起精神来的。",
                        npc: 700355,
                    },
                    {
                        id: 51105503,
                        content: "救命啊，救命——",
                    },
                    {
                        id: 51105504,
                        content: "好像是有人在呼救，我们过去看看。",
                        npc: 700355,
                    },
                ],
            },
            {
                id: 40011105,
                dialogues: [
                    {
                        id: 51105505,
                        content: "谢谢，谢谢救了我们。",
                        npc: 700356,
                    },
                    {
                        id: 51105506,
                        content: "如果不是你们的话，我们恐怕就回不去冰湖城了……呜呜呜。",
                        npc: 700357,
                    },
                    {
                        id: 51105507,
                        content: "没事了，你们已经安全啦！不过，为什么你们会在这里？",
                        npc: 700352,
                    },
                    {
                        id: 51105508,
                        content: "唉，都怪我。我和妹妹本来一直在雾区生活，爸爸妈妈管得很严，没有让我们出过城。",
                        npc: 700356,
                    },
                    {
                        id: 51105509,
                        content: "所以我们就想着趁着银烛狂欢期间，卫兵们也都放松去参加狂欢了，到城外看一看。",
                        npc: 700356,
                    },
                    {
                        id: 51105510,
                        content: "结果一过了桥就遇见了秽兽，我们为了避免被发现，只能躲着它们，越躲越远……",
                        npc: 700356,
                    },
                    {
                        id: 51105511,
                        content: "最后还是被它们围住了，如果不是你们的话……",
                        npc: 700356,
                    },
                    {
                        id: 51105512,
                        content: "哥哥，是我不好，我不应该闹着要出城，我们回去吧。我再也不要离开冰湖城了……",
                        npc: 700357,
                    },
                    {
                        id: 51105513,
                        content: "是哦，对于大部分人来说，城墙之外的世界还是太危险了……",
                        npc: 700352,
                    },
                    {
                        id: 51105514,
                        content: "是我欠考虑了，对远方的渴望虽然能够唤起热情，但并不适合每一个人。走吧，我们回去。",
                        npc: 700355,
                    },
                    {
                        id: 51105515,
                        content: "（一阵有一些激烈但不那么激烈的打斗声）",
                    },
                ],
            },
            {
                id: 40011106,
                dialogues: [
                    {
                        id: 51105601,
                        content: "所以，连探险家前辈的方法也没有成功……",
                        npc: 700352,
                    },
                    {
                        id: 51105602,
                        content: "到底应该怎么做呢？",
                        npc: 700352,
                    },
                    {
                        id: 51105603,
                        content: "别丧气，至少我们的尝试确实帮助了别人。",
                        npc: 700355,
                    },
                    {
                        id: 51105604,
                        content: "嗯，你说得对，无论如何都不算是白忙一场。",
                        npc: 700352,
                    },
                    {
                        id: 51105605,
                        content: "唉，你们两个都去哪里了？我和你们的父亲都快急疯了。",
                        npc: 700358,
                    },
                    {
                        id: 51105606,
                        content: "我们去了城外，遇到了秽兽，多亏了他们，救了我们。",
                        npc: 700356,
                    },
                    {
                        id: 51105607,
                        content: "城外？！门口的那群卫兵到底在干什么……算了，没事就好，没事就好。",
                        npc: 700358,
                    },
                    {
                        id: 51105608,
                        content: "也谢谢你们二位。",
                        npc: 700358,
                    },
                    {
                        id: 51105609,
                        content: "咦，等等，这不是白嘛？",
                        npc: 700358,
                    },
                    {
                        id: 51105610,
                        content: "嗯？你认识我吗？",
                        npc: 700352,
                    },
                    {
                        id: 51105611,
                        content: "之前不认识，但是这几天听说有一位皎皎之民在努力让冰湖城的居民振奋精神，听他们来看描述就应该是你了。",
                        npc: 700358,
                    },
                    {
                        id: 51105612,
                        content: "哼哼，没错，就是我！",
                        npc: 700352,
                    },
                    {
                        id: 51105613,
                        content: "不过……我也没有找到什么很好的让大家振作起来的办法。唉，这样一来连我都要没什么精神啦。",
                        npc: 700352,
                    },
                    {
                        id: 51105614,
                        content: "那你可就白担心啦，快去盖雷亚剧院吧，我刚刚就听说你的几个朋友在到处找你，但是却不知道你跑到哪里去了。",
                        npc: 700358,
                    },
                    {
                        id: 51105615,
                        content: "嗯？盖雷亚剧院，好的，我这就去！",
                        npc: 700352,
                    },
                ],
            },
            {
                id: 40011107,
                dialogues: [
                    {
                        id: 51105701,
                        content: "只见盖雷亚剧院的舞台上，一个纸质的画板竖立了起来，按轮廓来看，是皎皎的身形。",
                    },
                    {
                        id: 51105702,
                        content: "哟，白，你回来啦。",
                        npc: 700349,
                    },
                    {
                        id: 51105703,
                        content: "那凯旋的身影在灯光的照射下，如同巨人一般伟岸！",
                        npc: 700350,
                    },
                    {
                        id: 51105704,
                        content: "威尔斯大叔，巴克？还有这么多人，你们为什么在这里？",
                        npc: 700352,
                    },
                    {
                        id: 51105705,
                        content: "说来怪不好意思的，一开始听说你想办法让我们振作起来，就只是觉得你是又无聊啦，没事找事。",
                        npc: 700349,
                    },
                    {
                        id: 51105706,
                        content: "结果没想到你真的去尝试了各种方式，虽然听说也没什么好的结果，但我们水仙平原的常客听说了，都有点被打动吧。",
                        npc: 700349,
                    },
                    {
                        id: 51105707,
                        content: "呃，“没什么好的结果”可以不用说的！",
                        npc: 700352,
                    },
                    {
                        id: 51105708,
                        content: "唔，确实不是重点，重点是，我们觉得不能光看你一个人这样东奔西走！",
                        npc: 700349,
                    },
                    {
                        id: 51105709,
                        content: "于是我们觉得得要做点什么，不能让你白忙活。",
                        npc: 700349,
                    },
                    {
                        id: 51105710,
                        content: "然后，思想之间迸发出火花，火花引爆了更多的思绪。",
                        npc: 700350,
                    },
                    {
                        id: 51105711,
                        content:
                            "巴克说的话呢，可能不是那么好懂，意思是我们俩商量了一会儿，没什么好法子，又找到了其他人，最后找到了普奇团长。",
                        npc: 700349,
                    },
                    {
                        id: 51105712,
                        content: "大家对于怎么向你表示感谢都各自有想法，但又都觉得不是最好的。",
                        npc: 700349,
                    },
                    {
                        id: 51105713,
                        content: "于是大家聚在一起想啊想，想地抓耳挠腮，争地面红耳赤。就在这个过程中，突然就感觉热情又重新回来了。",
                        npc: 700349,
                    },
                    {
                        id: 51105714,
                        content: "于是我们意识到了，为了一个明确的目标去行动，可以让所有人重新燃起热情。",
                        npc: 700349,
                    },
                    {
                        id: 51105715,
                        content: "最终呢，我们决定在这里搭建一个皎皎们的舞台，在这里举办一个小的舞会，以宣告银烛狂欢的正式结束。",
                        npc: 700359,
                    },
                    {
                        id: 51105716,
                        content: "更重要的是，向你，以及为了人类奔走的每一位皎皎表示感谢。",
                        npc: 700359,
                    },
                    {
                        id: 51105717,
                        content: "只不过因为准备仓促，这个布景还没有做好，但是我相信会有热心的冰湖城市民伸出援手的！",
                        npc: 700359,
                    },
                    {
                        id: 51105718,
                        content: "咦？为什么是皎皎们……我们其实，也没做什么啦，只是都做了一些平时在做的事情。",
                        npc: 700352,
                    },
                    {
                        id: 51105719,
                        content: "正是因为你们平时一直都在帮助其他人，所以在大家都无精打采的时候，看到皎皎们还是和往常一样。",
                        npc: 700359,
                    },
                    {
                        id: 51105720,
                        content: "和往常一样锻造，冒险，经商，并且又帮助感染了其他人，所以才会让大家想着为你们做点什么吧。",
                        npc: 700359,
                    },
                    {
                        id: 51105721,
                        content: "……即便和平常一样，也能让大家打起精神吗。",
                        npc: 700352,
                    },
                    {
                        id: 51105722,
                        content: "我明白了，哼哼。看来平时本魔王大人和小仆从在冰湖城里跑来跑去，已经积攒了很多人望。",
                        npc: 700352,
                    },
                    {
                        id: 51105723,
                        content: "是，是，你是最受大家畏惧，最受大家尊敬，也最热爱自己子民的魔王大人，只要你一声令下，大家都会充满力量。",
                        npc: 700349,
                    },
                    {
                        id: 51105724,
                        content: "没错，那么我命令你们所有人！听从魔王大人的命令，恢复精神，开始银烛狂欢最后的舞会！",
                        npc: 700352,
                    },
                    {
                        id: 51105725,
                        content: "好！",
                    },
                    {
                        id: 51105726,
                        content: "于是，今年本蒙上一层阴翳的银烛狂欢，在一位自称魔王的皎皎的努力下，成功地重新燃起欢乐氛围。",
                    },
                ],
            },
        ],
    },
]

export const questMap = new Map(questData.map(questList => [questList.id, questList]))

export default questData
