export interface SubRegion {
    id: number
    rid: number
    name: string
    desc: string
    map: string
    pos?: [number, number]
    rc?: RandomCreator[]
    range?: Range
    tp?: TeleportPoint[]
}

export interface TeleportPoint {
    id: number
    pos: [number, number]
    name: string
    icon: string
}

export interface Range {
    center: number[]
    extent: number[]
    anchor?: number[]
}

export interface RandomCreator {
    id: number
    info: RandomInfo[]
    count: number
    pos?: [number, number][]
}

export interface RandomInfo {
    id: number
    w: number
}

export const subRegionData: SubRegion[] = [
    {
        id: 100101,
        rid: 1001,
        name: "秽兽肆虐的村庄",
        desc: "村庄描述",
        map: "Prologue_Village",
        pos: [3500, 500],
        range: {
            center: [6080, -1610],
            extent: [0, 0],
        },
        rc: [
            {
                id: 9010101,
                info: [
                    {
                        id: 4081,
                        w: 133,
                    },
                    {
                        id: 4082,
                        w: 133,
                    },
                    {
                        id: 4083,
                        w: 67,
                    },
                    {
                        id: 4151,
                        w: 322,
                    },
                    {
                        id: 4152,
                        w: 322,
                    },
                    {
                        id: 4153,
                        w: 161,
                    },
                    {
                        id: 4051,
                        w: 752,
                    },
                    {
                        id: 4052,
                        w: 752,
                    },
                    {
                        id: 4053,
                        w: 376,
                    },
                    {
                        id: 4931,
                        w: 3491,
                    },
                    {
                        id: 4933,
                        w: 3491,
                    },
                ],
                count: 2,
                pos: [
                    [11655, -4666],
                    [5121, 6125],
                    [6198, 2151],
                ],
            },
            {
                id: 9010102,
                info: [
                    {
                        id: 4121,
                        w: 333,
                    },
                    {
                        id: 4122,
                        w: 333,
                    },
                    {
                        id: 4123,
                        w: 167,
                    },
                    {
                        id: 4021,
                        w: 778,
                    },
                    {
                        id: 4022,
                        w: 778,
                    },
                    {
                        id: 4023,
                        w: 389,
                    },
                    {
                        id: 4931,
                        w: 7222,
                    },
                ],
                count: 1,
                pos: [
                    [5060, 12162],
                    [-3609, 10535],
                ],
            },
        ],
        tp: [
            {
                id: 1001,
                pos: [370, -1950],
                name: "秽兽肆虐的村庄",
                icon: "T_Gp_Trans03",
            },
            {
                id: 2814,
                pos: [-4222, 11076],
                name: "净界岛钓鱼点",
                icon: "T_Gp_Angling",
            },
            {
                id: 2830,
                pos: [1970, 3670],
                name: "秽兽肆虐的村庄",
                icon: "T_Gp_Camera",
            },
            {
                id: 2876,
                pos: [761, 9252],
                name: "留影地·净界岛",
                icon: "T_Gp_Camera",
            },
        ],
    },
    {
        id: 100102,
        rid: 1001,
        name: "神秘遗迹中层",
        desc: "阳台描述",
        map: "Prologue_Balcony",
        pos: [23500, 4500],
        range: {
            center: [22990, -4460],
            extent: [0, 0],
        },
        rc: [
            {
                id: 9010201,
                info: [
                    {
                        id: 4161,
                        w: 333,
                    },
                    {
                        id: 4162,
                        w: 333,
                    },
                    {
                        id: 4163,
                        w: 167,
                    },
                    {
                        id: 4061,
                        w: 778,
                    },
                    {
                        id: 4062,
                        w: 778,
                    },
                    {
                        id: 4063,
                        w: 389,
                    },
                    {
                        id: 4933,
                        w: 7222,
                    },
                ],
                count: 2,
                pos: [
                    [23230, 6254],
                    [15622, 8782],
                    [26623, 4795],
                ],
            },
            {
                id: 9010202,
                info: [
                    {
                        id: 4121,
                        w: 333,
                    },
                    {
                        id: 4122,
                        w: 333,
                    },
                    {
                        id: 4123,
                        w: 167,
                    },
                    {
                        id: 4021,
                        w: 778,
                    },
                    {
                        id: 4022,
                        w: 778,
                    },
                    {
                        id: 4023,
                        w: 389,
                    },
                    {
                        id: 4931,
                        w: 7222,
                    },
                ],
                count: 1,
                pos: [[26759, -3670]],
            },
        ],
        tp: [
            {
                id: 1002,
                pos: [23530, -985],
                name: "神秘遗迹中层",
                icon: "T_Gp_Trans03",
            },
        ],
    },
    {
        id: 100103,
        rid: 1001,
        name: "神秘遗迹顶层",
        desc: "云海描述",
        map: "Prologue_Clouds",
        pos: [27500, 32000],
        rc: [
            {
                id: 9010301,
                info: [
                    {
                        id: 4081,
                        w: 133,
                    },
                    {
                        id: 4082,
                        w: 133,
                    },
                    {
                        id: 4083,
                        w: 67,
                    },
                    {
                        id: 4161,
                        w: 322,
                    },
                    {
                        id: 4162,
                        w: 322,
                    },
                    {
                        id: 4163,
                        w: 161,
                    },
                    {
                        id: 4061,
                        w: 752,
                    },
                    {
                        id: 4062,
                        w: 752,
                    },
                    {
                        id: 4063,
                        w: 376,
                    },
                    {
                        id: 4911,
                        w: 2327,
                    },
                    {
                        id: 4921,
                        w: 2327,
                    },
                    {
                        id: 4933,
                        w: 2327,
                    },
                ],
                count: 2,
                pos: [
                    [19082, 23631],
                    [28543, 35568],
                    [37121, 21174],
                ],
            },
        ],
        tp: [
            {
                id: 9000,
                pos: [31670, 32317],
                name: "西比尔",
                icon: "T_Gp_Boss",
            },
            {
                id: 1003,
                pos: [22051, 19329],
                name: "神秘遗迹顶层",
                icon: "T_Gp_Trans03",
            },
            {
                id: 2832,
                pos: [-9460, 44930],
                name: "泪湖湖畔",
                icon: "T_Gp_Camera",
            },
        ],
    },
    {
        id: 100104,
        rid: 1001,
        name: "梦中的沙海",
        desc: "虚空描述",
        map: "Prologue_Void",
    },
    {
        id: 101101,
        rid: 1011,
        name: "冰湖城外围",
        desc: "冰湖城外围·东区描述",
        map: "Chapter01_IcelakeCity",
        pos: [-3700, -2530],
        range: {
            center: [-3700, -2530],
            extent: [0, 0],
        },
        rc: [
            {
                id: 9020301,
                info: [
                    {
                        id: 4091,
                        w: 133,
                    },
                    {
                        id: 4092,
                        w: 133,
                    },
                    {
                        id: 4093,
                        w: 67,
                    },
                    {
                        id: 4161,
                        w: 322,
                    },
                    {
                        id: 4162,
                        w: 322,
                    },
                    {
                        id: 4163,
                        w: 161,
                    },
                    {
                        id: 4061,
                        w: 752,
                    },
                    {
                        id: 4062,
                        w: 752,
                    },
                    {
                        id: 4063,
                        w: 376,
                    },
                    {
                        id: 4911,
                        w: 1164,
                    },
                    {
                        id: 4912,
                        w: 1164,
                    },
                    {
                        id: 4913,
                        w: 1164,
                    },
                    {
                        id: 4921,
                        w: 1164,
                    },
                    {
                        id: 4922,
                        w: 1164,
                    },
                    {
                        id: 4923,
                        w: 1164,
                    },
                ],
                count: 2,
                pos: [
                    [-385, 214],
                    [-4509, 4606],
                    [-7776, 8789],
                    [-2890, -6075],
                    [-8053, -7063],
                ],
            },
            {
                id: 9020302,
                info: [
                    {
                        id: 4131,
                        w: 333,
                    },
                    {
                        id: 4132,
                        w: 333,
                    },
                    {
                        id: 4133,
                        w: 167,
                    },
                    {
                        id: 4031,
                        w: 778,
                    },
                    {
                        id: 4032,
                        w: 778,
                    },
                    {
                        id: 4033,
                        w: 389,
                    },
                    {
                        id: 4931,
                        w: 3611,
                    },
                    {
                        id: 4932,
                        w: 3611,
                    },
                ],
                count: 2,
                pos: [
                    [-8039, 9864],
                    [-5963, 3425],
                    [-7491, -12614],
                    [-7501, -10407],
                ],
            },
        ],
        tp: [
            {
                id: 1011,
                pos: [358, -1796],
                name: "冰湖城外围广场",
                icon: "T_Gp_Trans03",
            },
            {
                id: 2501,
                pos: [-2512, -2121],
                name: "集结",
                icon: "T_Gp_Gathering",
            },
            {
                id: 2817,
                pos: [-3172, -5484],
                name: "异乡来客",
                icon: "T_Gp_Zhiliu",
            },
            {
                id: 1012,
                pos: [-3275, 10937],
                name: "修普诺斯之家",
                icon: "T_Gp_Trans03",
            },
            {
                id: 2001,
                pos: [-5221, 6000],
                name: "休憩之所",
                icon: "T_Gp_Homebase",
            },
            {
                id: 2002,
                pos: [-3172, -5484],
                name: "“水仙平原”",
                icon: "T_Gp_Tavern",
            },
            {
                id: 2003,
                pos: [-2360, 13561],
                name: "“修普诺斯之家”",
                icon: "T_Gp_Sanatorium",
            },
            {
                id: 2004,
                pos: [-1768, -12190],
                name: "奥特赛德的家",
                icon: "T_Gp_OutsidersHome",
            },
            {
                id: 2006,
                pos: [-8372, -675],
                name: "冰湖城下水道",
                icon: "T_Gp_Sew",
            },
            {
                id: 2007,
                pos: [100, -7250],
                name: "冰湖城下水道",
                icon: "T_Gp_Sew",
            },
            {
                id: 2009,
                pos: [699, 5940],
                name: "盖雷亚剧院",
                icon: "T_Gp_Thea",
            },
            {
                id: 2011,
                pos: [-8023, -7696],
                name: "牵念之花",
                icon: "T_Gp_Flow",
            },
            {
                id: 2612,
                pos: [-1185, -4530],
                name: "蛋皎的印象商店",
                icon: "T_Gp_Shop",
            },
            {
                id: 2613,
                pos: [44, -2924],
                name: "探险家馈赠",
                icon: "T_Gp_Shop",
            },
            {
                id: 2614,
                pos: [-5184, -621],
                name: "冰湖城渔业协会",
                icon: "T_Gp_Shop",
            },
            {
                id: 2831,
                pos: [-3300, 11840],
                name: "修普诺斯之家",
                icon: "T_Gp_Camera",
            },
            {
                id: 2015,
                pos: [1831, -419],
                name: "站前穹顶",
                icon: "T_Gp_Station",
            },
            {
                id: 2865,
                pos: [-5117, -4284],
                name: "留影地·冰湖城广场",
                icon: "T_Gp_Camera",
            },
        ],
    },
    {
        id: 101103,
        rid: 1011,
        name: "泪湖畔",
        desc: "泪湖畔描述",
        map: "Chapter01_Icelake",
        pos: [-29899, -2645],
        range: {
            center: [-29899, -2645],
            extent: [0, 0],
        },
        rc: [
            {
                id: 9020101,
                info: [
                    {
                        id: 4121,
                        w: 333,
                    },
                    {
                        id: 4122,
                        w: 333,
                    },
                    {
                        id: 4123,
                        w: 167,
                    },
                    {
                        id: 4021,
                        w: 778,
                    },
                    {
                        id: 4022,
                        w: 778,
                    },
                    {
                        id: 4023,
                        w: 389,
                    },
                    {
                        id: 4911,
                        w: 1444,
                    },
                    {
                        id: 4912,
                        w: 1444,
                    },
                    {
                        id: 4913,
                        w: 1444,
                    },
                    {
                        id: 4931,
                        w: 1444,
                    },
                    {
                        id: 4932,
                        w: 1444,
                    },
                ],
                count: 1,
                pos: [
                    [-22757, -10409],
                    [-21046, -3143],
                ],
            },
            {
                id: 9020102,
                info: [
                    {
                        id: 4111,
                        w: 333,
                    },
                    {
                        id: 4112,
                        w: 333,
                    },
                    {
                        id: 4113,
                        w: 167,
                    },
                    {
                        id: 4011,
                        w: 778,
                    },
                    {
                        id: 4012,
                        w: 778,
                    },
                    {
                        id: 4013,
                        w: 389,
                    },
                    {
                        id: 4921,
                        w: 1444,
                    },
                    {
                        id: 4922,
                        w: 1444,
                    },
                    {
                        id: 4923,
                        w: 1444,
                    },
                    {
                        id: 4931,
                        w: 1444,
                    },
                    {
                        id: 4932,
                        w: 1444,
                    },
                ],
                count: 2,
                pos: [
                    [-31565, 8725],
                    [-33249, -710],
                    [-38130, -1262],
                    [-24024, -2599],
                ],
            },
            {
                id: 9020103,
                info: [
                    {
                        id: 4081,
                        w: 133,
                    },
                    {
                        id: 4082,
                        w: 133,
                    },
                    {
                        id: 4083,
                        w: 67,
                    },
                    {
                        id: 4151,
                        w: 322,
                    },
                    {
                        id: 4152,
                        w: 322,
                    },
                    {
                        id: 4153,
                        w: 161,
                    },
                    {
                        id: 4051,
                        w: 752,
                    },
                    {
                        id: 4052,
                        w: 752,
                    },
                    {
                        id: 4053,
                        w: 376,
                    },
                    {
                        id: 4911,
                        w: 1396,
                    },
                    {
                        id: 4912,
                        w: 1396,
                    },
                    {
                        id: 4913,
                        w: 1396,
                    },
                    {
                        id: 4931,
                        w: 1396,
                    },
                    {
                        id: 4932,
                        w: 1396,
                    },
                ],
                count: 1,
                pos: [
                    [-25908, -11730],
                    [-27188, -3693],
                ],
            },
            {
                id: 9020104,
                info: [
                    {
                        id: 4131,
                        w: 333,
                    },
                    {
                        id: 4132,
                        w: 333,
                    },
                    {
                        id: 4133,
                        w: 167,
                    },
                    {
                        id: 4031,
                        w: 778,
                    },
                    {
                        id: 4032,
                        w: 778,
                    },
                    {
                        id: 4033,
                        w: 389,
                    },
                    {
                        id: 4921,
                        w: 1444,
                    },
                    {
                        id: 4922,
                        w: 1444,
                    },
                    {
                        id: 4923,
                        w: 1444,
                    },
                    {
                        id: 4931,
                        w: 1444,
                    },
                    {
                        id: 4932,
                        w: 1444,
                    },
                ],
                count: 1,
                pos: [[-39437, -6742]],
            },
            {
                id: 9020201,
                info: [
                    {
                        id: 4121,
                        w: 333,
                    },
                    {
                        id: 4122,
                        w: 333,
                    },
                    {
                        id: 4123,
                        w: 167,
                    },
                    {
                        id: 4021,
                        w: 778,
                    },
                    {
                        id: 4022,
                        w: 778,
                    },
                    {
                        id: 4023,
                        w: 389,
                    },
                    {
                        id: 4911,
                        w: 903,
                    },
                    {
                        id: 4912,
                        w: 903,
                    },
                    {
                        id: 4913,
                        w: 903,
                    },
                    {
                        id: 4921,
                        w: 903,
                    },
                    {
                        id: 4922,
                        w: 903,
                    },
                    {
                        id: 4923,
                        w: 903,
                    },
                    {
                        id: 4931,
                        w: 903,
                    },
                    {
                        id: 4932,
                        w: 903,
                    },
                ],
                count: 2,
                pos: [
                    [-40166, 35070],
                    [-28812, 25382],
                    [-28983, 17793],
                    [-26367, 13694],
                ],
            },
            {
                id: 9020202,
                info: [
                    {
                        id: 4121,
                        w: 333,
                    },
                    {
                        id: 4122,
                        w: 333,
                    },
                    {
                        id: 4123,
                        w: 167,
                    },
                    {
                        id: 4021,
                        w: 778,
                    },
                    {
                        id: 4022,
                        w: 778,
                    },
                    {
                        id: 4023,
                        w: 389,
                    },
                    {
                        id: 4911,
                        w: 903,
                    },
                    {
                        id: 4912,
                        w: 903,
                    },
                    {
                        id: 4913,
                        w: 903,
                    },
                    {
                        id: 4921,
                        w: 903,
                    },
                    {
                        id: 4922,
                        w: 903,
                    },
                    {
                        id: 4923,
                        w: 903,
                    },
                    {
                        id: 4931,
                        w: 903,
                    },
                    {
                        id: 4932,
                        w: 903,
                    },
                ],
                count: 1,
                pos: [
                    [-54639, 37696],
                    [-45600, 38819],
                ],
            },
            {
                id: 9020203,
                info: [
                    {
                        id: 4081,
                        w: 133,
                    },
                    {
                        id: 4082,
                        w: 133,
                    },
                    {
                        id: 4083,
                        w: 67,
                    },
                    {
                        id: 4151,
                        w: 322,
                    },
                    {
                        id: 4152,
                        w: 322,
                    },
                    {
                        id: 4153,
                        w: 161,
                    },
                    {
                        id: 4051,
                        w: 752,
                    },
                    {
                        id: 4052,
                        w: 752,
                    },
                    {
                        id: 4053,
                        w: 376,
                    },
                    {
                        id: 4911,
                        w: 1396,
                    },
                    {
                        id: 4922,
                        w: 1396,
                    },
                    {
                        id: 4923,
                        w: 1396,
                    },
                    {
                        id: 4931,
                        w: 1396,
                    },
                    {
                        id: 4932,
                        w: 1396,
                    },
                ],
                count: 2,
                pos: [
                    [-49532, 28513],
                    [-40740, 25763],
                    [-33943, 24595],
                    [-30893, 11922],
                ],
            },
            {
                id: 9020204,
                info: [
                    {
                        id: 4151,
                        w: 333,
                    },
                    {
                        id: 4152,
                        w: 333,
                    },
                    {
                        id: 4153,
                        w: 167,
                    },
                    {
                        id: 4051,
                        w: 778,
                    },
                    {
                        id: 4052,
                        w: 778,
                    },
                    {
                        id: 4053,
                        w: 389,
                    },
                    {
                        id: 4931,
                        w: 7222,
                    },
                ],
                count: 1,
                pos: [
                    [-10737, 34476],
                    [-18957, 25610],
                ],
            },
            {
                id: 9020205,
                info: [
                    {
                        id: 4081,
                        w: 133,
                    },
                    {
                        id: 4082,
                        w: 133,
                    },
                    {
                        id: 4083,
                        w: 67,
                    },
                    {
                        id: 4151,
                        w: 322,
                    },
                    {
                        id: 4152,
                        w: 322,
                    },
                    {
                        id: 4153,
                        w: 161,
                    },
                    {
                        id: 4051,
                        w: 752,
                    },
                    {
                        id: 4052,
                        w: 752,
                    },
                    {
                        id: 4053,
                        w: 376,
                    },
                    {
                        id: 4931,
                        w: 6981,
                    },
                ],
                count: 2,
                pos: [
                    [-1845, 20537],
                    [-11086, 14420],
                    [-16607, 23424],
                ],
            },
        ],
        tp: [
            {
                id: 9002,
                pos: [-8800, 42600],
                name: "羽化者",
                icon: "T_Gp_Boss",
            },
            {
                id: 1015,
                pos: [-21962, 24549],
                name: "风息小径",
                icon: "T_Gp_Trans03",
            },
            {
                id: 1016,
                pos: [-49727, 31495],
                name: "泪湖湖畔",
                icon: "T_Gp_Trans03",
            },
            {
                id: 1017,
                pos: [-29756, 12563],
                name: "风语渡口",
                icon: "T_Gp_Trans03",
            },
            {
                id: 1018,
                pos: [-3514, 18575],
                name: "融雪洞窟",
                icon: "T_Gp_Trans03",
            },
            {
                id: 1014,
                pos: [-33228, -8523],
                name: "格雷姆废矿",
                icon: "T_Gp_Trans03",
            },
            {
                id: 1010,
                pos: [-34886, 6415],
                name: "冰湖城郊外",
                icon: "T_Gp_Trans03",
            },
            {
                id: 1013,
                pos: [-16993, -4920],
                name: "冰湖城外围城门",
                icon: "T_Gp_Trans03",
            },
            {
                id: 2005,
                pos: [-32320, -14330],
                name: "格雷姆废矿",
                icon: "T_Gp_Kuangkeng",
            },
            {
                id: 2008,
                pos: [-39499, 2240],
                name: "费西尔秘密基地",
                icon: "T_Gp_Secr",
            },
            {
                id: 2815,
                pos: [-31071, 25822],
                name: "冰湖钓鱼点",
                icon: "T_Gp_Angling",
            },
            {
                id: 2012,
                pos: [-39990, 6541],
                name: "费西尔秘密基地",
                icon: "T_Gp_Secr",
            },
            {
                id: 2874,
                pos: [-38853, 27042],
                name: "留影地·泪湖湖畔",
                icon: "T_Gp_Camera",
            },
            {
                id: 2866,
                pos: [-52190, 41000],
                name: "留影地·泪湖",
                icon: "T_Gp_Camera",
            },
        ],
    },
    {
        id: 101104,
        rid: 1011,
        name: "军团要塞",
        desc: "军团要塞描述",
        map: "Chapter01_Mee",
        pos: [-25, 65],
    },
    {
        id: 101105,
        rid: 1011,
        name: "奥特赛德的家",
        desc: "奥特赛德住处描述",
        map: "Chapter01_OutsidersHome",
        pos: [-8800, -6180],
        range: {
            center: [-8800, -6180],
            extent: [0, 0],
        },
    },
    {
        id: 101106,
        rid: 1011,
        name: "“修普诺斯之家”",
        desc: "疗养院描述",
        map: "Chapter01_Sanatorium",
        pos: [6161, 143],
    },
    {
        id: 101107,
        rid: 1011,
        name: "“水仙平原”",
        desc: "酒馆描述",
        map: "Chapter01_Tavern",
        pos: [277, -7412],
    },
    {
        id: 101108,
        rid: 1011,
        name: "费西尔秘密基地",
        desc: "UI_SUBREGION_DES_101108",
        map: "Chapter01_Secr",
        pos: [38012, 12072],
    },
    {
        id: 101110,
        rid: 1011,
        name: "军团医院",
        desc: "病房描述",
        map: "Chapter01_Sick",
        pos: [0, 70],
    },
    {
        id: 101111,
        rid: 1011,
        name: "牵念之花",
        desc: "UI_SUBREGION_DES_101111",
        map: "Chapter01_Flow",
    },
    {
        id: 101301,
        rid: 1013,
        name: "矿洞一",
        desc: "矿洞一描述",
        map: "Chapter01_Kuangkeng_Part_01",
        pos: [9550, 4320],
        range: {
            center: [9550, 4320],
            extent: [0, 0],
        },
        rc: [
            {
                id: 9020401,
                info: [
                    {
                        id: 4091,
                        w: 133,
                    },
                    {
                        id: 4092,
                        w: 133,
                    },
                    {
                        id: 4093,
                        w: 67,
                    },
                    {
                        id: 4141,
                        w: 322,
                    },
                    {
                        id: 4142,
                        w: 322,
                    },
                    {
                        id: 4143,
                        w: 161,
                    },
                    {
                        id: 4041,
                        w: 752,
                    },
                    {
                        id: 4042,
                        w: 752,
                    },
                    {
                        id: 4043,
                        w: 376,
                    },
                    {
                        id: 4911,
                        w: 1396,
                    },
                    {
                        id: 4912,
                        w: 1396,
                    },
                    {
                        id: 4913,
                        w: 1396,
                    },
                    {
                        id: 4931,
                        w: 1396,
                    },
                    {
                        id: 4932,
                        w: 1396,
                    },
                ],
                count: 2,
                pos: [
                    [-7296, 5635],
                    [10367, 5506],
                ],
            },
        ],
        tp: [
            {
                id: 1020,
                pos: [-2104, -3290],
                name: "格雷姆废矿底层",
                icon: "T_Gp_Trans03",
            },
        ],
    },
    {
        id: 101303,
        rid: 1013,
        name: "矿洞三",
        desc: "矿洞三描述",
        map: "Chapter01_Kuangkeng_Part_03",
        pos: [10370, 30500],
        rc: [
            {
                id: 9020601,
                info: [
                    {
                        id: 4131,
                        w: 333,
                    },
                    {
                        id: 4132,
                        w: 333,
                    },
                    {
                        id: 4133,
                        w: 167,
                    },
                    {
                        id: 4031,
                        w: 778,
                    },
                    {
                        id: 4032,
                        w: 778,
                    },
                    {
                        id: 4033,
                        w: 389,
                    },
                    {
                        id: 4911,
                        w: 1444,
                    },
                    {
                        id: 4912,
                        w: 1444,
                    },
                    {
                        id: 4913,
                        w: 1444,
                    },
                    {
                        id: 4931,
                        w: 1444,
                    },
                    {
                        id: 4932,
                        w: 1444,
                    },
                ],
                count: 2,
                pos: [
                    [-851, 26959],
                    [8052, 29345],
                    [2042, 30489],
                ],
            },
        ],
    },
    {
        id: 101304,
        rid: 1013,
        name: "矿洞四",
        desc: "矿洞四描述",
        map: "Chapter01_Kuangkeng_Part_04",
        pos: [16408, 31374],
        rc: [
            {
                id: 9020701,
                info: [
                    {
                        id: 4091,
                        w: 133,
                    },
                    {
                        id: 4092,
                        w: 133,
                    },
                    {
                        id: 4093,
                        w: 67,
                    },
                    {
                        id: 4141,
                        w: 322,
                    },
                    {
                        id: 4142,
                        w: 322,
                    },
                    {
                        id: 4143,
                        w: 161,
                    },
                    {
                        id: 4041,
                        w: 752,
                    },
                    {
                        id: 4042,
                        w: 752,
                    },
                    {
                        id: 4043,
                        w: 376,
                    },
                    {
                        id: 4911,
                        w: 1396,
                    },
                    {
                        id: 4912,
                        w: 1396,
                    },
                    {
                        id: 4913,
                        w: 1396,
                    },
                    {
                        id: 4931,
                        w: 1396,
                    },
                    {
                        id: 4932,
                        w: 1396,
                    },
                ],
                count: 2,
                pos: [
                    [20441, 34652],
                    [27791, 35840],
                    [17146, 27207],
                ],
            },
        ],
        tp: [
            {
                id: 1021,
                pos: [13852, 31566],
                name: "格雷姆废矿深处",
                icon: "T_Gp_Trans03",
            },
            {
                id: 9001,
                pos: [18965, 31181],
                name: "嗜晶者",
                icon: "T_Gp_Boss",
            },
        ],
    },
    {
        id: 101305,
        rid: 1013,
        name: "矿洞二",
        desc: "UI_SUBREGION_DES_101305",
        map: "Chapter01_Kuangkeng_Part_02",
        pos: [3406, 21682],
        rc: [
            {
                id: 9020501,
                info: [
                    {
                        id: 4141,
                        w: 333,
                    },
                    {
                        id: 4142,
                        w: 333,
                    },
                    {
                        id: 4143,
                        w: 167,
                    },
                    {
                        id: 4041,
                        w: 778,
                    },
                    {
                        id: 4042,
                        w: 778,
                    },
                    {
                        id: 4043,
                        w: 389,
                    },
                    {
                        id: 4921,
                        w: 1444,
                    },
                    {
                        id: 4922,
                        w: 1444,
                    },
                    {
                        id: 4923,
                        w: 1444,
                    },
                    {
                        id: 4931,
                        w: 1444,
                    },
                    {
                        id: 4932,
                        w: 1444,
                    },
                ],
                count: 1,
                pos: [
                    [-1099, 13434],
                    [4421, 15633],
                ],
            },
        ],
    },
    {
        id: 101401,
        rid: 1014,
        name: "？？？",
        desc: "？？？【待包装】",
        map: "Chapter01_Won_Part01",
    },
    {
        id: 101402,
        rid: 1014,
        name: "UI_SUBREGION_NAME_101402",
        desc: "UI_SUBREGION_DES_101402",
        map: "Chapter01_Won_Part02",
    },
    {
        id: 101701,
        rid: 1017,
        name: "集水区",
        desc: "UI_SUBREGION_DES_101701",
        map: "Chapter01_Sew01",
        pos: [-20500, 1500],
        range: {
            center: [-39200, -700],
            extent: [0, 0],
        },
        rc: [
            {
                id: 9020801,
                info: [
                    {
                        id: 4111,
                        w: 333,
                    },
                    {
                        id: 4112,
                        w: 333,
                    },
                    {
                        id: 4113,
                        w: 167,
                    },
                    {
                        id: 4011,
                        w: 778,
                    },
                    {
                        id: 4012,
                        w: 778,
                    },
                    {
                        id: 4013,
                        w: 389,
                    },
                    {
                        id: 4931,
                        w: 7222,
                    },
                ],
                count: 3,
                pos: [
                    [-1573, 5029],
                    [-16258, -3994],
                    [-35960, -3382],
                    [-12237, 6702],
                ],
            },
            {
                id: 9020802,
                info: [
                    {
                        id: 4071,
                        w: 133,
                    },
                    {
                        id: 4072,
                        w: 133,
                    },
                    {
                        id: 4073,
                        w: 67,
                    },
                    {
                        id: 4111,
                        w: 322,
                    },
                    {
                        id: 4112,
                        w: 322,
                    },
                    {
                        id: 4113,
                        w: 161,
                    },
                    {
                        id: 4011,
                        w: 752,
                    },
                    {
                        id: 4012,
                        w: 752,
                    },
                    {
                        id: 4013,
                        w: 376,
                    },
                    {
                        id: 4931,
                        w: 6981,
                    },
                ],
                count: 1,
                pos: [
                    [-21515, 5044],
                    [-24688, -6023],
                ],
            },
        ],
        tp: [
            {
                id: 1030,
                pos: [632, 693],
                name: "冰湖城下水道",
                icon: "T_Gp_Trans03",
            },
            {
                id: 1033,
                pos: [-31374, 4286],
                name: "废水处理区深处",
                icon: "T_Gp_Trans03",
            },
        ],
    },
    {
        id: 101702,
        rid: 1017,
        name: "管道区",
        desc: "UI_SUBREGION_DES_101702",
        map: "Chapter01_Sew02",
        pos: [-28500, -15000],
        range: {
            center: [-29310, -10890],
            extent: [0, 0],
        },
        rc: [
            {
                id: 9020901,
                info: [
                    {
                        id: 4111,
                        w: 333,
                    },
                    {
                        id: 4112,
                        w: 333,
                    },
                    {
                        id: 4113,
                        w: 167,
                    },
                    {
                        id: 4011,
                        w: 778,
                    },
                    {
                        id: 4012,
                        w: 778,
                    },
                    {
                        id: 4013,
                        w: 389,
                    },
                    {
                        id: 4931,
                        w: 7222,
                    },
                ],
                count: 1,
                pos: [
                    [-21161, -12619],
                    [-17372, -11559],
                    [-29994, -14370],
                ],
            },
            {
                id: 9020902,
                info: [
                    {
                        id: 4161,
                        w: 333,
                    },
                    {
                        id: 4162,
                        w: 333,
                    },
                    {
                        id: 4163,
                        w: 167,
                    },
                    {
                        id: 4061,
                        w: 778,
                    },
                    {
                        id: 4062,
                        w: 778,
                    },
                    {
                        id: 4063,
                        w: 389,
                    },
                    {
                        id: 4931,
                        w: 7222,
                    },
                ],
                count: 1,
                pos: [
                    [-27353, -21748],
                    [-30449, -8490],
                ],
            },
        ],
        tp: [
            {
                id: 1031,
                pos: [-17261, -8662],
                name: "冰湖城下水道深处",
                icon: "T_Gp_Trans03",
            },
            {
                id: 1032,
                pos: [-33224, -14159],
                name: "废水处理区",
                icon: "T_Gp_Trans03",
            },
            {
                id: 2816,
                pos: [-28245, -18056],
                name: "下水道钓鱼点",
                icon: "T_Gp_Angling",
            },
        ],
    },
    {
        id: 101703,
        rid: 1017,
        name: "UI_SUBREGION_NAME_101703",
        desc: "UI_SUBREGION_DES_101703",
        map: "Chapter01_Sew03",
        pos: [-5500, -11500],
        range: {
            center: [-10478, -4960],
            extent: [0, 0],
        },
        rc: [
            {
                id: 9021001,
                info: [
                    {
                        id: 4161,
                        w: 333,
                    },
                    {
                        id: 4162,
                        w: 333,
                    },
                    {
                        id: 4163,
                        w: 167,
                    },
                    {
                        id: 4061,
                        w: 778,
                    },
                    {
                        id: 4062,
                        w: 778,
                    },
                    {
                        id: 4063,
                        w: 389,
                    },
                    {
                        id: 4931,
                        w: 7222,
                    },
                ],
                count: 1,
                pos: [
                    [-13377, -8171],
                    [-4429, -5458],
                ],
            },
        ],
        tp: [
            {
                id: 2833,
                pos: [-6590, -11350],
                name: "冰湖城下水道深处",
                icon: "T_Gp_Camera",
            },
        ],
    },
    {
        id: 101901,
        rid: 1019,
        name: "盖雷亚剧院",
        desc: "UI_SUBREGION_DES_101901",
        map: "BH_Thea",
        pos: [20400, 5340],
        range: {
            center: [20400, 5340],
            extent: [0, 0],
        },
        tp: [
            {
                id: 1050,
                pos: [21110, 10770],
                name: "盖雷亚剧院",
                icon: "T_Gp_Trans03",
            },
            {
                id: 9004,
                pos: [20490, 4135],
                name: "雪国的野兽",
                icon: "T_Gp_Boss",
            },
            {
                id: 2834,
                pos: [20510, 900],
                name: "盖雷亚剧院",
                icon: "T_Gp_Camera",
            },
        ],
    },
    {
        id: 102101,
        rid: 1021,
        name: "仓储区",
        desc: "UI_SUBREGION_DES_102101",
        map: "Haiboliya_Longsha01",
        pos: [14000, -40000],
        range: {
            center: [-240, -35655],
            extent: [0, 0],
        },
        rc: [
            {
                id: 9030101,
                info: [
                    {
                        id: 4131,
                        w: 333,
                    },
                    {
                        id: 4132,
                        w: 333,
                    },
                    {
                        id: 4133,
                        w: 167,
                    },
                    {
                        id: 4031,
                        w: 778,
                    },
                    {
                        id: 4032,
                        w: 778,
                    },
                    {
                        id: 4033,
                        w: 389,
                    },
                    {
                        id: 4911,
                        w: 1204,
                    },
                    {
                        id: 4912,
                        w: 1204,
                    },
                    {
                        id: 4913,
                        w: 1204,
                    },
                    {
                        id: 4921,
                        w: 1204,
                    },
                    {
                        id: 4922,
                        w: 1204,
                    },
                    {
                        id: 4923,
                        w: 1204,
                    },
                ],
                count: 1,
                pos: [
                    [33706, -35625],
                    [30252, -29576],
                ],
            },
            {
                id: 9030102,
                info: [
                    {
                        id: 4071,
                        w: 133,
                    },
                    {
                        id: 4072,
                        w: 133,
                    },
                    {
                        id: 4073,
                        w: 67,
                    },
                    {
                        id: 4141,
                        w: 322,
                    },
                    {
                        id: 4142,
                        w: 322,
                    },
                    {
                        id: 4143,
                        w: 161,
                    },
                    {
                        id: 4041,
                        w: 752,
                    },
                    {
                        id: 4042,
                        w: 752,
                    },
                    {
                        id: 4043,
                        w: 376,
                    },
                    {
                        id: 4931,
                        w: 6981,
                    },
                ],
                count: 2,
                pos: [
                    [1621, -40212],
                    [20689, -40742],
                    [-1064, -24023],
                ],
            },
        ],
        tp: [
            {
                id: 1040,
                pos: [29184, -30997],
                name: "龙莎要塞装卸区",
                icon: "T_Gp_Trans03",
            },
            {
                id: 1042,
                pos: [-3802, -35377],
                name: "龙莎要塞动力室",
                icon: "T_Gp_Trans03",
            },
            {
                id: 1041,
                pos: [10038, -42605],
                name: "龙莎要塞外环",
                icon: "T_Gp_Trans03",
            },
        ],
    },
    {
        id: 102102,
        rid: 1021,
        name: "中心区",
        desc: "UI_SUBREGION_DES_102102",
        map: "Haiboliya_Longsha02",
        pos: [-500, 2500],
        range: {
            center: [-10751, 3126],
            extent: [0, 0],
        },
        rc: [
            {
                id: 9030201,
                info: [
                    {
                        id: 4071,
                        w: 133,
                    },
                    {
                        id: 4072,
                        w: 133,
                    },
                    {
                        id: 4073,
                        w: 67,
                    },
                    {
                        id: 4141,
                        w: 322,
                    },
                    {
                        id: 4142,
                        w: 322,
                    },
                    {
                        id: 4143,
                        w: 161,
                    },
                    {
                        id: 4041,
                        w: 752,
                    },
                    {
                        id: 4042,
                        w: 752,
                    },
                    {
                        id: 4043,
                        w: 376,
                    },
                    {
                        id: 4931,
                        w: 6981,
                    },
                ],
                count: 2,
                pos: [
                    [-21631, 5120],
                    [-23545, 2606],
                    [-4236, 8481],
                ],
            },
            {
                id: 9030202,
                info: [
                    {
                        id: 4131,
                        w: 333,
                    },
                    {
                        id: 4132,
                        w: 333,
                    },
                    {
                        id: 4133,
                        w: 167,
                    },
                    {
                        id: 4031,
                        w: 778,
                    },
                    {
                        id: 4032,
                        w: 778,
                    },
                    {
                        id: 4033,
                        w: 389,
                    },
                    {
                        id: 4911,
                        w: 1204,
                    },
                    {
                        id: 4912,
                        w: 1204,
                    },
                    {
                        id: 4913,
                        w: 1204,
                    },
                    {
                        id: 4921,
                        w: 1204,
                    },
                    {
                        id: 4922,
                        w: 1204,
                    },
                    {
                        id: 4923,
                        w: 1204,
                    },
                ],
                count: 2,
                pos: [
                    [-10639, -22130],
                    [-24251, -4697],
                    [-14566, 2776],
                ],
            },
        ],
        tp: [
            {
                id: 1044,
                pos: [-19392, -1767],
                name: "龙莎要塞模拟战场",
                icon: "T_Gp_Trans03",
            },
            {
                id: 1045,
                pos: [4223, 4940],
                name: "龙莎要塞中央控制室",
                icon: "T_Gp_Trans03",
            },
            {
                id: 1043,
                pos: [-5977, -11054],
                name: "龙莎要塞下水道",
                icon: "T_Gp_Trans03",
            },
        ],
    },
    {
        id: 102103,
        rid: 1021,
        name: "地下水道",
        desc: "UI_SUBREGION_DES_102103",
        map: "Haiboliya_Longsha03",
        pos: [-500, 2500],
    },
    {
        id: 102104,
        rid: 1021,
        name: "？？？",
        desc: "UI_SUBREGION_DES_102104",
        map: "Haiboliya_Longsha04",
        pos: [-500, 2500],
        tp: [
            {
                id: 9003,
                pos: [3946, -8069],
                name: "炼火的典狱长",
                icon: "T_Gp_Boss",
            },
        ],
    },
    {
        id: 103201,
        rid: 1032,
        name: "佩剑炼金院",
        desc: "UI_SUBREGION_DES_103201",
        map: "Chapter01_Alch",
        pos: [5029, -6025],
        range: {
            center: [5029, -6025],
            extent: [0, 0],
        },
    },
    {
        id: 104102,
        rid: 1041,
        name: "听鸦原",
        desc: "UI_SUBREGION_DES_104102",
        map: "Huaxu_Yanjindu_Batt",
        pos: [-48564, 12801],
        range: {
            center: [-92905, 10953],
            extent: [60500, 52938],
            anchor: [-48564, 12801],
        },
        rc: [
            {
                id: 9040801,
                info: [
                    {
                        id: 4071,
                        w: 133,
                    },
                    {
                        id: 4072,
                        w: 133,
                    },
                    {
                        id: 4073,
                        w: 67,
                    },
                    {
                        id: 4141,
                        w: 322,
                    },
                    {
                        id: 4142,
                        w: 322,
                    },
                    {
                        id: 4143,
                        w: 161,
                    },
                    {
                        id: 4041,
                        w: 752,
                    },
                    {
                        id: 4042,
                        w: 752,
                    },
                    {
                        id: 4043,
                        w: 376,
                    },
                    {
                        id: 4941,
                        w: 6981,
                    },
                ],
                count: 2,
                pos: [
                    [-50472, 10423],
                    [-61051, 81],
                    [-69591, 6217],
                ],
            },
        ],
        tp: [
            {
                id: 1106,
                pos: [-41158, 6354],
                name: "听鸦原",
                icon: "T_Gp_Trans03",
            },
        ],
    },
    {
        id: 104103,
        rid: 1041,
        name: "潮声岩穴",
        desc: "UI_SUBREGION_DES_104103",
        map: "Huaxu_Yanjindu_Cav",
        pos: [-692, 26053],
        range: {
            center: [6000, 20000],
            extent: [11000, 6600],
        },
        rc: [
            {
                id: 9040301,
                info: [
                    {
                        id: 4091,
                        w: 133,
                    },
                    {
                        id: 4092,
                        w: 133,
                    },
                    {
                        id: 4093,
                        w: 67,
                    },
                    {
                        id: 4111,
                        w: 322,
                    },
                    {
                        id: 4112,
                        w: 322,
                    },
                    {
                        id: 4113,
                        w: 161,
                    },
                    {
                        id: 4011,
                        w: 752,
                    },
                    {
                        id: 4012,
                        w: 752,
                    },
                    {
                        id: 4013,
                        w: 376,
                    },
                    {
                        id: 4941,
                        w: 6981,
                    },
                ],
                count: 1,
                pos: [
                    [16763, 24927],
                    [6018, 18257],
                    [36, 33496],
                ],
            },
        ],
        tp: [
            {
                id: 1104,
                pos: [9817, 22799],
                name: "潮声岩穴内部",
                icon: "T_Gp_Trans03",
            },
            {
                id: 2820,
                pos: [-5619, 31992],
                name: "潮声岩穴钓鱼点",
                icon: "T_Gp_Angling",
            },
            {
                id: 8004,
                pos: [-6274, 23368],
                name: "灵鸟回声·扼守（潮声岩穴）",
                icon: "T_Gp_AreaCoop",
            },
        ],
    },
    {
        id: 104104,
        rid: 1041,
        name: "幽明涧",
        desc: "UI_SUBREGION_DES_104104",
        map: "Huaxu_Yanjindu_Cen",
        pos: [4920, -1399],
        range: {
            center: [6000, -6000],
            extent: [6600, 6600],
            anchor: [4920, -1399],
        },
        rc: [
            {
                id: 9040601,
                info: [
                    {
                        id: 4071,
                        w: 133,
                    },
                    {
                        id: 4072,
                        w: 133,
                    },
                    {
                        id: 4073,
                        w: 67,
                    },
                    {
                        id: 4141,
                        w: 322,
                    },
                    {
                        id: 4142,
                        w: 322,
                    },
                    {
                        id: 4143,
                        w: 161,
                    },
                    {
                        id: 4041,
                        w: 752,
                    },
                    {
                        id: 4042,
                        w: 752,
                    },
                    {
                        id: 4043,
                        w: 376,
                    },
                    {
                        id: 4941,
                        w: 6981,
                    },
                ],
                count: 2,
                pos: [
                    [-4084, -2706],
                    [8766, -7557],
                    [7436, 2209],
                    [-1396, 6628],
                ],
            },
        ],
        tp: [
            {
                id: 1109,
                pos: [7731, -9705],
                name: "幽明涧",
                icon: "T_Gp_Trans03",
            },
            {
                id: 8006,
                pos: [-1440, -13200],
                name: "灵鸟回声·驱离（往隙）",
                icon: "T_Gp_AreaCoop",
            },
            {
                id: 2875,
                pos: [-44803, 7630],
                name: "留影地·听鸦原",
                icon: "T_Gp_Camera",
            },
            {
                id: 2872,
                pos: [28956, 27042],
                name: "留影地·蓼风岭",
                icon: "T_Gp_Camera",
            },
            {
                id: 2871,
                pos: [-18481, 15712],
                name: "留影地·微茫市",
                icon: "T_Gp_Camera",
            },
            {
                id: 2870,
                pos: [32354, 54041],
                name: "留影地·浮星埠",
                icon: "T_Gp_Camera",
            },
            {
                id: 2869,
                pos: [39258, 5329],
                name: "留影地·百年春",
                icon: "T_Gp_Camera",
            },
            {
                id: 2868,
                pos: [6408, -2469],
                name: "留影地·幽明涧",
                icon: "T_Gp_Camera",
            },
            {
                id: 2867,
                pos: [17489, -37970],
                name: "留影地·枯荣阁",
                icon: "T_Gp_Camera",
            },
        ],
    },
    {
        id: 104105,
        rid: 1041,
        name: "尘漠石海",
        desc: "UI_SUBREGION_DES_104105",
        map: "Huaxu_Yanjindu_Fil",
        pos: [-21776, -14958],
        range: {
            center: [-25000, -4500],
            extent: [14300, 4950],
            anchor: [-21776, -14958],
        },
        rc: [
            {
                id: 9040901,
                info: [
                    {
                        id: 4091,
                        w: 133,
                    },
                    {
                        id: 4092,
                        w: 133,
                    },
                    {
                        id: 4093,
                        w: 67,
                    },
                    {
                        id: 4111,
                        w: 322,
                    },
                    {
                        id: 4112,
                        w: 322,
                    },
                    {
                        id: 4113,
                        w: 161,
                    },
                    {
                        id: 4011,
                        w: 752,
                    },
                    {
                        id: 4012,
                        w: 752,
                    },
                    {
                        id: 4013,
                        w: 376,
                    },
                    {
                        id: 4941,
                        w: 6981,
                    },
                ],
                count: 3,
                pos: [
                    [-21795, -17224],
                    [-22321, -6764],
                    [-18496, -26227],
                    [-28188, -34272],
                ],
            },
        ],
        tp: [
            {
                id: 1107,
                pos: [-23383, -24272],
                name: "尘漠石海",
                icon: "T_Gp_Trans02",
            },
            {
                id: 8001,
                pos: [-22713, -15610],
                name: "灵鸟回声·避险（尘漠石海）",
                icon: "T_Gp_AreaCoop",
            },
            {
                id: 2014,
                pos: [-9753, -36781],
                name: "烛阴祭坛",
                icon: "T_Gp_Leave",
            },
        ],
    },
    {
        id: 104106,
        rid: 1041,
        name: "枯荣阁",
        desc: "UI_SUBREGION_DES_104106",
        map: "Huaxu_Yanjindu_Hos",
        pos: [17274, -28561],
        range: {
            center: [18000, -27000],
            extent: [6600, 23100],
            anchor: [17274, -28561],
        },
        rc: [
            {
                id: 9040501,
                info: [
                    {
                        id: 4121,
                        w: 333,
                    },
                    {
                        id: 4122,
                        w: 333,
                    },
                    {
                        id: 4123,
                        w: 167,
                    },
                    {
                        id: 4021,
                        w: 778,
                    },
                    {
                        id: 4022,
                        w: 778,
                    },
                    {
                        id: 4023,
                        w: 389,
                    },
                    {
                        id: 4941,
                        w: 7222,
                    },
                ],
                count: 2,
                pos: [
                    [14781, -28166],
                    [16962, -18873],
                    [19007, -36545],
                ],
            },
            {
                id: 9040502,
                info: [
                    {
                        id: 4161,
                        w: 333,
                    },
                    {
                        id: 4162,
                        w: 333,
                    },
                    {
                        id: 4163,
                        w: 167,
                    },
                    {
                        id: 4061,
                        w: 778,
                    },
                    {
                        id: 4062,
                        w: 778,
                    },
                    {
                        id: 4063,
                        w: 389,
                    },
                    {
                        id: 4941,
                        w: 7222,
                    },
                ],
                count: 2,
                pos: [
                    [12843, -20665],
                    [19542, -28277],
                    [27727, -14502],
                ],
            },
        ],
        tp: [
            {
                id: 1110,
                pos: [18608, -25303],
                name: "枯荣阁",
                icon: "T_Gp_Trans03",
            },
            {
                id: 2821,
                pos: [14677, -13509],
                name: "枯荣阁钓鱼点",
                icon: "T_Gp_Angling",
            },
            {
                id: 8002,
                pos: [19351, -18648],
                name: "灵鸟回声·驱逐（枯荣阁）",
                icon: "T_Gp_AreaCoop",
            },
        ],
    },
    {
        id: 104107,
        rid: 1041,
        name: "蒹葭浦",
        desc: "UI_SUBREGION_DES_104107",
        map: "Huaxu_Yanjindu_Plai",
        pos: [39774, -2157],
        range: {
            center: [51691, -4000],
            extent: [15125, 8800],
            anchor: [39774, -2157],
        },
        rc: [
            {
                id: 9040201,
                info: [
                    {
                        id: 4081,
                        w: 133,
                    },
                    {
                        id: 4082,
                        w: 133,
                    },
                    {
                        id: 4083,
                        w: 67,
                    },
                    {
                        id: 4151,
                        w: 322,
                    },
                    {
                        id: 4152,
                        w: 322,
                    },
                    {
                        id: 4153,
                        w: 161,
                    },
                    {
                        id: 4051,
                        w: 752,
                    },
                    {
                        id: 4052,
                        w: 752,
                    },
                    {
                        id: 4053,
                        w: 376,
                    },
                    {
                        id: 4941,
                        w: 6981,
                    },
                ],
                count: 2,
                pos: [
                    [39200, 6605],
                    [27761, 31997],
                    [6141, 18305],
                ],
            },
        ],
        tp: [
            {
                id: 1103,
                pos: [35037, 12202],
                name: "蒹葭浦",
                icon: "T_Gp_Trans02",
            },
            {
                id: 1108,
                pos: [24643, 16027],
                name: "潮声岩穴入口",
                icon: "T_Gp_Trans02",
            },
            {
                id: 1111,
                pos: [2376, 23863],
                name: "蓼风岭西侧",
                icon: "T_Gp_Trans02",
            },
            {
                id: 1112,
                pos: [26937, 33106],
                name: "蓼风岭东侧",
                icon: "T_Gp_Trans03",
            },
            {
                id: 8005,
                pos: [6760, 22943],
                name: "灵鸟回声·避险（蓼风岭）",
                icon: "T_Gp_AreaCoop",
            },
            {
                id: 8000,
                pos: [38273, 6442],
                name: "灵鸟回声·扼守（蒹葭浦）",
                icon: "T_Gp_AreaCoop",
            },
        ],
    },
    {
        id: 104108,
        rid: 1041,
        name: "浮星埠",
        desc: "UI_SUBREGION_DES_104108",
        map: "Huaxu_Yanjindu_Por",
        pos: [35173, 49665],
        range: {
            center: [52800, 40000],
            extent: [13750, 39600],
            anchor: [35173, 49665],
        },
        rc: [
            {
                id: 9040101,
                info: [
                    {
                        id: 4121,
                        w: 333,
                    },
                    {
                        id: 4122,
                        w: 333,
                    },
                    {
                        id: 4123,
                        w: 167,
                    },
                    {
                        id: 4021,
                        w: 778,
                    },
                    {
                        id: 4022,
                        w: 778,
                    },
                    {
                        id: 4023,
                        w: 389,
                    },
                    {
                        id: 4941,
                        w: 7222,
                    },
                ],
                count: 2,
                pos: [
                    [38942, 64333],
                    [32073, 42821],
                    [39168, 39099],
                ],
            },
            {
                id: 9040102,
                info: [
                    {
                        id: 4151,
                        w: 333,
                    },
                    {
                        id: 4152,
                        w: 333,
                    },
                    {
                        id: 4153,
                        w: 167,
                    },
                    {
                        id: 4051,
                        w: 778,
                    },
                    {
                        id: 4052,
                        w: 778,
                    },
                    {
                        id: 4053,
                        w: 389,
                    },
                    {
                        id: 4941,
                        w: 7222,
                    },
                ],
                count: 2,
                pos: [
                    [58448, 24299],
                    [26612, 41806],
                    [45586, 13789],
                ],
            },
            {
                id: 9040103,
                info: [
                    {
                        id: 4161,
                        w: 333,
                    },
                    {
                        id: 4162,
                        w: 333,
                    },
                    {
                        id: 4163,
                        w: 167,
                    },
                    {
                        id: 4061,
                        w: 778,
                    },
                    {
                        id: 4062,
                        w: 778,
                    },
                    {
                        id: 4063,
                        w: 389,
                    },
                    {
                        id: 4941,
                        w: 7222,
                    },
                ],
                count: 1,
                pos: [
                    [45235, 44419],
                    [45917, 29777],
                ],
            },
        ],
        tp: [
            {
                id: 1100,
                pos: [39437, 45854],
                name: "浮星埠",
                icon: "T_Gp_Trans03",
            },
            {
                id: 1101,
                pos: [46155, 22382],
                name: "诫碑区",
                icon: "T_Gp_Trans02",
            },
            {
                id: 2818,
                pos: [30373, 61000],
                name: "浮星埠钓鱼点",
                icon: "T_Gp_Angling",
            },
            {
                id: 8003,
                pos: [45084, 42222],
                name: "灵鸟回声·驱离（浮星埠）",
                icon: "T_Gp_AreaCoop",
            },
            {
                id: 2824,
                pos: [31820, 48650],
                name: "皓京渔业协会",
                icon: "T_Gp_Shop",
            },
        ],
    },
    {
        id: 104109,
        rid: 1041,
        name: "微茫市",
        desc: "UI_SUBREGION_DES_104109",
        map: "Huaxu_Yanjindu_Shi",
        pos: [-20576, 9367],
        range: {
            center: [-2000, 10500],
            extent: [11000, 1650],
            anchor: [-20576, 9367],
        },
        rc: [
            {
                id: 9040701,
                info: [
                    {
                        id: 4121,
                        w: 333,
                    },
                    {
                        id: 4122,
                        w: 333,
                    },
                    {
                        id: 4123,
                        w: 167,
                    },
                    {
                        id: 4021,
                        w: 778,
                    },
                    {
                        id: 4022,
                        w: 778,
                    },
                    {
                        id: 4023,
                        w: 389,
                    },
                    {
                        id: 4941,
                        w: 7222,
                    },
                ],
                count: 2,
                pos: [
                    [-33552, 2051],
                    [-22547, 11753],
                    [-19532, 15889],
                ],
            },
            {
                id: 9040702,
                info: [
                    {
                        id: 4131,
                        w: 333,
                    },
                    {
                        id: 4132,
                        w: 333,
                    },
                    {
                        id: 4133,
                        w: 167,
                    },
                    {
                        id: 4031,
                        w: 778,
                    },
                    {
                        id: 4032,
                        w: 778,
                    },
                    {
                        id: 4033,
                        w: 389,
                    },
                    {
                        id: 4941,
                        w: 7222,
                    },
                ],
                count: 2,
                pos: [
                    [-13641, 11898],
                    [-22372, 7861],
                    [-24763, 7165],
                ],
            },
        ],
        tp: [
            {
                id: 1105,
                pos: [-16352, 11053],
                name: "微茫市",
                icon: "T_Gp_Trans03",
            },
            {
                id: 2013,
                pos: [-25203, 6819],
                name: "潜龙居",
                icon: "T_Gp_Office",
            },
            {
                id: 2822,
                pos: [-22464, 11542],
                name: "微茫市钓鱼点",
                icon: "T_Gp_Angling",
            },
            {
                id: 2823,
                pos: [-16004, 8005],
                name: "探险家馈赠",
                icon: "T_Gp_Shop",
            },
        ],
    },
    {
        id: 104110,
        rid: 1041,
        name: "百年春",
        desc: "UI_SUBREGION_DES_104110",
        map: "Huaxu_Yanjindu_Spr",
        pos: [32371, -5906],
        range: {
            center: [31000, -4000],
            extent: [7700, 8800],
            anchor: [32371, -5906],
        },
        rc: [
            {
                id: 9040401,
                info: [
                    {
                        id: 4131,
                        w: 333,
                    },
                    {
                        id: 4132,
                        w: 333,
                    },
                    {
                        id: 4133,
                        w: 167,
                    },
                    {
                        id: 4031,
                        w: 778,
                    },
                    {
                        id: 4032,
                        w: 778,
                    },
                    {
                        id: 4033,
                        w: 389,
                    },
                    {
                        id: 4941,
                        w: 7222,
                    },
                ],
                count: 2,
                pos: [
                    [28139, -1399],
                    [23541, 4390],
                    [32374, -9113],
                    [34448, -5206],
                ],
            },
        ],
        tp: [
            {
                id: 1102,
                pos: [31029, -6177],
                name: "百年春",
                icon: "T_Gp_Trans03",
            },
            {
                id: 2819,
                pos: [29404, 1702],
                name: "百年春钓鱼点",
                icon: "T_Gp_Angling",
            },
            {
                id: 2825,
                pos: [26370, -5100],
                name: "锦鲤皎皎福运蛋铺",
                icon: "T_Gp_Shop",
            },
            {
                id: 2826,
                pos: [32634, -7003],
                name: "蛋皎的印象商店",
                icon: "T_Gp_Shop",
            },
            {
                id: 2835,
                pos: [37080, 6230],
                name: "百年春",
                icon: "T_Gp_Camera",
            },
            {
                id: 2502,
                pos: [33046, -4278],
                name: "集结",
                icon: "T_Gp_Gathering",
            },
        ],
    },
    {
        id: 104201,
        rid: 1042,
        name: "千枢狩阵",
        desc: "UI_SUBREGION_DES_104201",
        map: "Huaxu_Yanjindu_Batt01",
        pos: [-9725, 34084],
        range: {
            center: [-9725, 34084],
            extent: [0, 0],
        },
    },
    {
        id: 104301,
        rid: 1043,
        name: "往隙",
        desc: "UI_SUBREGION_DES_104301",
        map: "Huaxu_Yanjindu_Nai01",
        pos: [13281, 8446],
        range: {
            center: [13281, 8446],
            extent: [0, 0],
        },
    },
    {
        id: 104401,
        rid: 1044,
        name: "往隙",
        desc: "UI_SUBREGION_DES_104401",
        map: "Huaxu_Yanjindu_Nai02",
        pos: [6914, -7343],
        range: {
            center: [6914, -7343],
            extent: [0, 0],
        },
    },
    {
        id: 104501,
        rid: 1045,
        name: "东城",
        desc: "UI_SUBREGION_DES_104501",
        map: "Huaxu_Haojing_Eas",
        pos: [60330, -16030],
        range: {
            center: [60330, -16030],
            extent: [27500, 27500],
            anchor: [60330, -16030],
        },
        rc: [
            {
                id: 9050101,
                info: [
                    {
                        id: 4121,
                        w: 333,
                    },
                    {
                        id: 4122,
                        w: 333,
                    },
                    {
                        id: 4123,
                        w: 167,
                    },
                    {
                        id: 4021,
                        w: 778,
                    },
                    {
                        id: 4022,
                        w: 778,
                    },
                    {
                        id: 4023,
                        w: 389,
                    },
                    {
                        id: 4941,
                        w: 7222,
                    },
                ],
                count: 2,
                pos: [
                    [46991, -6631],
                    [57671, -25113],
                    [38754, -17729],
                ],
            },
        ],
        tp: [
            {
                id: 1200,
                pos: [43600, -14370],
                name: "东城",
                icon: "T_Gp_Trans02",
            },
            {
                id: 2850,
                pos: [58430, -23280],
                name: "锦鲤皎皎福运蛋铺",
                icon: "T_Gp_Shop",
            },
            {
                id: 1202,
                pos: [43307, -34483],
                name: "分殊学院",
                icon: "T_Gp_Trans02",
            },
        ],
    },
    {
        id: 104502,
        rid: 1045,
        name: "西城",
        desc: "UI_SUBREGION_DES_104502",
        map: "Huaxu_Haojing_Wes",
        pos: [8520, -25620],
        range: {
            center: [8520, -19250],
            extent: [15400, 34375],
            anchor: [8520, -25620],
        },
        rc: [
            {
                id: 9050201,
                info: [
                    {
                        id: 4161,
                        w: 333,
                    },
                    {
                        id: 4162,
                        w: 333,
                    },
                    {
                        id: 4163,
                        w: 167,
                    },
                    {
                        id: 4061,
                        w: 778,
                    },
                    {
                        id: 4062,
                        w: 778,
                    },
                    {
                        id: 4063,
                        w: 389,
                    },
                    {
                        id: 4941,
                        w: 7222,
                    },
                ],
                count: 3,
                pos: [
                    [18215, -3707],
                    [-4513, -24052],
                    [17738, -47960],
                    [5917, -28806],
                ],
            },
        ],
        tp: [
            {
                id: 1203,
                pos: [9679, -7692],
                name: "参商港",
                icon: "T_Gp_Trans02",
            },
            {
                id: 1205,
                pos: [14271, -29017],
                name: "西城",
                icon: "T_Gp_Trans02",
            },
            {
                id: 2828,
                pos: [25010, -8420],
                name: "城西区钓鱼点",
                icon: "T_Gp_Angling",
            },
            {
                id: 2837,
                pos: [-8822, -16420],
                name: "山外山",
                icon: "T_Gp_Shanwaishan",
            },
            {
                id: 2853,
                pos: [22130, -12870],
                name: "皓京渔业协会",
                icon: "T_Gp_Shop",
            },
        ],
    },
    {
        id: 104503,
        rid: 1045,
        name: "内城",
        desc: "UI_SUBREGION_DES_104503",
        map: "Huaxu_Haojing_Inn",
        pos: [31392, -85458],
        range: {
            center: [31392, -85458],
            extent: [16500, 38500],
            anchor: [31392, -85458],
        },
        rc: [
            {
                id: 9050501,
                info: [
                    {
                        id: 4131,
                        w: 333,
                    },
                    {
                        id: 4132,
                        w: 333,
                    },
                    {
                        id: 4133,
                        w: 167,
                    },
                    {
                        id: 4031,
                        w: 778,
                    },
                    {
                        id: 4032,
                        w: 778,
                    },
                    {
                        id: 4033,
                        w: 389,
                    },
                    {
                        id: 4941,
                        w: 7222,
                    },
                ],
                count: 3,
                pos: [
                    [21851, -63407],
                    [39530, -64344],
                    [21716, -85451],
                    [41494, -77562],
                ],
            },
        ],
        tp: [
            {
                id: 1206,
                pos: [33302, -45653],
                name: "皓京中央广场",
                icon: "T_Gp_Trans02",
            },
            {
                id: 2503,
                pos: [31555, -45164],
                name: "集结",
                icon: "T_Gp_Gathering",
            },
            {
                id: 1207,
                pos: [30649, -75570],
                name: "九章坪",
                icon: "T_Gp_Trans02",
            },
            {
                id: 2840,
                pos: [40233, -50974],
                name: "由来巷",
                icon: "T_Gp_Youlaixiang",
            },
            {
                id: 1216,
                pos: [33050, -55115],
                name: "内城",
                icon: "T_Gp_Trans02",
            },
            {
                id: 2851,
                pos: [29590, -45620],
                name: "蛋皎的印象商店",
                icon: "T_Gp_Shop",
            },
            {
                id: 2852,
                pos: [31918, -37425],
                name: "探险家馈赠",
                icon: "T_Gp_Shop",
            },
        ],
    },
    {
        id: 104504,
        rid: 1045,
        name: "西郊",
        desc: "UI_SUBREGION_DES_104504",
        map: "Huaxu_Haojing_Jlc",
        pos: [-30440, -68000],
        range: {
            center: [-30440, -68000],
            extent: [27500, 38500],
            anchor: [-30440, -68000],
        },
        rc: [
            {
                id: 9050301,
                info: [
                    {
                        id: 4081,
                        w: 133,
                    },
                    {
                        id: 4082,
                        w: 133,
                    },
                    {
                        id: 4083,
                        w: 67,
                    },
                    {
                        id: 4151,
                        w: 322,
                    },
                    {
                        id: 4152,
                        w: 322,
                    },
                    {
                        id: 4153,
                        w: 161,
                    },
                    {
                        id: 4051,
                        w: 752,
                    },
                    {
                        id: 4052,
                        w: 752,
                    },
                    {
                        id: 4053,
                        w: 376,
                    },
                    {
                        id: 4941,
                        w: 6981,
                    },
                ],
                count: 3,
                pos: [
                    [-11408, -59443],
                    [-30278, -52560],
                    [-21573, -50168],
                    [-6245, -47736],
                ],
            },
        ],
        tp: [
            {
                id: 1209,
                pos: [11121, -54242],
                name: "祀烟阁外近郊",
                icon: "T_Gp_Trans02",
            },
            {
                id: 1210,
                pos: [-10629, -52926],
                name: "椒兰村",
                icon: "T_Gp_Trans02",
            },
            {
                id: 1211,
                pos: [-32016, -50249],
                name: "椒兰村高处",
                icon: "T_Gp_Trans02",
            },
            {
                id: 1215,
                pos: [357, -76977],
                name: "西郊",
                icon: "T_Gp_Trans02",
            },
            {
                id: 8007,
                pos: [-7530, -50410],
                name: "灵鸟回声·扼守（椒兰村）",
                icon: "T_Gp_AreaCoop",
            },
            {
                id: 8008,
                pos: [13260, -83070],
                name: "灵鸟回声·避险（西郊）",
                icon: "T_Gp_AreaCoop",
            },
        ],
    },
    {
        id: 104505,
        rid: 1045,
        name: "东郊",
        desc: "UI_SUBREGION_DES_104505",
        map: "Huaxu_Haojing_Sub",
        pos: [71380, -67920],
        range: {
            center: [74240, -41970],
            extent: [27500, 1100],
            anchor: [71380, -67920],
        },
        rc: [
            {
                id: 9050401,
                info: [
                    {
                        id: 4091,
                        w: 133,
                    },
                    {
                        id: 4092,
                        w: 133,
                    },
                    {
                        id: 4093,
                        w: 67,
                    },
                    {
                        id: 4141,
                        w: 322,
                    },
                    {
                        id: 4142,
                        w: 322,
                    },
                    {
                        id: 4143,
                        w: 161,
                    },
                    {
                        id: 4041,
                        w: 752,
                    },
                    {
                        id: 4042,
                        w: 752,
                    },
                    {
                        id: 4043,
                        w: 376,
                    },
                    {
                        id: 4941,
                        w: 6981,
                    },
                ],
                count: 3,
                pos: [
                    [48835, -47591],
                    [60233, -56639],
                    [60963, -65044],
                    [69015, -79031],
                ],
            },
        ],
        tp: [
            {
                id: 1212,
                pos: [51349, -48304],
                name: "东郊",
                icon: "T_Gp_Trans02",
            },
            {
                id: 1213,
                pos: [68490, -73070],
                name: "东郊野外",
                icon: "T_Gp_Trans02",
            },
            {
                id: 1214,
                pos: [49903, -79459],
                name: "九章坪东侧",
                icon: "T_Gp_Trans02",
            },
            {
                id: 2827,
                pos: [48460, -42660],
                name: "东郊野外钓鱼点",
                icon: "T_Gp_Angling",
            },
            {
                id: 2841,
                pos: [55237, -54316],
                name: "由来巷",
                icon: "T_Gp_Youlaixiang",
            },
            {
                id: 8010,
                pos: [51400, -78340],
                name: "灵鸟回声·驱离（九章坪东侧）",
                icon: "T_Gp_AreaCoop",
            },
        ],
    },
    {
        id: 104506,
        rid: 1045,
        name: "执律阁",
        desc: "UI_SUBREGION_DES_104506",
        map: "Huaxu_Haojing_Top",
        pos: [31481, -105728],
        range: {
            center: [20670, -49970],
            extent: [82500, 82500],
        },
        tp: [
            {
                id: 1208,
                pos: [30099, -102626],
                name: "执律阁",
                icon: "T_Gp_Trans02",
            },
            {
                id: 2836,
                pos: [32830, -103270],
                name: "九章坪",
                icon: "T_Gp_Camera",
            },
            {
                id: 2839,
                pos: [31498, -109794],
                name: "太虚陵",
                icon: "T_Gp_Taixuling",
            },
            {
                id: 2844,
                pos: [31498, -107220],
                name: "内城",
                icon: "T_Gp_Zhilvge",
            },
        ],
    },
    {
        id: 104601,
        rid: 1046,
        name: "千枢狩阵",
        desc: "UI_SUBREGION_DES_104601",
        map: "Huaxu_Yanjindu_Batt02",
        pos: [60848, 25856],
        range: {
            center: [60848, 25856],
            extent: [0, 0],
        },
    },
    {
        id: 104701,
        rid: 1047,
        name: "千枢狩阵",
        desc: "UI_SUBREGION_DES_104701",
        map: "Huaxu_Yanjindu_Batt03",
    },
    {
        id: 104801,
        rid: 1048,
        name: "偃隐宫",
        desc: "UI_SUBREGION_DES_104801",
        map: "Huaxu_Haojing_YYG",
        pos: [35136, -41188],
        range: {
            center: [15150, 17085],
            extent: [137500, 137500],
            anchor: [35136, -41188],
        },
    },
    {
        id: 104901,
        rid: 1049,
        name: "潜龙居",
        desc: "UI_SUBREGION_DES_104901",
        map: "Huaxu_Yanjindu_Off",
        pos: [-25360, 6862],
        range: {
            center: [-25360, 6862],
            extent: [0, 0],
        },
    },
    {
        id: 105001,
        rid: 1050,
        name: "往隙",
        desc: "UI_SUBREGION_DES_105001",
        map: "Huaxu_Yanjindu_Nai03",
    },
    {
        id: 105101,
        rid: 1051,
        name: "执律阁内",
        desc: "测试区域",
        map: "Huaxu_Haojing_Int",
        pos: [15, -2450],
        range: {
            center: [-35, -2430],
            extent: [6298, 4208],
            anchor: [15, -2450],
        },
    },
    {
        id: 105201,
        rid: 1052,
        name: "山外山",
        desc: "测试区域",
        map: "Huaxu_Haojing_Reb",
        pos: [7480, -3300],
        range: {
            center: [5820, -7930],
            extent: [50696, 54656],
            anchor: [7480, -3300],
        },
        rc: [
            {
                id: 9050601,
                info: [
                    {
                        id: 4131,
                        w: 333,
                    },
                    {
                        id: 4132,
                        w: 333,
                    },
                    {
                        id: 4133,
                        w: 167,
                    },
                    {
                        id: 4031,
                        w: 778,
                    },
                    {
                        id: 4032,
                        w: 778,
                    },
                    {
                        id: 4033,
                        w: 389,
                    },
                    {
                        id: 4941,
                        w: 7222,
                    },
                ],
                count: 3,
                pos: [
                    [2837, 2727],
                    [3270, 15595],
                    [9251, 9284],
                    [17209, 2542],
                ],
            },
        ],
        tp: [
            {
                id: 1300,
                pos: [4566, 14347],
                name: "山外山入口",
                icon: "T_Gp_Trans02",
            },
            {
                id: 1301,
                pos: [-4131, -5517],
                name: "山外山深处",
                icon: "T_Gp_Trans02",
            },
            {
                id: 2838,
                pos: [-5003, 14586],
                name: "西城",
                icon: "T_Gp_Haojing",
            },
            {
                id: 8011,
                pos: [12183, 6856],
                name: "灵鸟回声·扼守（山外山）",
                icon: "T_Gp_AreaCoop",
            },
        ],
    },
    {
        id: 105301,
        rid: 1053,
        name: "太虚陵",
        desc: "测试区域",
        map: "Huaxu_Haojing_TRLM",
        pos: [15602, 23586],
        range: {
            center: [24750, 23410],
            extent: [55000, 27500],
        },
        tp: [
            {
                id: 1400,
                pos: [-12512, 23717],
                name: "太虚陵",
                icon: "T_Gp_Trans02",
            },
            {
                id: 9005,
                pos: [43715, 23455],
                name: "太皓与烛阴",
                icon: "T_Gp_Boss",
            },
        ],
    },
    {
        id: 105401,
        rid: 1054,
        name: "？？？",
        desc: "测试区域",
        map: "Huaxu_Haojing_TXJ",
    },
    {
        id: 105501,
        rid: 1055,
        name: "由来巷",
        desc: "测试区域",
        map: "Huaxu_Haojing_YLX",
        pos: [16130, 1570],
        range: {
            center: [16050, 1925],
            extent: [13750, 13750],
            anchor: [16130, 1570],
        },
        rc: [
            {
                id: 9050701,
                info: [
                    {
                        id: 4071,
                        w: 133,
                    },
                    {
                        id: 4072,
                        w: 133,
                    },
                    {
                        id: 4073,
                        w: 67,
                    },
                    {
                        id: 4111,
                        w: 322,
                    },
                    {
                        id: 4112,
                        w: 322,
                    },
                    {
                        id: 4113,
                        w: 161,
                    },
                    {
                        id: 4011,
                        w: 752,
                    },
                    {
                        id: 4012,
                        w: 752,
                    },
                    {
                        id: 4013,
                        w: 376,
                    },
                    {
                        id: 4941,
                        w: 6981,
                    },
                ],
                count: 3,
                pos: [
                    [17568, 5148],
                    [21108, 2070],
                    [16793, -1760],
                    [13608, 1676],
                ],
            },
        ],
        tp: [
            {
                id: 1500,
                pos: [17560, 3410],
                name: "由来巷",
                icon: "T_Gp_Trans02",
            },
            {
                id: 2829,
                pos: [16680, -3400],
                name: "由来巷钓鱼点",
                icon: "T_Gp_Angling",
            },
            {
                id: 2842,
                pos: [15355, 4565],
                name: "东郊",
                icon: "T_Gp_Haojing",
            },
            {
                id: 2843,
                pos: [14316, 3500],
                name: "内城",
                icon: "T_Gp_Haojing",
            },
            {
                id: 8012,
                pos: [13326, 831],
                name: "灵鸟回声·避险（由来巷）",
                icon: "T_Gp_AreaCoop",
            },
        ],
    },
    {
        id: 105601,
        rid: 1056,
        name: "？？？",
        desc: "测试区域",
        map: "Huaxu_Haojing_ZhiliuHJ_Door",
        pos: [49110, -420],
        range: {
            center: [49700, -440],
            extent: [16500, 16500],
            anchor: [49110, -420],
        },
    },
    {
        id: 105602,
        rid: 1056,
        name: "？？？",
        desc: "测试区域",
        map: "Huaxu_Haojing_ZhiliuHJ_Talk",
        range: {
            center: [0, 0],
            extent: [16500, 16500],
        },
    },
    {
        id: 105701,
        rid: 1057,
        name: "烛阴祭坛",
        desc: "UI_SUBREGION_DES_105701",
        map: "Huaxu_Yanjindu_Alt",
        pos: [10608, -61626],
        range: {
            center: [6000, -42000],
            extent: [6600, 6600],
        },
        tp: [
            {
                id: 1113,
                pos: [10608, -61626],
                name: "烛阴祭坛",
                icon: "T_Gp_Trans03",
            },
        ],
    },
    {
        id: 105801,
        rid: 1058,
        name: "UI_SUBREGION_NAME_105801",
        desc: "UI_SUBREGION_DES_105801",
        map: "Huaxu_Yanjindu_Stealth",
    },
    {
        id: 105901,
        rid: 1059,
        name: "UI_SUBREGION_NAME_105901",
        desc: "UI_SUBREGION_DES_105901",
        map: "Huaxu_Haojing_Batt04",
    },
    {
        id: 106001,
        rid: 1060,
        name: "站前穹顶",
        desc: "站前穹顶",
        map: "Haiboliya_Chezhan_BHCZ",
        pos: [-59830, 5580],
        range: {
            center: [-30200, 5350],
            extent: [55000, 19683],
            anchor: [-59830, 5580],
        },
        rc: [
            {
                id: 9060101,
                info: [
                    {
                        id: 4131,
                        w: 333,
                    },
                    {
                        id: 4132,
                        w: 333,
                    },
                    {
                        id: 4133,
                        w: 167,
                    },
                    {
                        id: 4031,
                        w: 778,
                    },
                    {
                        id: 4032,
                        w: 778,
                    },
                    {
                        id: 4033,
                        w: 389,
                    },
                    {
                        id: 4911,
                        w: 903,
                    },
                    {
                        id: 4912,
                        w: 903,
                    },
                    {
                        id: 4913,
                        w: 903,
                    },
                    {
                        id: 4921,
                        w: 903,
                    },
                    {
                        id: 4922,
                        w: 903,
                    },
                    {
                        id: 4923,
                        w: 903,
                    },
                    {
                        id: 4931,
                        w: 903,
                    },
                    {
                        id: 4932,
                        w: 903,
                    },
                ],
                count: 2,
                pos: [
                    [-4192, -4117],
                    [-12553, 4591],
                    [-1935, 3244],
                ],
            },
            {
                id: 9060104,
                info: [
                    {
                        id: 4111,
                        w: 333,
                    },
                    {
                        id: 4112,
                        w: 333,
                    },
                    {
                        id: 4113,
                        w: 167,
                    },
                    {
                        id: 4011,
                        w: 778,
                    },
                    {
                        id: 4012,
                        w: 778,
                    },
                    {
                        id: 4013,
                        w: 389,
                    },
                    {
                        id: 4911,
                        w: 903,
                    },
                    {
                        id: 4912,
                        w: 903,
                    },
                    {
                        id: 4913,
                        w: 903,
                    },
                    {
                        id: 4921,
                        w: 903,
                    },
                    {
                        id: 4922,
                        w: 903,
                    },
                    {
                        id: 4923,
                        w: 903,
                    },
                    {
                        id: 4931,
                        w: 903,
                    },
                    {
                        id: 4932,
                        w: 903,
                    },
                ],
                count: 3,
                pos: [
                    [-40754, -5055],
                    [-24073, 5149],
                    [-36152, 8518],
                    [-35928, 18719],
                    [-25554, 8725],
                ],
            },
            {
                id: 9060105,
                info: [
                    {
                        id: 4151,
                        w: 333,
                    },
                    {
                        id: 4152,
                        w: 333,
                    },
                    {
                        id: 4153,
                        w: 167,
                    },
                    {
                        id: 4051,
                        w: 778,
                    },
                    {
                        id: 4052,
                        w: 778,
                    },
                    {
                        id: 4053,
                        w: 389,
                    },
                    {
                        id: 4911,
                        w: 903,
                    },
                    {
                        id: 4912,
                        w: 903,
                    },
                    {
                        id: 4913,
                        w: 903,
                    },
                    {
                        id: 4921,
                        w: 903,
                    },
                    {
                        id: 4922,
                        w: 903,
                    },
                    {
                        id: 4923,
                        w: 903,
                    },
                    {
                        id: 4931,
                        w: 903,
                    },
                    {
                        id: 4932,
                        w: 903,
                    },
                ],
                count: 2,
                pos: [
                    [-47625, 3699],
                    [-55969, -876],
                    [-69789, -3048],
                ],
            },
            {
                id: 9060106,
                info: [
                    {
                        id: 4121,
                        w: 333,
                    },
                    {
                        id: 4122,
                        w: 333,
                    },
                    {
                        id: 4123,
                        w: 167,
                    },
                    {
                        id: 4021,
                        w: 778,
                    },
                    {
                        id: 4022,
                        w: 778,
                    },
                    {
                        id: 4023,
                        w: 389,
                    },
                    {
                        id: 4911,
                        w: 903,
                    },
                    {
                        id: 4912,
                        w: 903,
                    },
                    {
                        id: 4913,
                        w: 903,
                    },
                    {
                        id: 4921,
                        w: 903,
                    },
                    {
                        id: 4922,
                        w: 903,
                    },
                    {
                        id: 4923,
                        w: 903,
                    },
                    {
                        id: 4931,
                        w: 903,
                    },
                    {
                        id: 4932,
                        w: 903,
                    },
                ],
                count: 2,
                pos: [
                    [-76046, 4050],
                    [-87583, 9931],
                    [-82028, -6223],
                ],
            },
        ],
        tp: [
            {
                id: 1600,
                pos: [3648, -730],
                name: "站前穹顶",
                icon: "T_Gp_Trans03",
            },
            {
                id: 2016,
                pos: [4354, 10],
                name: "冰湖城外围",
                icon: "T_Gp_IceLake",
            },
            {
                id: 1603,
                pos: [-67579, -2776],
                name: "站外空地",
                icon: "T_Gp_Trans02",
            },
            {
                id: 9006,
                pos: [-35538, -3201],
                name: "极光号主炮",
                icon: "T_Gp_Boss",
            },
            {
                id: 2017,
                pos: [-6503, 6478],
                name: "锻铁厂下层",
                icon: "T_Gp_Leave",
            },
            {
                id: 2019,
                pos: [-17163, 4858],
                name: "地下轨道",
                icon: "T_Gp_Leave",
            },
            {
                id: 2023,
                pos: [-38432, -6902],
                name: "地下轨道",
                icon: "T_Gp_Leave",
            },
            {
                id: 2854,
                pos: [-79430, -3180],
                name: "百花车站钓鱼点",
                icon: "T_Gp_Angling",
            },
            {
                id: 2504,
                pos: [-7950, 0],
                name: "集结",
                icon: "T_Gp_Gathering",
            },
            {
                id: 2855,
                pos: [-18687, 2],
                name: "黄金旅途·魔灵竞速",
                icon: "T_Gp_Racing",
            },
            {
                id: 2858,
                pos: [-4552, 15],
                name: "站前穹顶",
                icon: "T_Gp_Camera",
            },
            {
                id: 2859,
                pos: [-42679, -1136],
                name: "站外空地",
                icon: "T_Gp_Camera",
            },
        ],
    },
    {
        id: 106101,
        rid: 1061,
        name: "科赛托斯省南部",
        desc: "科赛托斯省南部",
        map: "Haiboliya_Chezhan_YW01",
        pos: [256516, 1003],
        range: {
            center: [251190, -25600],
            extent: [55000, 75795],
            anchor: [256516, 1003],
        },
    },
    {
        id: 106201,
        rid: 1062,
        name: "？？？",
        desc: "？？？",
        map: "Haiboliya_Chezhan_MT",
    },
    {
        id: 106301,
        rid: 1063,
        name: "锻铁厂下层",
        desc: "锻铁厂下层",
        map: "Haiboliya_Chezhan_CZDX",
        pos: [-12286, 15662],
        range: {
            center: [-30200, 5350],
            extent: [55000, 19683],
            anchor: [-12286, 15662],
        },
        rc: [
            {
                id: 9060102,
                info: [
                    {
                        id: 4091,
                        w: 133,
                    },
                    {
                        id: 4092,
                        w: 133,
                    },
                    {
                        id: 4093,
                        w: 67,
                    },
                    {
                        id: 4141,
                        w: 322,
                    },
                    {
                        id: 4142,
                        w: 322,
                    },
                    {
                        id: 4143,
                        w: 161,
                    },
                    {
                        id: 4041,
                        w: 752,
                    },
                    {
                        id: 4042,
                        w: 752,
                    },
                    {
                        id: 4043,
                        w: 376,
                    },
                    {
                        id: 4911,
                        w: 903,
                    },
                    {
                        id: 4912,
                        w: 903,
                    },
                    {
                        id: 4913,
                        w: 903,
                    },
                    {
                        id: 4921,
                        w: 903,
                    },
                    {
                        id: 4922,
                        w: 903,
                    },
                    {
                        id: 4923,
                        w: 903,
                    },
                ],
                count: 3,
                pos: [
                    [-12090, 214],
                    [-13141, 7355],
                    [-13141, 5404],
                    [-16387, 4586],
                    [-18480, 7668],
                ],
            },
            {
                id: 9060103,
                info: [
                    {
                        id: 4161,
                        w: 333,
                    },
                    {
                        id: 4162,
                        w: 333,
                    },
                    {
                        id: 4163,
                        w: 167,
                    },
                    {
                        id: 4061,
                        w: 778,
                    },
                    {
                        id: 4062,
                        w: 778,
                    },
                    {
                        id: 4063,
                        w: 389,
                    },
                    {
                        id: 4911,
                        w: 903,
                    },
                    {
                        id: 4912,
                        w: 903,
                    },
                    {
                        id: 4913,
                        w: 903,
                    },
                    {
                        id: 4921,
                        w: 903,
                    },
                    {
                        id: 4922,
                        w: 903,
                    },
                    {
                        id: 4923,
                        w: 903,
                    },
                    {
                        id: 4931,
                        w: 903,
                    },
                    {
                        id: 4932,
                        w: 903,
                    },
                ],
                count: 3,
                pos: [
                    [-13418, 15478],
                    [-9563, 9398],
                    [-10582, 15931],
                    [-8474, 14023],
                ],
            },
        ],
        tp: [
            {
                id: 1601,
                pos: [-6737, 6675],
                name: "锻铁厂",
                icon: "T_Gp_Trans03",
            },
            {
                id: 1602,
                pos: [-17726, 5550],
                name: "地下轨道",
                icon: "T_Gp_Trans03",
            },
            {
                id: 2021,
                pos: [-4983, 6458],
                name: "站前穹顶",
                icon: "T_Gp_Leave",
            },
            {
                id: 2018,
                pos: [-16222, 4887],
                name: "锻铁厂上层",
                icon: "T_Gp_Leave",
            },
            {
                id: 2022,
                pos: [-17332, 4867],
                name: "站前穹顶",
                icon: "T_Gp_Leave",
            },
            {
                id: 2020,
                pos: [-38472, -6892],
                name: "站厅",
                icon: "T_Gp_Leave",
            },
            {
                id: 2860,
                pos: [-13366, 8034],
                name: "锻铁厂",
                icon: "T_Gp_Camera",
            },
        ],
    },
    {
        id: 107001,
        rid: 1070,
        name: "阿尔卡诺山",
        desc: "UI_SUBREGION_DES_107001",
        map: "Haiboliya_Thc_Lxzs01",
        pos: [-20078, -79259],
        range: {
            center: [-20078, -79259],
            extent: [0, 0],
        },
        rc: [
            {
                id: 9080101,
                info: [
                    {
                        id: 4131,
                        w: 333,
                    },
                    {
                        id: 4132,
                        w: 333,
                    },
                    {
                        id: 4133,
                        w: 167,
                    },
                    {
                        id: 4031,
                        w: 778,
                    },
                    {
                        id: 4032,
                        w: 778,
                    },
                    {
                        id: 4033,
                        w: 389,
                    },
                    {
                        id: 4911,
                        w: 903,
                    },
                    {
                        id: 4912,
                        w: 903,
                    },
                    {
                        id: 4913,
                        w: 903,
                    },
                    {
                        id: 4921,
                        w: 903,
                    },
                    {
                        id: 4922,
                        w: 903,
                    },
                    {
                        id: 4923,
                        w: 903,
                    },
                    {
                        id: 4931,
                        w: 903,
                    },
                    {
                        id: 4932,
                        w: 903,
                    },
                ],
                count: 2,
                pos: [
                    [-17410, -68610],
                    [-9510, -75970],
                    [-34800, -82210],
                ],
            },
            {
                id: 9080102,
                info: [
                    {
                        id: 4081,
                        w: 133,
                    },
                    {
                        id: 4082,
                        w: 133,
                    },
                    {
                        id: 4083,
                        w: 67,
                    },
                    {
                        id: 4151,
                        w: 322,
                    },
                    {
                        id: 4152,
                        w: 322,
                    },
                    {
                        id: 4153,
                        w: 161,
                    },
                    {
                        id: 4051,
                        w: 752,
                    },
                    {
                        id: 4052,
                        w: 752,
                    },
                    {
                        id: 4053,
                        w: 376,
                    },
                    {
                        id: 4932,
                        w: 6981,
                    },
                ],
                count: 3,
                pos: [
                    [-3980, -21020],
                    [-4760, -24620],
                    [-11710, -70790],
                    [-18560, -83340],
                ],
            },
            {
                id: 9080103,
                info: [
                    {
                        id: 4121,
                        w: 333,
                    },
                    {
                        id: 4122,
                        w: 333,
                    },
                    {
                        id: 4123,
                        w: 167,
                    },
                    {
                        id: 4021,
                        w: 778,
                    },
                    {
                        id: 4022,
                        w: 778,
                    },
                    {
                        id: 4023,
                        w: 389,
                    },
                    {
                        id: 4911,
                        w: 903,
                    },
                    {
                        id: 4912,
                        w: 903,
                    },
                    {
                        id: 4913,
                        w: 903,
                    },
                    {
                        id: 4921,
                        w: 903,
                    },
                    {
                        id: 4922,
                        w: 903,
                    },
                    {
                        id: 4923,
                        w: 903,
                    },
                    {
                        id: 4931,
                        w: 903,
                    },
                    {
                        id: 4932,
                        w: 903,
                    },
                ],
                count: 2,
                pos: [
                    [9310, -35660],
                    [4120, -30230],
                    [-11020, -85730],
                ],
            },
        ],
        tp: [
            {
                id: 1700,
                pos: [4740, -4868],
                name: "阿尔卡诺山入口",
                icon: "T_Gp_Trans02",
            },
            {
                id: 1701,
                pos: [7613, -39897],
                name: "山中密林",
                icon: "T_Gp_Trans02",
            },
            {
                id: 1702,
                pos: [-21821, -76669],
                name: "乐园镇",
                icon: "T_Gp_Trans02",
            },
            {
                id: 2505,
                pos: [-19450, -78420],
                name: "集结",
                icon: "T_Gp_Gathering",
            },
            {
                id: 2024,
                pos: [-11100, -29528],
                name: "阿尔卡诺镇旧址",
                icon: "T_Gp_EX02_LXZS",
            },
            {
                id: 2025,
                pos: [-29933, -58905],
                name: "阿尔卡诺镇旧址",
                icon: "T_Gp_EX02_LXZS",
            },
            {
                id: 2030,
                pos: [-20847, -88214],
                name: "酣梦池",
                icon: "T_Gp_EX02_JHS",
            },
            {
                id: 2028,
                pos: [-21304, -65937],
                name: "山谷裂隙",
                icon: "T_Gp_EX02_LXZX",
            },
            {
                id: 2856,
                pos: [-34129, -71879],
                name: "乐园镇钓鱼点",
                icon: "T_Gp_Angling",
            },
            {
                id: 2031,
                pos: [-6624, -75596],
                name: "维克托的家",
                icon: "T_Gp_EX02_ZZJ",
            },
            {
                id: 2862,
                pos: [-11900, -74820],
                name: "乐园镇",
                icon: "T_Gp_Camera",
            },
            {
                id: 2863,
                pos: [-21510, -76030],
                name: "乐园镇",
                icon: "T_Gp_Camera",
            },
        ],
    },
    {
        id: 107101,
        rid: 1071,
        name: "阿尔卡诺镇旧址",
        desc: "UI_SUBREGION_DES_107101",
        map: "Haiboliya_Thc_Lxzs02",
        pos: [-36840, -34639],
        rc: [
            {
                id: 9080104,
                info: [
                    {
                        id: 4161,
                        w: 333,
                    },
                    {
                        id: 4162,
                        w: 333,
                    },
                    {
                        id: 4163,
                        w: 167,
                    },
                    {
                        id: 4061,
                        w: 778,
                    },
                    {
                        id: 4062,
                        w: 778,
                    },
                    {
                        id: 4063,
                        w: 389,
                    },
                    {
                        id: 4932,
                        w: 7222,
                    },
                ],
                count: 2,
                pos: [
                    [-27030, -32760],
                    [-36310, -19310],
                    [-61490, -10750],
                ],
            },
            {
                id: 9080105,
                info: [
                    {
                        id: 4071,
                        w: 133,
                    },
                    {
                        id: 4072,
                        w: 133,
                    },
                    {
                        id: 4073,
                        w: 67,
                    },
                    {
                        id: 4141,
                        w: 322,
                    },
                    {
                        id: 4142,
                        w: 322,
                    },
                    {
                        id: 4143,
                        w: 161,
                    },
                    {
                        id: 4041,
                        w: 752,
                    },
                    {
                        id: 4042,
                        w: 752,
                    },
                    {
                        id: 4043,
                        w: 376,
                    },
                    {
                        id: 4932,
                        w: 6981,
                    },
                ],
                count: 2,
                pos: [
                    [-61080, -47270],
                    [-66120, -56220],
                    [-30570, -20550],
                    [-23840, -32620],
                ],
            },
        ],
        tp: [
            {
                id: 1705,
                pos: [-20624, -30522],
                name: "废墟游乐场",
                icon: "T_Gp_Trans02",
            },
            {
                id: 1703,
                pos: [-49721, -51971],
                name: "吊桥",
                icon: "T_Gp_Trans02",
            },
            {
                id: 1704,
                pos: [-53967, -19890],
                name: "焦土地",
                icon: "T_Gp_Trans02",
            },
            {
                id: 2026,
                pos: [-18788, -33285],
                name: "阿尔卡诺山",
                icon: "T_Gp_EX02_LXZS",
            },
            {
                id: 2027,
                pos: [-45563, -54903],
                name: "阿尔卡诺山",
                icon: "T_Gp_EX02_LXZS",
            },
            {
                id: 2861,
                pos: [-25203, -29482],
                name: "废墟游乐场",
                icon: "T_Gp_Camera",
            },
            {
                id: 9007,
                pos: [-44015, -22422],
                name: "",
                icon: "T_Gp_Boss",
            },
        ],
    },
    {
        id: 107201,
        rid: 1072,
        name: "山谷裂隙",
        desc: "UI_SUBREGION_DES_107201",
        map: "Haiboliya_Thc_Lxzx",
        pos: [-63630, -21235],
        range: {
            center: [-63630, -21235],
            extent: [0, 0],
        },
        rc: [
            {
                id: 9080106,
                info: [
                    {
                        id: 4111,
                        w: 333,
                    },
                    {
                        id: 4112,
                        w: 333,
                    },
                    {
                        id: 4113,
                        w: 167,
                    },
                    {
                        id: 4011,
                        w: 778,
                    },
                    {
                        id: 4012,
                        w: 778,
                    },
                    {
                        id: 4013,
                        w: 389,
                    },
                    {
                        id: 4911,
                        w: 903,
                    },
                    {
                        id: 4912,
                        w: 903,
                    },
                    {
                        id: 4913,
                        w: 903,
                    },
                    {
                        id: 4921,
                        w: 903,
                    },
                    {
                        id: 4922,
                        w: 903,
                    },
                    {
                        id: 4923,
                        w: 903,
                    },
                    {
                        id: 4931,
                        w: 903,
                    },
                    {
                        id: 4932,
                        w: 903,
                    },
                ],
                count: 3,
                pos: [
                    [19910, 160],
                    [-1610, -15890],
                    [11860, -17670],
                    [16870, -63510],
                    [-52700, -22150],
                ],
            },
        ],
        tp: [
            {
                id: 1706,
                pos: [-76640, -27516],
                name: "山谷裂隙",
                icon: "T_Gp_Trans02",
            },
            {
                id: 1707,
                pos: [-33285, -14447],
                name: "污染湖泊",
                icon: "T_Gp_Trans02",
            },
            {
                id: 1708,
                pos: [6900, -74208],
                name: "湖边营地",
                icon: "T_Gp_Trans02",
            },
            {
                id: 2029,
                pos: [24821, -80946],
                name: "阿尔卡诺山",
                icon: "T_Gp_EX02_LXZS",
            },
            {
                id: 2857,
                pos: [18735, -61739],
                name: "阿尔卡诺山裂隙钓鱼点",
                icon: "T_Gp_Angling",
            },
            {
                id: 2864,
                pos: [-33280, -12150],
                name: "山谷裂隙",
                icon: "T_Gp_Camera",
            },
        ],
    },
    {
        id: 107301,
        rid: 1073,
        name: "？？？",
        desc: "UI_SUBREGION_DES_107301",
        map: "Haiboliya_Thc_Emyly",
        pos: [-44555, -27139],
    },
    {
        id: 107401,
        rid: 1074,
        name: "龙莎要塞",
        desc: "UI_SUBREGION_DES_107401",
        map: "Haiboliya_Thc_Zchj",
    },
    {
        id: 107501,
        rid: 1075,
        name: "维克托的家",
        desc: "UI_SUBREGION_DES_107501",
        map: "Haiboliya_Thc_Zjfj",
        pos: [10810, -92220],
    },
    {
        id: 107601,
        rid: 1076,
        name: "失控的乐园",
        desc: "UI_SUBREGION_DES_107601",
        map: "Haiboliya_Thc_Boss",
    },
    {
        id: 107701,
        rid: 1077,
        name: "酣梦池",
        desc: "UI_SUBREGION_DES_107701",
        map: "Haiboliya_Thc_Jhs",
        pos: [-6292, -89233],
    },
    {
        id: 107801,
        rid: 1078,
        name: "乐园镇",
        desc: "UI_SUBREGION_DES_107801",
        map: "Haiboliya_Thc_Ck",
    },
    {
        id: 108101,
        rid: 1081,
        name: "",
        desc: "",
        map: "Ailixian_SLF",
    },
    {
        id: 108201,
        rid: 1082,
        name: "",
        desc: "",
        map: "Ailixian_Miandao",
    },
    {
        id: 108301,
        rid: 1083,
        name: "",
        desc: "",
        map: "Ailixian_LLKWon",
    },
    {
        id: 108401,
        rid: 1084,
        name: "",
        desc: "",
        map: "Ailixian_Miandao_Yyhf",
    },
    {
        id: 108501,
        rid: 1085,
        name: "",
        desc: "",
        map: "Ailixian_Yidai_Boss",
    },
    {
        id: 109001,
        rid: 1090,
        name: "",
        desc: "",
        map: "Ailixian_Chenmian",
    },
    {
        id: 109101,
        rid: 1091,
        name: "",
        desc: "",
        map: "Ailixian_Shendianfeixu",
    },
    {
        id: 109201,
        rid: 1092,
        name: "",
        desc: "",
        map: "Ailixian_Manyue",
    },
    {
        id: 109301,
        rid: 1093,
        name: "",
        desc: "",
        map: "Ailixian_Anzhixin",
    },
    {
        id: 109401,
        rid: 1094,
        name: "",
        desc: "",
        map: "Ailixian_LizibeierHJ",
    },
    {
        id: 200101,
        rid: 2001,
        name: "UI_SUBREGION_NAME_200101",
        desc: "UI_SUBREGION_DES_200101",
        map: "Invite_Yeer",
        pos: [0, 70],
    },
    {
        id: 210101,
        rid: 2101,
        name: "休憩之所",
        desc: "休憩之所描述",
        map: "HomeBase",
        pos: [-52, 3756],
    },
    {
        id: 300101,
        rid: 3001,
        name: "UI_SUBREGION_NAME_300101",
        desc: "UI_SUBREGION_DES_300101",
        map: "Guild",
        rc: [
            {
                id: 9070101,
                info: [
                    {
                        id: 4131,
                        w: 333,
                    },
                    {
                        id: 4132,
                        w: 333,
                    },
                    {
                        id: 4133,
                        w: 167,
                    },
                    {
                        id: 4031,
                        w: 778,
                    },
                    {
                        id: 4032,
                        w: 778,
                    },
                    {
                        id: 4033,
                        w: 389,
                    },
                    {
                        id: 4911,
                        w: 903,
                    },
                    {
                        id: 4912,
                        w: 903,
                    },
                    {
                        id: 4913,
                        w: 903,
                    },
                    {
                        id: 4921,
                        w: 903,
                    },
                    {
                        id: 4922,
                        w: 903,
                    },
                    {
                        id: 4923,
                        w: 903,
                    },
                    {
                        id: 4931,
                        w: 903,
                    },
                    {
                        id: 4932,
                        w: 903,
                    },
                ],
                count: 2,
                pos: [
                    [-200, -1300],
                    [1900, -190],
                    [1110, -1140],
                ],
            },
            {
                id: 9070102,
                info: [
                    {
                        id: 4071,
                        w: 133,
                    },
                    {
                        id: 4072,
                        w: 133,
                    },
                    {
                        id: 4073,
                        w: 67,
                    },
                    {
                        id: 4111,
                        w: 322,
                    },
                    {
                        id: 4112,
                        w: 322,
                    },
                    {
                        id: 4113,
                        w: 161,
                    },
                    {
                        id: 4011,
                        w: 752,
                    },
                    {
                        id: 4012,
                        w: 752,
                    },
                    {
                        id: 4013,
                        w: 376,
                    },
                    {
                        id: 4941,
                        w: 6981,
                    },
                ],
                count: 2,
                pos: [
                    [-9810, 8890],
                    [-10580, 7280],
                    [-10130, 5450],
                ],
            },
        ],
    },
    {
        id: 300201,
        rid: 3002,
        name: "测试公会领地",
        desc: "测试公会领地",
        map: "TestGuild",
    },
    {
        id: 999701,
        rid: 9997,
        name: "区域性能测试场景",
        desc: "区域性能测试场景",
        map: "RegionProfTest",
        pos: [-722, -10680],
        tp: [
            {
                id: 101,
                pos: [7173, 3028],
                name: "核心1",
                icon: "T_Gp_Trans02",
            },
            {
                id: 102,
                pos: [7874, 1050],
                name: "核心2",
                icon: "T_Gp_Trans02",
            },
            {
                id: 103,
                pos: [9204, -17364],
                name: "斜坡",
                icon: "T_Gp_Trans02",
            },
            {
                id: 104,
                pos: [-18292, -52533],
                name: "绿色独立联机区域",
                icon: "T_Gp_Trans02",
            },
            {
                id: 105,
                pos: [3584, 510],
                name: "电梯上",
                icon: "T_Gp_Trans02",
            },
            {
                id: 106,
                pos: [-1806, 7080],
                name: "山上",
                icon: "T_Gp_Trans02",
            },
            {
                id: 107,
                pos: [-22066, -21810],
                name: "彩色独立联机区域",
                icon: "T_Gp_Trans02",
            },
            {
                id: 108,
                pos: [8554, -5400],
                name: "钓鱼点",
                icon: "T_Gp_Trans02",
            },
        ],
    },
    {
        id: 999801,
        rid: 9998,
        name: "特殊任务测试区域",
        desc: "特殊任务测试区域",
        map: "TestSpecialQuest",
    },
    {
        id: 999901,
        rid: 9999,
        name: "测试区域入口",
        desc: "测试区域入口",
        map: "BattleTest_Enter",
    },
    {
        id: 999902,
        rid: 9999,
        name: "测试区域通路",
        desc: "测试区域通路",
        map: "BattleTest_Road",
    },
    {
        id: 999903,
        rid: 9999,
        name: "测试区域出口",
        desc: "测试区域出口",
        map: "BattleTest_Exit",
    },
]

export const subRegionMap = subRegionData.reduce((acc, cur) => {
    acc.set(cur.id, cur)
    return acc
}, new Map<number, SubRegion>())

export default subRegionData
