import type { Char } from "./data-types"

const t = [
    {
        id: 1101,
        icon: "Heitao",
        名称: "贝蕾妮卡",
        版本: "1.0",
        别名: "确定的明天",
        阵营: "夜航者小队",
        属性: "暗",
        精通: ["单手剑", "双枪"],
        标签: ["输出", "同律武器", "武器伤害"],
        基础攻击: 20,
        基础生命: 100,
        基础防御: 300,
        基础护盾: 100,
        基础神智: 150,
        加成: {
            攻击: 0.5,
            技能效益: 0.125,
        },
        技能: [
            {
                id: 110101,
                名称: "残光",
                类型: "伤害",
                描述: "向前突进，沿途造成4次暗属性范围伤害。",
                字段: {
                    神智消耗: {
                        影响: "技能效益",
                        值: 20,
                        格式: "{}",
                    },
                    伤害: {
                        影响: "技能威力",
                        值: [3.47, 4.24, 5.01, 5.78, 6.55, 7.32, 8.09, 8.86, 9.63, 10.4, 11.17, 11.94],
                    },
                    伤害半径: {
                        影响: "技能范围",
                        值: 3,
                        格式: "{}米",
                    },
                },
            },
            {
                id: 110102,
                名称: "冥焰",
                类型: "增益",
                描述: "将近战武器切换为[伊弥尔]并释放1道剑气，使用[伊弥尔]普通攻击时会朝攻击方向释放剑气。\n使用[伊弥尔]期间，自身受到伤害时不会产生僵直并持续消耗神智，神智下降为0或再次使用此技能时收回[伊弥尔]。",
                字段: {
                    神智消耗: {
                        影响: "技能效益",
                        值: 10,
                        格式: "{}",
                    },
                    每秒神智消耗: {
                        影响: "技能效益,技能耐久",
                        值: 30,
                        格式: "{}",
                    },
                    一段伤害: {
                        影响: "技能威力",
                        值: [0.19, 0.21, 0.23, 0.25, 0.27, 0.29, 0.31, 0.33, 0.35, 0.37, 0.39, 0.41],
                    },
                    二段伤害: {
                        影响: "技能威力",
                        值: [0.2, 0.23, 0.26, 0.29, 0.32, 0.35, 0.38, 0.41, 0.44, 0.47, 0.5, 0.53],
                    },
                    三段伤害: {
                        影响: "技能威力",
                        值: [0.26, 0.29, 0.32, 0.35, 0.38, 0.41, 0.44, 0.47, 0.5, 0.53, 0.56, 0.59],
                    },
                    四段伤害: {
                        影响: "技能威力",
                        值: [0.35, 0.39, 0.43, 0.47, 0.51, 0.55, 0.59, 0.63, 0.67, 0.71, 0.75, 0.79],
                    },
                    五段伤害: {
                        影响: "技能威力",
                        值: [0.42, 0.46, 0.5, 0.54, 0.58, 0.62, 0.66, 0.7, 0.74, 0.78, 0.82, 0.86],
                    },
                    连段伤害半径: {
                        影响: "技能范围",
                        值: 3,
                        格式: "{}米",
                    },
                    蓄力攻击伤害: {
                        值: 1.13,
                    },
                    滑行攻击伤害: {
                        值: 0.51,
                    },
                    一段剑气伤害: {
                        影响: "技能威力",
                        值: [2.09, 2.32, 2.55, 2.78, 3.01, 3.24, 3.47, 3.7, 3.93, 4.16, 4.39, 4.62],
                    },
                    二段剑气伤害: {
                        影响: "技能威力",
                        值: [2.59, 2.88, 3.17, 3.46, 3.75, 4.04, 4.33, 4.62, 4.91, 5.2, 5.49, 5.78],
                    },
                    三段剑气伤害: {
                        影响: "技能威力",
                        值: [2.91, 3.24, 3.57, 3.9, 4.23, 4.56, 4.89, 5.22, 5.55, 5.88, 6.21, 6.54],
                    },
                    四段剑气伤害: {
                        影响: "技能威力",
                        值: [4, 4.44, 4.88, 5.32, 5.76, 6.2, 6.64, 7.08, 7.52, 7.96, 8.4, 8.84],
                    },
                    五段剑气伤害: {
                        影响: "技能威力",
                        值: [4.34, 4.82, 5.3, 5.78, 6.26, 6.74, 7.22, 7.7, 8.18, 8.66, 9.14, 9.62],
                    },
                    技能开启剑气伤害: {
                        影响: "技能威力",
                        值: [2.09, 2.32, 2.55, 2.78, 3.01, 3.24, 3.47, 3.7, 3.93, 4.16, 4.39, 4.62],
                    },
                    剑气宽度: {
                        影响: "技能范围",
                        值: 12,
                        格式: "{}米",
                    },
                },
            },
            {
                id: 110103,
                名称: "回转",
                类型: "被动",
                描述: "[残光]造成伤害和使用单手剑武器造成伤害时，有概率回复神智。",
                字段: {
                    神智回复: {
                        值: 2,
                        格式: "{}",
                    },
                    效果概率: {
                        值: [0.17, 0.2, 0.23, 0.26, 0.29, 0.32, 0.35, 0.38, 0.41, 0.44, 0.47, 0.5],
                    },
                },
            },
            {
                id: 110104,
                名称: "余火",
                类型: "被动",
                描述: "释放[冥焰]后，下一次释放[残光]时不消耗神智。",
            },
            {
                id: 110001,
                名称: "心脏吞噬",
                类型: "协战",
                描述: "[仅在作为协战同伴登场时生效]\n自身和暗属性队友攻击提高。",
                字段: {
                    攻击提高: {
                        值: 0.4,
                    },
                },
            },
        ],
        溯源: [
            "螺旋跳跃和释放[残光]后，自身获得1层技能效益提高8%，持续12秒，最多叠加3层。",
            "对生命值百分比低于自身的目标，造成的伤害提高30%。",
            "[残光]等级+2，[回转]等级+1。",
            "根据自身连击等级提高攻击，每级提高20%。",
            "[冥焰]等级+2，[回转]等级+1。",
            "使用[冥焰]后，释放剑气时有概率额外生成1道剑气。概率为[伊弥尔]触发概率属性值的25%。",
        ],
        同律武器: [
            {
                id: 110101,
                名称: "伊弥尔",
                类型: ["同律", "近战", "单手剑"],
                伤害类型: "切割",
                攻击: 24,
                暴击: 0.12,
                暴伤: 1.5,
                触发: 0.5,
            },
        ],
    },
    {
        id: 1103,
        icon: "Tuosi",
        名称: "幻景",
        版本: "1.0",
        别名: "无名歌者",
        阵营: "无阵营",
        属性: "暗",
        精通: ["重剑", "霰弹枪"],
        标签: ["输出", "技能伤害"],
        基础攻击: 21,
        基础生命: 130,
        基础防御: 330,
        基础护盾: 130,
        基础神智: 180,
        加成: {
            攻击: 0.5,
            技能效益: 0.125,
        },
        技能: [
            {
                id: 110301,
                名称: "宣叙调",
                类型: "伤害",
                描述: "对面前范围内的敌人造成暗属性伤害，并附加5层[柔板]，最多叠加10层，叠加时刷新剩余时间。\n[化身为兽]状态中，此技能被替换为[咏叹调]。",
                字段: {
                    神智消耗: {
                        影响: "技能效益",
                        值: 20,
                        格式: "{}",
                    },
                    伤害: {
                        影响: "技能威力",
                        值: [2.49, 3.05, 3.61, 4.17, 4.73, 5.29, 5.85, 6.41, 6.97, 7.53, 8.09, 8.65],
                    },
                    伤害半径: {
                        影响: "技能范围",
                        值: 6,
                        格式: "{}米",
                    },
                    "[柔板]持续时间": {
                        影响: "技能耐久",
                        值: 8,
                        格式: "{}秒",
                    },
                    "[急板]技能范围提高": {
                        值: 0.3,
                    },
                    "[急板]持续时间": {
                        影响: "技能耐久",
                        值: 5,
                        格式: "{}秒",
                    },
                },
                术语解释: {
                    咏叹调: "向前跃进，对路径上的敌人造成暗属性伤害，并获得[急板]。[急板]：技能范围提高，受到伤害时不会产生僵直。",
                },
            },
            {
                id: 110302,
                名称: "幕启",
                类型: "增益",
                描述: "进入[化身为兽]状态。[化身为兽]状态中持续消耗神智，神智下降为0时退出[化身为兽]状态。\n[化身为兽]状态中，无法使用武器。\n近战攻击被替换为[狂怒的锐爪]，进行最多四段的连续攻击，造成暗属性伤害；在空中释放时，落地并对周围范围内的敌人造成暗属性伤害。\n远程攻击被替换为[悲恸的鸣啸]，发射能量射线进行攻击，造成暗属性伤害。\n[狂怒的锐爪]第三段和[悲恸的鸣啸]造成伤害时,触发[二重唱]效果；[狂怒的锐爪]第四段和空中下落造成伤害时，触发[休止符]效果。",
                字段: {
                    神智消耗: {
                        影响: "技能效益",
                        值: 10,
                        格式: "{}",
                    },
                    每秒神智消耗: {
                        影响: "技能效益,技能耐久",
                        值: 30,
                        格式: "{}",
                    },
                    "[狂怒的锐爪]一段伤害": {
                        影响: "技能威力",
                        值: [7.25, 8.86, 10.47, 12.08, 13.69, 15.3, 16.91, 18.52, 20.13, 21.74, 23.35, 24.96],
                    },
                    "[狂怒的锐爪]二段伤害": {
                        影响: "技能威力",
                        值: [7.25, 8.86, 10.47, 12.08, 13.69, 15.3, 16.91, 18.52, 20.13, 21.74, 23.35, 24.96],
                    },
                    "[狂怒的锐爪]三段伤害": {
                        影响: "技能威力",
                        值: [4.86, 5.93, 7, 8.07, 9.14, 10.21, 11.28, 12.35, 13.42, 14.49, 15.56, 16.63],
                    },
                    "[狂怒的锐爪]四段伤害": {
                        影响: "技能威力",
                        值: [18.72, 22.88, 27.04, 31.2, 35.36, 39.52, 43.68, 47.84, 52, 56.16, 60.32, 64.48],
                    },
                    "[狂怒的锐爪]下落伤害": {
                        影响: "技能威力",
                        值: [19.35, 23.64, 27.93, 32.22, 36.51, 40.8, 45.09, 49.38, 53.67, 57.96, 62.25, 66.54],
                    },
                    "[狂怒的锐爪]伤害半径": {
                        影响: "技能范围",
                        值: 6,
                        格式: "{}米",
                    },
                    "[悲恸的鸣啸]射线伤害": {
                        影响: "技能威力",
                        值: [4.28, 5.22, 6.16, 7.1, 8.04, 8.98, 9.92, 10.86, 11.8, 12.74, 13.68, 14.62],
                    },
                    "[悲恸的鸣啸]射线长度": {
                        影响: "技能范围",
                        值: 20,
                        格式: "{}米",
                    },
                    "[二重唱]获得[沉浸度]": {
                        值: 0.006,
                        格式: "{%}最大神智",
                    },
                    "每层[柔板]增加伤害倍率": {
                        影响: "技能威力",
                        值: [0.91, 1.12, 1.33, 1.54, 1.75, 1.96, 2.17, 2.38, 2.59, 2.8, 3.01, 3.22],
                    },
                    "[休止符]神智回复": {
                        值: 10,
                        格式: "{}",
                    },
                    "[休止符]获得[沉浸度]": {
                        值: 0.06,
                        格式: "{%}最大神智",
                    },
                },
                术语解释: {
                    二重唱: "获得一定量的[沉浸度]，效果每0.1秒最多触发1次。",
                    休止符: "基于目标的[柔板]层数增加伤害倍率，并移除目标所有[柔板]；如果目标带有10层[柔板]，自身回复神智并获得一定量的[沉浸度]，效果每次攻击最多触发1次。",
                },
            },
            {
                id: 110303,
                名称: "舞台演绎",
                类型: "被动",
                描述: "[化身为兽]状态中，基于自身最大神智，提高自身攻击。\n自身可通过释放技能获得[沉浸度]，[沉浸度]上限与最大神智相等。释放[宣叙调][咏叹调]时，获得一定量的[沉浸度]；[化身为兽]状态中，每秒获得一定量的[沉浸度]。\n[化身为兽]状态中[沉浸度]达到上限时，自动进入[化身为兽·献奉]状态。",
                字段: {
                    攻击提高: {
                        值: [0.25, 0.3, 0.35, 0.4, 0.45, 0.5, 0.55, 0.6, 0.65, 0.7, 0.75, 0.8],
                        格式: "{%}最大神智",
                    },
                    攻击提高上限: {
                        值: 315,
                        格式: "{}",
                    },
                    "[宣叙调]获得[沉浸度]": {
                        值: 20,
                        格式: "{}",
                    },
                    "[咏叹调]获得[沉浸度]": {
                        值: 20,
                        格式: "{}",
                    },
                    "[化身为兽]每秒获得[沉浸度]": {
                        值: 30,
                        格式: "{}",
                    },
                    额外攻击提高: {
                        值: [0.25, 0.3, 0.35, 0.4, 0.45, 0.5, 0.55, 0.6, 0.65, 0.7, 0.75, 0.8],
                        格式: "{%}最大神智",
                    },
                    额外攻击提高上限: {
                        值: 315,
                        格式: "{}",
                    },
                    每秒沉浸度消耗: {
                        值: 30,
                        格式: "{}",
                    },
                    技能速度提高: {
                        值: 0.3,
                    },
                },
                术语解释: {
                    "化身为兽·献奉":
                        "[化身为兽·献奉]状态中，持续消耗[沉浸度]代替持续消耗神智维持[化身为兽]状态，技能速度提高，额外基于自身最大神智，提高自身攻击。\n[化身为兽·献奉]状态中，无法因维持[化身为兽]状态而每秒获得[沉浸度]。",
                },
            },
            {
                id: 110304,
                名称: "协奏曲",
                类型: "被动",
                描述: "[狂怒的锐爪]第三段和[悲恸的鸣啸]造成伤害时，有概率附加1层[柔板]。",
                字段: {
                    效果概率: {
                        值: 0.667,
                    },
                },
            },
            {
                id: 110003,
                名称: "天平裁决",
                类型: "协战",
                描述: "[仅在作为协战同伴登场时生效]\n自身和暗属性队友攻击提高。",
                字段: {
                    攻击提高: {
                        值: 0.5,
                    },
                },
            },
        ],
        溯源: [
            "[二重唱]获得的[沉浸度]提高至最大神智的1.5%。",
            "释放[狂怒的锐爪]第三段和[悲恸的鸣啸]期间受到的伤害降低25%，[协奏曲]附加[柔板]的概率提升至100%。",
            "[宣叙调]等级+2，[舞台演绎]等级+1。",
            "[狂怒的锐爪]第四段和空中下落造成伤害时，如果目标带有10层[柔板]，伤害提高110%。",
            "[幕启]等级+2，[舞台演绎]等级+1。",
            "[急板]额外获得昂扬提高90%效果；触发[二重唱]的获得[沉浸度]效果时，[急板]持续时间延长0.2秒。",
        ],
    },
    {
        id: 1501,
        icon: "Baonu",
        名称: "莉兹贝尔",
        版本: "1.0",
        别名: "坚忍 · 暴怒",
        阵营: "艾利西安传颂会",
        属性: "光",
        精通: ["重剑", "霰弹枪"],
        标签: ["输出", "同律武器", "武器伤害"],
        基础攻击: 24,
        基础生命: 90,
        基础防御: 240,
        基础护盾: 90,
        基础神智: 150,
        加成: {
            攻击: 0.5,
            技能耐久: 0.15,
        },
        技能: [
            {
                id: 150101,
                名称: "以坚忍之名",
                类型: "伤害",
                描述: "向前飞跃，沿途造成3次光属性范围伤害，之后下落，造成光属性范围伤害。",
                字段: {
                    神智消耗: {
                        影响: "技能效益",
                        值: 15,
                        格式: "{}",
                    },
                    伤害: {
                        影响: "技能威力",
                        值: [2.74, 3.34, 3.94, 4.54, 5.14, 5.74, 6.34, 6.94, 7.54, 8.14, 8.74, 9.34],
                        值2: [6.67, 8.15, 9.63, 11.11, 12.59, 14.07, 15.55, 17.03, 18.51, 19.99, 21.47, 22.95],
                        格式: "{%}×3+{%}",
                    },
                    伤害半径: {
                        影响: "技能范围",
                        值: 6,
                        格式: "{}米",
                    },
                },
            },
            {
                id: 150102,
                名称: "我不忍啦！",
                类型: "增益",
                描述: "将近战武器切换为[萨麦尔]并对面前范围内的敌人造成光属性伤害。使用[萨麦尔]期间再次使用此技能时收回[萨麦尔]。\n使用[萨麦尔]进行普通攻击时，会进行最多四段的连续攻击。\n使用[萨麦尔]进行蓄力攻击需要消耗神智，可以长按维持蓄力状态，蓄力期间获得[不坚忍]，每0.5秒消耗神智并获得连击点数。\n长按结束、神智不足或连击等级达到最高时释放蓄力攻击，对面前范围内的敌人造成光属性伤害。",
                字段: {
                    神智消耗: {
                        影响: "技能效益",
                        值: 10,
                        格式: "{}",
                    },
                    一段伤害: {
                        影响: "技能威力",
                        值: [3.46, 3.85, 4.24, 4.63, 5.02, 5.41, 5.8, 6.19, 6.58, 6.97, 7.36, 7.75],
                    },
                    二段伤害: {
                        影响: "技能威力",
                        值: [4.09, 4.54, 4.99, 5.44, 5.89, 6.34, 6.79, 7.24, 7.69, 8.14, 8.59, 9.04],
                    },
                    三段伤害: {
                        影响: "技能威力",
                        值: [2, 2.23, 2.46, 2.69, 2.92, 3.15, 3.38, 3.61, 3.84, 4.07, 4.3, 4.53],
                        格式: "{%}×2",
                    },
                    四段伤害: {
                        影响: "技能威力",
                        值: [1.89, 2.1, 2.31, 2.52, 2.73, 2.94, 3.15, 3.36, 3.57, 3.78, 3.99, 4.2],
                        值2: [5.66, 6.29, 6.92, 7.55, 8.18, 8.81, 9.44, 10.07, 10.7, 11.33, 11.96, 12.59],
                        格式: "{%}+{%}",
                    },
                    连段伤害半径: {
                        值: 3,
                        格式: "{}米",
                    },
                    下落攻击伤害: {
                        值: 0.51,
                    },
                    滑行攻击伤害: {
                        值: 0.73,
                    },
                    蓄力攻击伤害: {
                        影响: "技能威力",
                        值: [8.48, 9.43, 10.38, 11.33, 12.28, 13.23, 14.18, 15.13, 16.08, 17.03, 17.98, 18.93],
                    },
                    S级蓄力攻击伤害: {
                        影响: "技能威力",
                        值: [1.79, 1.99, 2.19, 2.39, 2.59, 2.79, 2.99, 3.19, 3.39, 3.59, 3.79, 3.99],
                        值2: [8.48, 9.43, 10.38, 11.33, 12.28, 13.23, 14.18, 15.13, 16.08, 17.03, 17.98, 18.93],
                        格式: "{%}+{%}",
                    },
                    蓄力攻击伤害范围: {
                        值: 6,
                        值2: 6,
                        格式: "{}米×{}米",
                    },
                    蓄力攻击神智消耗: {
                        影响: "技能效益",
                        值: 25,
                        格式: "{}",
                    },
                    蓄力期间神智消耗: {
                        影响: "技能效益",
                        值: 15,
                        格式: "{}",
                    },
                    蓄力期间获得连击点数: {
                        值: 10,
                        格式: "{}",
                    },
                    "[不坚忍]受到伤害降低": {
                        值: 30,
                        格式: "{}%",
                    },
                    技能释放伤害: {
                        影响: "技能威力",
                        值: [4.81, 5.87, 6.93, 7.99, 9.05, 10.11, 11.17, 12.23, 13.29, 14.35, 15.41, 16.47],
                    },
                    技能释放伤害半径: {
                        影响: "技能范围",
                        值: 10,
                        格式: "{}米",
                    },
                },
                术语解释: {
                    不坚忍: "受到伤害时不会产生僵直，受到的伤害降低。",
                },
            },
            {
                id: 150103,
                名称: "哼！！",
                类型: "被动",
                描述: "连击等级提高时，对自身周围的敌人造成光属性伤害，并使[萨麦尔]受到强化。\n连击等级提高至C/B/A/S时，[萨麦尔]的强化等级对应提高至1/2/3/4级。失去连击等级后，[萨麦尔]的强化等级额外持续一定时间。\n自身根据[萨麦尔]的强化等级，获得同律武器的攻击范围和触发概率提高。",
                字段: {
                    伤害: {
                        影响: "技能威力",
                        值: [2.04, 2.48, 2.92, 3.36, 3.8, 4.24, 4.68, 5.12, 5.56, 6, 6.44, 6.88],
                    },
                    伤害半径: {
                        影响: "技能范围",
                        值: 6,
                        格式: "{}米",
                    },
                    武器攻击范围提高: {
                        值: 1.2,
                        格式: "{}×[萨麦尔]强化等级",
                    },
                    触发概率提高: {
                        值: [0.14, 0.18, 0.22, 0.26, 0.3, 0.34, 0.38, 0.42, 0.46, 0.5, 0.54, 0.58],
                        格式: "{%}×[萨麦尔]强化等级",
                    },
                    "[萨麦尔]强化等级持续时间": {
                        影响: "技能耐久",
                        值: 12,
                        格式: "{}秒",
                    },
                },
            },
            {
                id: 150104,
                名称: "越想越气！！！",
                类型: "被动",
                描述: "连击等级S释放[萨麦尔]蓄力攻击后，[不坚忍]效果额外持续一定时间。",
                字段: {
                    "[不坚忍]持续时间": {
                        影响: "技能耐久",
                        值: 12,
                        格式: "{}秒",
                    },
                },
            },
            {
                id: 150001,
                名称: "朱辉散射",
                类型: "协战",
                描述: "[仅在作为协战同伴登场时生效]\n自身和光属性队友攻击提高。",
                字段: {
                    攻击提高: {
                        值: 0.4,
                    },
                },
            },
        ],
        溯源: [
            "释放[以坚忍之名]时，自身获得攻击提高35%，持续15秒。",
            "造成的伤害触发额外效果时，额外获得1点连击点数。",
            "[以坚忍之名]等级+2，[哼！！]等级+1。",
            "连击等级提高时，额外获得5点连击点数。",
            "[我不忍啦！]等级+2，[哼！！]等级+1。",
            "释放[我不忍啦！]和[萨麦尔]蓄力攻击后，自身获得30%光属性追加伤害，持续15秒。",
        ],
        同律武器: [
            {
                id: 150101,
                名称: "萨麦尔",
                类型: ["同律", "近战", "重剑"],
                伤害类型: "震荡",
                攻击: 15,
                暴击: 0.2,
                暴伤: 2,
                触发: 0.25,
            },
        ],
    },
    {
        id: 1502,
        icon: "Nifu",
        名称: "妮弗尔夫人",
        版本: "1.0",
        别名: "雾海引渡人",
        阵营: "无阵营",
        属性: "光",
        精通: ["太刀", "手枪"],
        标签: ["输出", "技能伤害"],
        基础攻击: 21,
        基础生命: 105,
        基础防御: 255,
        基础护盾: 105,
        基础神智: 180,
        加成: {
            攻击: 0.5,
            技能范围: 0.3,
        },
        技能: [
            {
                id: 150201,
                名称: "月猎",
                类型: "伤害",
                描述: "生成1枚[月猎]，并将技能替换为[日食]。\n[月猎]：生成后立即对范围内的敌人造成暗属性伤害，并附加移动速度降低效果。",
                字段: {
                    神智消耗: {
                        影响: "技能效益",
                        值: 12,
                        格式: "{}",
                    },
                    伤害: {
                        影响: "技能威力",
                        值: [11.32, 13.84, 16.36, 18.88, 21.4, 23.92, 26.44, 28.96, 31.48, 34, 36.52, 39.04],
                    },
                    伤害半径: {
                        影响: "技能范围",
                        值: 10,
                        格式: "{}米",
                    },
                    攻击降低: {
                        值: 25,
                        格式: "{}%",
                    },
                    攻击降低持续时间: {
                        值: 3,
                        格式: "{}秒",
                    },
                    移动速度降低: {
                        值: 30,
                        格式: "{}%",
                    },
                    移动速度降低持续时间: {
                        值: 3,
                        格式: "{}秒",
                    },
                },
                术语解释: {
                    日食: "生成1枚[日食]，并将技能替换为[月猎]。\n[日食]：生成后立即对范围内的敌人造成光属性伤害，并附加攻击降低效果。",
                },
            },
            {
                id: 150202,
                名称: "雾海安魂",
                类型: "增益",
                描述: "进入[送葬]状态，进入时，如果自身技能范围大于100%，将技能范围超过100%的部分按一定比例转化为技能威力，并将技能范围降低至100%，持续到[送葬]状态结束。\n[送葬]状态中，远程武器的触发概率提高，释放[月猎]时不消耗神智、并将伤害目标拉向范围中心，释放[日食]时不消耗神智、伤害倍率增加。\n持续一段时间或释放6次[月猎]和[日食]后退出[送葬]状态。",
                字段: {
                    神智消耗: {
                        影响: "技能效益",
                        值: 120,
                        格式: "{}",
                    },
                    触发概率提高: {
                        值: 0.6,
                    },
                    "[送葬]状态持续时间": {
                        影响: "技能耐久",
                        值: 12,
                        格式: "{}秒",
                    },
                    "[送葬]状态技能范围转化比例": {
                        值: 1,
                    },
                    "强化[日食]伤害半径": {
                        影响: "技能范围",
                        值: 6,
                        格式: "{}米",
                    },
                    "强化[日食]伤害倍率增加": {
                        影响: "技能威力",
                        值: [22.64, 27.68, 32.72, 37.76, 42.8, 47.84, 52.88, 57.92, 62.96, 68, 73.04, 78.08],
                    },
                    "强化[月猎]伤害半径": {
                        影响: "技能范围",
                        值: 10,
                        格式: "{}米",
                    },
                },
            },
            {
                id: 150203,
                名称: "啼鸣交织",
                类型: "被动",
                描述: "基于远程武器的触发概率，[月猎]生成后，有概率在相同位置生成1枚[日食]，[日食]生成后，有概率在相同位置生成1枚[月猎]。通过此效果生成的[月猎]和[日食]不会受到[雾海安魂]的强化。",
                字段: {
                    效果概率: {
                        值: [0.14, 0.18, 0.22, 0.26, 0.3, 0.34, 0.38, 0.42, 0.46, 0.5, 0.54, 0.58],
                        格式: "{%}远程武器触发概率",
                    },
                    效果概率上限: {
                        值: 0.5,
                    },
                },
            },
            {
                id: 150204,
                名称: "黄昏",
                类型: "被动",
                描述: "[月猎]可以触发暗属性额外效果，[日食]可以触发光属性额外效果。",
                字段: {
                    效果概率: {
                        值: 0.5,
                    },
                },
            },
            {
                id: 150003,
                名称: "十日流金",
                类型: "协战",
                描述: "[仅在作为协战同伴登场时生效]\n自身和光属性队友攻击提高。",
                字段: {
                    攻击提高: {
                        值: 0.5,
                    },
                },
            },
        ],
        溯源: [
            "[啼鸣交织]效果概率增加15%，概率上限增加至65%。",
            "[月猎]造成伤害后，目标在3秒内受到[日食]的伤害提高75%；[日食]造成伤害后，目标在3秒内受到[月猎]的伤害提高75%。",
            "[月猎]等级+2，[啼鸣交织]等级+1。",
            "自身受到的治疗提高50%，神智回复量提高25%。",
            "[雾海安魂]等级+2，[啼鸣交织]等级+1。",
            "使用远程武器造成伤害时，有25%概率在目标位置随机生成1枚[月猎]或[日食]，效果每秒最多触发1次。",
        ],
    },
    {
        id: 1503,
        icon: "Kezhou",
        名称: "刻舟",
        版本: "1.1",
        别名: "仗剑游",
        阵营: "华胥",
        属性: "光",
        精通: ["全部类型"],
        标签: ["输出", "武器伤害"],
        基础攻击: 25,
        基础生命: 135,
        基础防御: 315,
        基础护盾: 135,
        基础神智: 180,
        加成: {
            攻击: 0.5,
            武器暴击率: 0.5,
        },
        技能: [
            {
                id: 150301,
                名称: "少年游",
                类型: "伤害",
                描述: "对周围范围内的敌人造成3次光属性伤害，自身获得远程武器攻击速度提高效果，[借相]状态中，其效果转变为近战武器攻击速度提高，效果持续期间，受到伤害时不会产生僵直。",
                字段: {
                    神智消耗: {
                        影响: "技能效益",
                        值: 20,
                        格式: "{}",
                    },
                    伤害: {
                        影响: "技能威力",
                        值: [0.54, 0.66, 0.78, 0.9, 1.02, 1.14, 1.26, 1.38, 1.5, 1.62, 1.74, 1.86],
                    },
                    伤害半径: {
                        影响: "技能范围",
                        值: 10,
                        格式: "{}米",
                    },
                    攻击速度提高: {
                        值: [0.21, 0.27, 0.33, 0.39, 0.45, 0.51, 0.57, 0.63, 0.69, 0.75, 0.81, 0.87],
                    },
                    持续时间: {
                        影响: "技能耐久",
                        值: 12,
                        格式: "{}秒",
                    },
                },
            },
            {
                id: 150302,
                名称: "霜剑拂流星",
                类型: "增益",
                描述: "进入[借相]状态，召唤大量[古今刀剑]自空中落下，在其落下位置对范围内的敌人造成光属性伤害。\n[借相]状态中，自身近战武器变为[剑非剑]，使用[剑非剑]造成的伤害触发额外效果时生成1柄[羽非羽]。\n[借相]状态中，此技能被替换为[飞羽逐轻尘]。",
                字段: {
                    神智消耗: {
                        影响: "技能效益",
                        值: 100,
                        格式: "{}",
                    },
                    "[古今刀剑]伤害": {
                        影响: "技能威力",
                        值: [3.68, 4.51, 5.34, 6.17, 7, 7.83, 8.66, 9.49, 10.32, 11.15, 11.98, 12.81],
                    },
                    "[剑非剑]攻击范围提高": {
                        值: 1,
                        格式: "{}米",
                    },
                    "[古今刀剑]伤害半径": {
                        影响: "技能范围",
                        值: 6,
                        格式: "{}米",
                    },
                    "[羽非羽]路径伤害": {
                        影响: "技能威力",
                        值: [0.69, 0.83, 0.97, 1.11, 1.25, 1.39, 1.53, 1.67, 1.81, 1.95, 2.09, 2.23],
                    },
                    "[羽非羽]结算倍率": {
                        值: [0.037, 0.044, 0.051, 0.058, 0.065, 0.072, 0.079, 0.086, 0.093, 0.1, 0.107, 0.114],
                        格式: "{%}近战武器触发概率",
                    },
                    伤害: {
                        影响: "技能威力",
                        值: [7.03, 8.59, 10.15, 11.71, 13.27, 14.83, 16.39, 17.95, 19.51, 21.07, 22.63, 24.19],
                    },
                    伤害半径: {
                        影响: "技能范围",
                        值: 10,
                        格式: "{}米",
                    },
                    单手剑模式普通攻击伤害: {
                        值: [0.64, 0.77, 0.9, 1.03, 1.16, 1.29, 1.42, 1.55, 1.68, 1.81, 1.94, 2.07],
                    },
                    长枪模式普通攻击伤害: {
                        值: [0.71, 0.86, 1.01, 1.16, 1.31, 1.46, 1.61, 1.76, 1.91, 2.06, 2.21, 2.36],
                    },
                    大剑模式普通攻击伤害: {
                        值: [0.63, 0.77, 0.91, 1.05, 1.19, 1.33, 1.47, 1.61, 1.75, 1.89, 2.03, 2.17],
                    },
                    双刀模式普通攻击伤害: {
                        值: [0.37, 0.45, 0.53, 0.61, 0.69, 0.77, 0.85, 0.93, 1.01, 1.09, 1.17, 1.25],
                    },
                    "下落/滑铲/蓄力攻击伤害": {
                        值: [0.03, 0.04, 0.05, 0.06, 0.07, 0.08, 0.09, 0.1, 0.11, 0.12, 0.13, 0.14],
                    },
                    切换武器模式伤害: {
                        值: [1.28, 1.56, 1.84, 2.12, 2.4, 2.68, 2.96, 3.24, 3.52, 3.8, 4.08, 4.36],
                    },
                },
                术语解释: {
                    剑非剑: "继承自身近战武器的属性值，攻击范围提高。[剑非剑]拥有单手剑、重剑、长柄和双刀的攻击模式。使用[剑非剑]进行最后一段普通攻击后，切换至随机的攻击模式并发射自身持有的所有[羽非羽]。",
                    羽非羽: "最多持有7把。发射后选取随机敌人作为目标，围绕目标飞行并不断飞向目标进行攻击，对路径上的敌人造成光属性伤害，对目标造成4次伤害后消失。造成伤害时基于自身近战武器触发概率以一定倍率结算目标的光属性额外效果的持续伤害。",
                    飞羽逐轻尘: "退出[借相]状态，对面前范围内的敌人造成光属性伤害。",
                },
            },
            {
                id: 150303,
                名称: "浮生多变化",
                类型: "被动",
                描述: "初始拥有[剑意值][弦意值]各50点，最大100点。\n基于自身[剑意值]，近战武器造成的伤害和近战武器触发概率提高，[霜剑拂流星]的神智消耗降低，[剑意值]满时[霜剑拂流星]神智消耗额外降低30点。\n基于自身[弦意值]，远程武器造成的伤害和远程武器触发概率提高，[飞羽逐轻尘]的神智消耗降低，[弦意值]满时[飞羽逐轻尘]神智消耗额外降低30点。\n[借相]状态中，每次造成近战武器伤害，将1点[剑意值]转化为1点[弦意值]；非[借相]状态中，每次造成远程武器伤害，将1点[弦意值]转化为1点[剑意值]。",
                字段: {
                    "[剑意值][弦意值]收益倍率": {
                        值: [0.0063, 0.0076, 0.0089, 0.0102, 0.0115, 0.0128, 0.0141, 0.0154, 0.0167, 0.018, 0.0193, 0.0206],
                    },
                    "[霜剑拂流星]神智消耗降低": {
                        值: 0.3,
                        格式: "{}×[剑意值]",
                    },
                    "[飞羽逐轻尘]神智消耗降低": {
                        值: 0.3,
                        格式: "{}×[弦意值]",
                    },
                },
            },
            {
                id: 150304,
                名称: "犹记刻舟痕",
                类型: "被动",
                描述: "进入[借相]时，记录此时的[剑意值]，一段时间内，如果自身[剑意值]低于记录值，计算[浮生多变化]的[剑意值]收益时强制按照记录值计算，退出[借相]时失去此效果。\n退出[借相]时，记录此时的[弦意值]，一段时间内，如果自身[弦意值]低于记录值，计算[浮生多变化]的[弦意值]收益时强制按照记录值计算，进入[借相]时失去此效果。",
                字段: {
                    "[犹记刻舟痕]持续时间": {
                        影响: "技能耐久",
                        值: 12,
                        格式: "{}秒",
                    },
                },
            },
            {
                id: 150003,
                名称: "十日流金",
                类型: "协战",
                描述: "[仅在作为协战同伴登场时生效]\n自身和光属性队友攻击提高。",
                字段: {
                    攻击提高: {
                        值: 0.5,
                    },
                },
            },
        ],
        溯源: [
            "[浮生多变化]的每点[剑意值][弦意值]收益倍率增加132.37%，自身周围20米内仅有1/2名敌人时，每次造成武器伤害时转化的[剑意值][弦意值]变为3/2点。",
            "造成的伤害触发额外效果时，获得造成的伤害提高90%效果，持续5秒，自身回复2点神智，回复神智的效果每1秒最多触发1次。",
            "[少年游]等级+2，[浮生多变化]等级+1。",
            "释放终结技后，获得[风拂月照]：受到伤害时不会产生僵直，受到的伤害降低25%，持续25秒。",
            "[霜剑拂流星]等级+2，[浮生多变化]等级+1。",
            "造成的伤害触发额外效果时，获得1层属性穿透提高3%的效果，持续12秒，最多叠加18层。",
        ],
        同律武器: [
            {
                id: 150301,
                名称: "UI_WEAPON_NAME_150301",
                类型: ["同律", "近战", "单手剑"],
            },
            {
                id: 150302,
                名称: "UI_WEAPON_NAME_150302",
                类型: ["同律", "近战", "长柄"],
            },
            {
                id: 150303,
                名称: "UI_WEAPON_NAME_150303",
                类型: ["同律", "近战", "重剑"],
            },
            {
                id: 150304,
                名称: "UI_WEAPON_NAME_150304",
                类型: ["同律", "近战", "双刀"],
            },
        ],
    },
    {
        id: 1504,
        icon: "Suyi",
        名称: "苏乙",
        版本: "1.3",
        别名: "鸢雏",
        阵营: "华胥",
        属性: "光",
        精通: ["长柄", "突击枪"],
        基础攻击: 28,
        基础生命: 70,
        基础防御: 252,
        基础护盾: 140,
        基础神智: 150,
        技能: [
            {
                id: 150401,
                名称: "巡航",
                类型: "被动",
                描述: "进入[巡航]状态，获得高速飞行能力，并对沿途敌人造成光属性伤害，期间持续消耗[天工能源]，[天工能源]下降为0或再次使用此技能时停止[巡航]。",
                字段: {
                    巡航每秒天工能源消耗: {
                        影响: "技能效益",
                        值: 1.5,
                        格式: "{}",
                    },
                    爬升每秒天工能源消耗: {
                        影响: "技能效益",
                        值: 1,
                        格式: "{}",
                    },
                    伤害: {
                        影响: "技能威力",
                        值: 1,
                    },
                },
            },
            {
                id: 150402,
                名称: "天工武器",
                类型: "增益",
                描述: "消耗所有神智召唤[天工平台]，每消耗一定神智，获得1层[天工补给]，最多10层。将近战武器切换为[天工巨剑]，将远程武器切换为[天工炮]。\n使用[天工平台]期间，自身受到伤害时不会产生僵直再次使用此技能时收回[天工平台]。",
            },
            {
                id: 150403,
                名称: "天工势能",
                类型: "被动",
                描述: "每消耗[天工平台]1枚子弹，获得一层[过热]，最多400层，收回[天工平台]时消耗所有[过热]层数，若消耗的[过热]层数达到200，指挥[天工平台]向前飞出，碰撞障碍物时立即爆炸，造成光属性范围伤害。",
            },
            {
                id: 150404,
                名称: "攻防一体",
                类型: "被动",
                描述: "召唤[天工平台]时，生成一个[天工护盾]。",
            },
        ],
        溯源: [
            "[天工巨剑]或[天工炮]造成伤害时，在目标处造成1次光属性范围伤害。效果每0.5秒最多触发1次。",
            "[天工补给]额外为自身附加造成的技能伤害提高效果。",
            "[巡航]等级+2，[天工势能]等级+1。",
            "每消耗[天工平台]1发子弹，修复[天工护盾]血量，持有[天工护盾]期间，受到伤害降低。",
            "[天工武器]等级+2，[天工势能]等级+1。",
            "开大后10s内，每消耗[天工平台]1枚子弹，获得1枚子弹补给，[过热]层数上限变为600层。",
        ],
        同律武器: [
            {
                id: 150401,
                名称: "UI_WEAPON_NAME_150304",
                类型: ["同律", "近战", "远程"],
                伤害类型: "震荡",
                攻击: 7,
                暴击: 0.3,
                暴伤: 2,
                触发: 0.3,
            },
        ],
    },
    {
        id: 1601,
        icon: "Nvzhu",
        名称: "主角-光",
        版本: "1.0",
        别名: "{nickname}",
        阵营: "无阵营",
        属性: "光",
        精通: ["单手剑", "突击枪"],
        标签: ["辅助"],
        基础攻击: 22,
        基础生命: 120,
        基础防御: 300,
        基础护盾: 120,
        基础神智: 100,
        加成: {
            技能耐久: 0.15,
            技能范围: 0.3,
        },
        技能: [
            {
                id: 160101,
                名称: "晨昏",
                类型: "伤害",
                描述: "释放2道剑气，对命中的敌人造成光属性伤害，并必定触发光属性额外效果。",
                字段: {
                    神智消耗: {
                        影响: "技能效益",
                        值: 15,
                        格式: "{}",
                    },
                    剑气伤害: {
                        影响: "技能威力",
                        值: [4.76, 5.83, 6.9, 7.97, 9.04, 10.11, 11.18, 12.25, 13.32, 14.39, 15.46, 16.53],
                    },
                    剑气宽度: {
                        影响: "技能范围",
                        值: 10,
                        格式: "{}米",
                    },
                },
            },
            {
                id: 160102,
                名称: "飞芒",
                类型: "增益",
                描述: "对周围敌人造成光属性伤害，为自身和队友附加超限护盾，并附加[白炽]。",
                字段: {
                    神智消耗: {
                        影响: "技能效益",
                        值: 35,
                        格式: "{}",
                    },
                    伤害: {
                        影响: "技能威力",
                        值: [7.02, 8.59, 10.16, 11.73, 13.3, 14.87, 16.44, 18.01, 19.58, 21.15, 22.72, 24.29],
                    },
                    伤害半径: {
                        影响: "技能范围",
                        值: 10,
                        格式: "{}米",
                    },
                    超限护盾: {
                        影响: "技能威力",
                        值: 0.05,
                        格式: "{%}最大护盾",
                    },
                    持续时间: {
                        影响: "技能耐久",
                        值: 12,
                        格式: "{}秒",
                    },
                    造成武器伤害提高: {
                        值: [0.15, 0.19, 0.23, 0.27, 0.31, 0.35, 0.39, 0.43, 0.47, 0.51, 0.55, 0.59],
                    },
                },
                术语解释: {
                    白炽: "造成的武器伤害提高。",
                },
            },
            {
                id: 160103,
                名称: "散射",
                类型: "被动",
                描述: "造成伤害触发光属性额外效果时，在目标处造成1次光属性范围伤害。效果每0.5秒最多触发1次。",
                字段: {
                    伤害: {
                        影响: "技能威力",
                        值: [2.01, 2.57, 3.13, 3.69, 4.25, 4.81, 5.37, 5.93, 6.49, 7.05, 7.61, 8.17],
                    },
                    伤害半径: {
                        影响: "技能范围",
                        值: 3,
                        格式: "{}米",
                    },
                },
            },
            {
                id: 160104,
                名称: "流光",
                类型: "被动",
                描述: "释放[飞芒]时，为自身和队友附加触发概率提高效果。",
                字段: {
                    持续时间: {
                        影响: "技能耐久",
                        值: 12,
                        格式: "{}秒",
                    },
                    触发概率提高: {
                        值: 1,
                    },
                },
            },
            {
                id: 100005,
                名称: "锋锐",
                类型: "协战",
                描述: "[仅在作为协战同伴登场时生效]\n自身和队友造成的武器伤害提高。",
                字段: {
                    造成武器伤害提高: {
                        值: 0.08,
                    },
                },
            },
        ],
        溯源: [
            "自身带有[白炽]时，[晨昏]的剑气伤害提高70%。",
            "释放[飞芒]时，生成1个半径10米[棱镜]领域，持续10秒。领域内的敌人被持续附加移动速度降低50%的效果。",
            "[晨昏]等级+2，[散射]等级+1。",
            "释放技能时，自身获得1层攻击速度提高9%的效果，持续12秒，最多叠加4层。",
            "[飞芒]等级+2，[散射]等级+1。",
            "[白炽]额外提供暴击率提高54%的效果。",
        ],
    },
    {
        id: 1801,
        icon: "Feina",
        名称: "菲娜",
        版本: "1.0",
        别名: "夜莺千夜谭",
        阵营: "无阵营",
        属性: "光",
        精通: ["单手剑", "突击枪"],
        标签: ["辅助"],
        基础攻击: 22,
        基础生命: 105,
        基础防御: 315,
        基础护盾: 105,
        基础神智: 160,
        加成: {
            技能范围: 0.3,
            技能耐久: 0.15,
        },
        技能: [
            {
                id: 180101,
                名称: "“在一个暖和的午后”",
                类型: "伤害",
                描述: "对面前范围内的敌人造成光属性伤害并附加移动速度降低。\n如果在[喧闹下午茶]持续期间释放，将[喧闹下午茶]领域转移至自身当前位置，效果范围变为[喧闹下午茶]范围，并提高造成的伤害。",
                字段: {
                    神智消耗: {
                        影响: "技能效益",
                        值: 15,
                        格式: "{}",
                    },
                    伤害: {
                        影响: "技能威力",
                        值: [0.45, 0.54, 0.63, 0.72, 0.81, 0.9, 0.99, 1.08, 1.17, 1.26, 1.35, 1.44],
                    },
                    伤害半径: {
                        影响: "技能范围",
                        值: 6,
                        格式: "{}米",
                    },
                    "[喧闹下午茶]内伤害": {
                        影响: "技能威力",
                        值: [0.59, 0.73, 0.87, 1.01, 1.15, 1.29, 1.43, 1.57, 1.71, 1.85, 1.99, 2.13],
                    },
                    移动速度降低持续时间: {
                        影响: "技能耐久",
                        值: 12,
                        格式: "{}秒",
                    },
                },
            },
            {
                id: 180102,
                名称: "“下午茶开始了！”",
                类型: "增益",
                描述: "在身前展开[喧闹下午茶]领域。[喧闹下午茶]领域持续消耗神智，神智下降为0或长按释放此技能时结束[喧闹下午茶]领域。\n[喧闹下午茶]持续期间，点按释放此技能时可按照[夜莺][猎犬][独角兽][蝴蝶]的顺序切换领域效果。\n如果在[喧闹下午茶]领域范围外进行切换，将[喧闹下午茶]领域转移至自身当前位置。",
                字段: {
                    神智消耗: {
                        影响: "技能效益",
                        值: 10,
                        格式: "{}",
                    },
                    每秒神智消耗: {
                        影响: "技能效益,技能耐久",
                        值: 12,
                        格式: "{}",
                    },
                    "[喧闹下午茶]效果半径": {
                        影响: "技能范围",
                        值: 10,
                        格式: "{}米",
                    },
                    持续伤害: {
                        影响: "技能威力",
                        值: [3.49, 4.28, 5.07, 5.86, 6.65, 7.44, 8.23, 9.02, 9.81, 10.6, 11.39, 12.18],
                    },
                    追加伤害倍率: {
                        值: [0.051, 0.062, 0.073, 0.084, 0.095, 0.106, 0.117, 0.128, 0.139, 0.15, 0.161, 0.172],
                    },
                    追加伤害持续时间: {
                        影响: "技能耐久",
                        值: 12,
                        格式: "{}秒",
                    },
                },
                术语解释: {
                    喧闹下午茶:
                        "根据领域中的[下午茶的客人们]，生效对应属性的效果。[下午茶的客人们]包括[夜莺][猎犬][独角兽][蝴蝶]，分别对应水、火、雷、风属性。\n领域展开及切换时，为自身和队友附加对应属性的追加伤害。[喧闹下午茶]持续期间，对领域内的敌人2秒造成1次对应属性的持续伤害。",
                },
            },
            {
                id: 180103,
                名称: "“坏巫师最怕阳光了！”",
                类型: "被动",
                描述: "自身获得永续的光属性追加伤害。释放[“在一个暖和的午后”]时，获得6层[梦笔生花]；[喧闹下午茶]领域持续期间，每秒获得1层[梦笔生花]，最多叠加30层。",
                字段: {
                    永续追加伤害倍率: {
                        影响: "技能威力",
                        值: [0.06, 0.07, 0.08, 0.09, 0.1, 0.11, 0.12, 0.13, 0.14, 0.15, 0.16, 0.17],
                    },
                    每层追加伤害倍率: {
                        影响: "技能威力",
                        值: [0.0037, 0.0044, 0.0051, 0.0058, 0.0065, 0.0072, 0.0079, 0.0086, 0.0093, 0.01, 0.0107, 0.0114],
                    },
                    持续时间: {
                        影响: "技能耐久",
                        值: 15,
                        格式: "{}秒",
                    },
                },
                术语解释: {
                    梦笔生花: "额外附加光属性追加伤害",
                },
            },
            {
                id: 180104,
                名称: "“故事还没有结束”",
                类型: "被动",
                描述: "释放[“在一个暖和的午后”]时，根据[梦笔生花]层数为自身和队友附加伤害提高效果。",
                字段: {
                    造成伤害提高: {
                        值: 0.01,
                        格式: "{%}×[梦笔生花]层数",
                    },
                    持续时间: {
                        影响: "技能耐久",
                        值: 12,
                        格式: "{}秒",
                    },
                },
            },
            {
                id: 180191,
                名称: "“前进，扑克牌士兵！”",
                类型: "协战",
                描述: "[仅在作为协战同伴登场时生效]\n自身和精通武器包含单手剑或突击枪的队友造成的武器伤害提高。",
                字段: {
                    造成武器伤害提高: {
                        值: 0.1,
                    },
                },
            },
        ],
        溯源: [
            "带有[喧闹下午茶]附加的追加伤害的目标，每带有1种属性的追加伤害效果，全属性穿透提高6%。",
            "[梦笔生花]最多叠加层数提高至45层，释放[“在一个暖和的午后”]时额外获得3层[梦笔生花]，[喧闹下午茶]领域持续期间每秒额外获得1层[梦笔生花]。",
            "[“在一个暖和的午后”]等级+2，[“坏巫师最怕阳光了！”]等级+1。",
            "每层[梦笔生花]令自身技能威力提高2%、技能范围提高1%。",
            "[“下午茶开始了！”]等级+2，[“坏巫师最怕阳光了！”]等级+1。",
            "[喧闹下午茶]领域持续期间，自身造成武器伤害时，目标每带有1个属性额外触发效果，此次伤害的暴击率提高24%，并将其中元素属性伤害转换为目标的弱点属性伤害。",
        ],
    },
    {
        id: 2101,
        icon: "Shuimu",
        名称: "丽蓓卡",
        版本: "1.0",
        别名: "纯爱蜇刺",
        阵营: "卢卡共和国",
        属性: "水",
        精通: ["长柄", "榴炮"],
        标签: ["输出", "召唤物", "技能伤害"],
        基础攻击: 25,
        基础生命: 100,
        基础防御: 252,
        基础护盾: 100,
        基础神智: 150,
        加成: {
            攻击: 0.5,
            技能范围: 0.3,
        },
        技能: [
            {
                id: 210101,
                名称: "缠绵之触",
                类型: "召唤",
                描述: "召唤1个[召唤物·海月水母]。[召唤物·海月水母]同时最多存在3个。",
                字段: {
                    神智消耗: {
                        影响: "技能效益",
                        值: 35,
                        格式: "{}",
                    },
                    召唤物持续时间: {
                        影响: "技能耐久",
                        值: 14,
                        格式: "{}秒",
                    },
                    召唤物伤害: {
                        影响: "技能威力",
                        值: [7.69, 9.4, 11.11, 12.82, 14.53, 16.24, 17.95, 19.66, 21.37, 23.08, 24.79, 26.5],
                    },
                    召唤物伤害半径: {
                        影响: "技能范围",
                        值: 10,
                        格式: "{}米",
                    },
                },
                术语解释: {
                    "召唤物·海月水母": "继承召唤者100%的属性值，持续攻击周围的敌人，造成水属性伤害。",
                },
            },
            {
                id: 210102,
                名称: "爱神蜜露",
                类型: "伤害",
                描述: "对自身周围的敌人造成水属性伤害，并按照目标带有的[爱之毒]层数增加伤害倍率。",
                字段: {
                    神智消耗: {
                        影响: "技能效益",
                        值: 75,
                        格式: "{}",
                    },
                    伤害: {
                        影响: "技能威力",
                        值: [9.24, 11.29, 13.34, 15.39, 17.44, 19.49, 21.54, 23.59, 25.64, 27.69, 29.74, 31.79],
                    },
                    "每层[爱之毒]增加伤害倍率": {
                        影响: "技能威力",
                        值: [3.58, 4.38, 5.18, 5.98, 6.78, 7.58, 8.38, 9.18, 9.98, 10.78, 11.58, 12.38],
                    },
                    伤害半径: {
                        影响: "技能范围",
                        值: 20,
                        格式: "{}米",
                    },
                },
            },
            {
                id: 210103,
                名称: "纯爱试炼",
                类型: "被动",
                描述: "使用近战武器和[召唤物·海月水母]攻击造成伤害时，附加1层[爱之毒]，最多叠加6层。",
                字段: {
                    "[爱之毒]持续时间": {
                        影响: "技能耐久",
                        值: 6,
                        格式: "{}秒",
                    },
                    "[爱之毒]伤害": {
                        影响: "技能威力",
                        值: [0.71, 0.88, 1.05, 1.22, 1.39, 1.56, 1.73, 1.9, 2.07, 2.24, 2.41, 2.58],
                    },
                    "[爱之毒]传染半径": {
                        影响: "技能范围",
                        值: 10,
                        格式: "{}米",
                    },
                },
                术语解释: {
                    爱之毒: "每2秒造成1次水属性持续伤害。带有[爱之毒]的敌人被击败时，会将其自身的[爱之毒]按照当前层数和剩余时间传染给周围的敌人。",
                },
            },
            {
                id: 210104,
                名称: "相思成疾",
                类型: "被动",
                描述: "使用近战武器普通攻击造成伤害时，有概率额外结算1次目标的[爱之毒]伤害。\n[爱神蜜露]造成伤害时必定额外结算1次目标的[爱之毒]伤害。",
                字段: {
                    效果概率: {
                        值: 0.25,
                    },
                },
            },
            {
                id: 210003,
                名称: "七天泛滥",
                类型: "协战",
                描述: "[仅在作为协战同伴登场时生效]\n自身和水属性队友攻击提高。",
                字段: {
                    攻击提高: {
                        值: 0.5,
                    },
                },
            },
        ],
        溯源: [
            "触发额外效果时，额外附加1层[爱之毒]。",
            "[召唤物·海月水母]同时最多存在数量提高至5个，[爱之毒]最多叠加层数提高至8层。",
            "[缠绵之触]等级+2，[纯爱试炼]等级+1。",
            "受到来自带有[爱之毒]的目标的伤害降低30%。",
            "[爱神蜜露]等级+2，[纯爱试炼]等级+1。",
            "击败带有[爱之毒]的目标时，自身获得1层攻击提高3%，持续15秒，最多叠加50层，叠加时刷新剩余时间。",
        ],
    },
    {
        id: 2102,
        icon: "Eve",
        名称: "伊薇",
        版本: "1.5",
        别名: "UI_CHAR_SUBTITLE_2102",
        阵营: "卢卡共和国",
        属性: "水",
        精通: ["长柄", "榴炮"],
        标签: ["输出", "召唤物", "技能伤害"],
        基础攻击: 25,
        基础生命: 100,
        基础防御: 252,
        基础护盾: 100,
        基础神智: 200,
        技能: [
            {
                id: 210201,
                名称: "",
                类型: "召唤",
                描述: "",
            },
            {
                id: 210202,
                名称: "",
                类型: "召唤",
                描述: "",
            },
            {
                id: 210203,
                名称: "",
                类型: "被动",
                描述: "",
            },
            {
                id: 210204,
                名称: "",
                类型: "被动",
                描述: "",
            },
            {
                id: 210003,
                名称: "七天泛滥",
                类型: "协战",
                描述: "[仅在作为协战同伴登场时生效]\n自身和水属性队友攻击提高。",
                字段: {
                    攻击提高: {
                        值: 0.5,
                    },
                },
            },
        ],
    },
    {
        id: 2301,
        icon: "Zhangyu",
        名称: "塔比瑟",
        版本: "1.0",
        别名: "流动恶作剧",
        阵营: "卢卡共和国",
        属性: "水",
        精通: ["单手剑", "弓"],
        标签: ["辅助", "召唤物", "控制"],
        基础攻击: 17,
        基础生命: 115,
        基础防御: 300,
        基础护盾: 115,
        基础神智: 150,
        加成: {
            攻击: 0.5,
            技能耐久: 0.15,
        },
        技能: [
            {
                id: 230101,
                名称: "拿手把戏！",
                类型: "增益",
                描述: "指挥所有的[召唤物·触手]进行1次攻击，并使此次攻击造成的伤害提高。为自身和队友附加造成的技能伤害提高效果。",
                字段: {
                    神智消耗: {
                        影响: "技能效益",
                        值: 30,
                        格式: "{}",
                    },
                    "[召唤物·触手]伤害提高": {
                        值: [0.37, 0.44, 0.51, 0.58, 0.65, 0.72, 0.79, 0.86, 0.93, 1, 1.07, 1.14],
                    },
                    技能伤害提高: {
                        值: [0.16, 0.2, 0.24, 0.28, 0.32, 0.36, 0.4, 0.44, 0.48, 0.52, 0.56, 0.6],
                    },
                    技能伤害提高效果持续时间: {
                        影响: "技能耐久",
                        值: 8,
                        格式: "{}秒",
                    },
                },
            },
            {
                id: 230102,
                名称: "正义群殴！",
                类型: "召唤",
                描述: "在自身周围召唤9个[召唤物·触手]。",
                字段: {
                    神智消耗: {
                        影响: "技能效益",
                        值: 50,
                        格式: "{}",
                    },
                    召唤物伤害: {
                        影响: "技能威力",
                        值: [0.53, 0.66, 0.79, 0.92, 1.05, 1.18, 1.31, 1.44, 1.57, 1.7, 1.83, 1.96],
                    },
                    召唤物持续时间: {
                        影响: "技能耐久",
                        值: 12,
                        格式: "{}秒",
                    },
                },
                术语解释: {
                    "召唤物·触手": "继承召唤者100%的属性值，持续攻击其周围的敌人，造成水属性伤害，并最多抓取2名敌人，使其无法行动。",
                },
            },
            {
                id: 230103,
                名称: "闹剧开幕！",
                类型: "被动",
                描述: "远程武器造成的伤害暴击后，有概率在目标周围召唤1个[召唤物·触手]，每秒最多触发1次。[召唤物·触手]同时最多存在18个。",
                字段: {
                    效果概率: {
                        值: [0.065, 0.08, 0.095, 0.11, 0.125, 0.14, 0.155, 0.17, 0.185, 0.2, 0.215, 0.23],
                    },
                    召唤物伤害: {
                        影响: "技能威力",
                        值: [0.53, 0.66, 0.79, 0.92, 1.05, 1.18, 1.31, 1.44, 1.57, 1.7, 1.83, 1.96],
                    },
                    召唤物持续时间: {
                        影响: "技能耐久",
                        值: 12,
                        格式: "{}秒",
                    },
                },
                术语解释: {
                    "召唤物·触手": "继承召唤者100%的属性值，持续攻击其周围的敌人，造成水属性伤害，并最多抓取2名敌人，使其无法行动。",
                },
            },
            {
                id: 230104,
                名称: "还有高手！",
                类型: "被动",
                描述: "召唤[召唤物·触手]时，[塔比瑟]获得1层暴击率提高效果，最多叠加10层。",
                字段: {
                    每层暴击率提高: {
                        值: 0.08,
                    },
                    持续时间: {
                        影响: "技能耐久",
                        值: 12,
                        格式: "{}秒",
                    },
                },
            },
            {
                id: 100003,
                名称: "奇技",
                类型: "协战",
                描述: "[仅在作为协战同伴登场时生效]\n自身和队友造成的技能伤害提高。",
                字段: {
                    造成技能伤害提高: {
                        值: 0.08,
                    },
                },
            },
        ],
        溯源: [
            "[正义群殴！]召唤的[召唤物·触手]个数提高至12个，同时最多存在数量提高至24个。",
            "[召唤物·触手]攻击造成伤害时，有10%概率为[塔比瑟]补充1枚弹药，每秒最多触发1次。",
            "[拿手把戏！]等级+2，[闹剧开幕！]等级+1。",
            "场上每有1个自身召唤的[召唤物·触手]，自身暴击率提高2%。",
            "[正义群殴！]等级+2，[闹剧开幕！]等级+1。",
            "被[召唤物·触手]抓取的敌人，每2秒受到[召唤物·触手]攻击力280%的水属性持续伤害。",
        ],
    },
    {
        id: 2401,
        icon: "Baiheng",
        名称: "扶疏",
        版本: "1.1",
        别名: "杏林疏影",
        阵营: "华胥",
        属性: "水",
        精通: ["鞭刃", "弓"],
        标签: ["辅助", "神智回复", "治疗"],
        基础攻击: 23,
        基础生命: 105,
        基础防御: 315,
        基础护盾: 105,
        基础神智: 150,
        加成: {
            技能耐久: 0.15,
            技能威力: 0.2,
        },
        技能: [
            {
                id: 240101,
                名称: "提挈浮沉",
                类型: "召唤",
                描述: "召唤1个[召唤物·云螭]。[召唤物·云螭]同时最多存在2个。",
                字段: {
                    神智消耗: {
                        影响: "技能效益",
                        值: 50,
                        格式: "{}",
                    },
                    召唤物伤害: {
                        影响: "技能威力",
                        值: [2.26, 2.75, 3.24, 3.73, 4.22, 4.71, 5.2, 5.69, 6.18, 6.67, 7.16, 7.65],
                    },
                    召唤物效果半径: {
                        影响: "技能范围",
                        值: 10,
                        格式: "{}米",
                    },
                    召唤物持续时间: {
                        影响: "技能耐久",
                        值: 10,
                        格式: "{}秒",
                    },
                    召唤物治疗: {
                        影响: "技能威力",
                        值: [0.006, 0.007, 0.008, 0.009, 0.01, 0.011, 0.012, 0.013, 0.014, 0.015, 0.016, 0.017],
                        值2: 5,
                        格式: "{%}攻击+{}",
                    },
                    神智回复: {
                        值: 12,
                        格式: "{}",
                    },
                },
                术语解释: {
                    "召唤物·云螭":
                        "继承召唤者100%的属性值，每秒对周围最近的5名敌人造成1次水属性伤害。\n每3秒，[召唤物·云螭]为周围队友提供治疗并回复神智。",
                },
            },
            {
                id: 240102,
                名称: "形与神俱",
                类型: "增益",
                描述: "对自身周围的敌人造成水属性伤害，为自身附加超限护盾并附加攻击速度提高效果，同时为其他队友附加超限护盾并附加[九针治未]。",
                字段: {
                    神智消耗: {
                        影响: "技能效益",
                        值: 75,
                        格式: "{}",
                    },
                    "[形与神俱]伤害": {
                        影响: "技能威力",
                        值: [5.24, 6.4, 7.56, 8.72, 9.88, 11.04, 12.2, 13.36, 14.52, 15.68, 16.84, 18],
                    },
                    "[形与神俱]伤害半径": {
                        影响: "技能范围",
                        值: 6,
                        格式: "{}米",
                    },
                    超限护盾: {
                        影响: "技能威力",
                        值: [0.027, 0.033, 0.039, 0.045, 0.051, 0.057, 0.063, 0.069, 0.075, 0.081, 0.087, 0.093],
                        值2: 80,
                        格式: "{%}攻击+{}",
                    },
                    攻击速度提高: {
                        值: [0.25, 0.3, 0.35, 0.4, 0.45, 0.5, 0.55, 0.6, 0.65, 0.7, 0.75, 0.8],
                    },
                    攻击速度提高效果持续时间: {
                        影响: "技能耐久",
                        值: 12,
                        格式: "{}秒",
                    },
                    技能威力提高: {
                        值: [0.12, 0.14, 0.16, 0.18, 0.2, 0.22, 0.24, 0.26, 0.28, 0.3, 0.32, 0.34],
                        格式: "{%}技能威力",
                    },
                    技能威力提高上限: {
                        值: 1.2,
                    },
                    持续时间: {
                        影响: "技能耐久",
                        值: 12,
                        格式: "{}秒",
                    },
                },
                术语解释: {
                    九针治未: "技能威力提高。数值为[扶疏]技能威力的一定比例。",
                },
            },
            {
                id: 240103,
                名称: "神归心舍",
                类型: "被动",
                描述: "自身和队友释放战技和终结技后，获得1层技能速度提高效果，最多叠加2层，叠加时刷新剩余时间。",
                字段: {
                    每层技能速度提高: {
                        值: [0.039, 0.048, 0.057, 0.066, 0.075, 0.084, 0.093, 0.102, 0.111, 0.12, 0.129, 0.138],
                    },
                    技能速度提高效果持续时间: {
                        影响: "技能耐久",
                        值: 6,
                        格式: "{}",
                    },
                },
            },
            {
                id: 240104,
                名称: "华英成秀",
                类型: "被动",
                描述: "基于自身在场的[召唤物·云螭]数量，自身技能威力提高。",
                字段: {
                    技能威力提高: {
                        值: 0.33,
                        格式: "{%}×[召唤物·云螭]数量",
                    },
                },
            },
            {
                id: 240191,
                名称: "筋脉和同",
                类型: "协战",
                描述: "[仅在作为协战同伴登场时生效]\n队内有2个或以上属性相同的角色时，自身和队友造成的技能伤害提高。",
                字段: {
                    造成技能伤害提高: {
                        值: 0.1,
                    },
                },
            },
        ],
        溯源: [
            "带有[九针治未]的目标，造成技能伤害时无视目标30%防御。",
            "[召唤物·云螭]同时最多存在数量提高至3个。",
            "[提挈浮沉]等级+2，[神归心舍]等级+1。",
            "[神归心舍]最多叠加层数提高至3层，且每层获得昂扬提高12%。",
            "[形与神俱]等级+2，[神归心舍]等级+1。",
            "[形与神俱]的攻击速度提高效果持续期间，自身获得220%近战普通攻击水属性追加伤害。",
        ],
    },
    {
        id: 3101,
        icon: "Linen",
        名称: "琳恩",
        版本: "1.0",
        别名: "封锁的躁动",
        阵营: "海伯利亚帝国",
        属性: "火",
        精通: ["重剑", "双枪"],
        标签: ["输出", "同律武器", "武器伤害"],
        基础攻击: 23,
        基础生命: 105,
        基础防御: 240,
        基础护盾: 105,
        基础神智: 150,
        加成: {
            攻击: 0.5,
            技能耐久: 0.15,
        },
        技能: [
            {
                id: 310101,
                名称: "致命绽放",
                类型: "伤害",
                描述: "对面前范围内的敌人造成火属性伤害并附加[裂伤]。",
                字段: {
                    神智消耗: {
                        影响: "技能效益",
                        值: 12,
                        格式: "{}",
                    },
                    伤害: {
                        影响: "技能威力",
                        值: [1.96, 2.39, 2.82, 3.25, 3.68, 4.11, 4.54, 4.97, 5.4, 5.83, 6.26, 6.69],
                    },
                    伤害半径: {
                        影响: "技能范围",
                        值: 20,
                        格式: "{}米",
                    },
                    "[裂伤]持续时间": {
                        值: 8,
                        格式: "{}秒",
                    },
                    "[裂伤]基础伤害": {
                        影响: "技能威力",
                        值: [0.66, 0.8, 0.94, 1.08, 1.22, 1.36, 1.5, 1.64, 1.78, 1.92, 2.06, 2.2],
                    },
                    "[裂伤创口]计数上限": {
                        值: 10,
                        格式: "{}",
                    },
                },
                术语解释: {
                    裂伤: "效果携带者每受到1次来自[琳恩]的远程武器伤害，[裂伤创口]计数增加1。效果持续时间结束时造成1次火属性伤害，伤害值为：[裂伤创口]计数×[裂伤]基础伤害。",
                },
            },
            {
                id: 310102,
                名称: "火药酬宾",
                类型: "增益",
                描述: "将远程武器切换为[汉塞尔与格雷特]，只能使用技能和射击，且仅可通过[致命绽放]移动。\n进行射击时，对面前的所有敌人造成伤害。射击持续期间，自身每隔0.2秒获得1层攻击速度提高，最多叠加35层。\n使用[汉塞尔与格雷特]期间，自身受到伤害时不会产生僵直并持续消耗神智，神智下降为0或再次使用此技能时收回[汉塞尔与格雷特]。",
                字段: {
                    神智消耗: {
                        影响: "技能效益",
                        值: 10,
                        格式: "{}",
                    },
                    每秒神智消耗: {
                        影响: "技能效益,技能耐久",
                        值: 20,
                        格式: "{}",
                    },
                    射击伤害: {
                        影响: "技能威力",
                        值: [1.27, 1.41, 1.55, 1.69, 1.83, 1.97, 2.11, 2.25, 2.39, 2.53, 2.67, 2.81],
                    },
                    最大射程: {
                        影响: "技能范围",
                        值: 50,
                        格式: "{}米",
                    },
                    每层攻击速度提高: {
                        值: 0.03,
                    },
                },
            },
            {
                id: 310103,
                名称: "战术速射",
                类型: "被动",
                描述: "不进行射击时，自身每秒获得1层[预装填]，最多叠加6层。进行射击时，消耗所有[预装填]，在一段时间内获得[火力压制]：根据消耗[预装填]的层数提高造成的伤害。\n[火力压制]持续期间无法获得[预装填]。",
                字段: {
                    "[火力压制]持续时间": {
                        影响: "技能耐久",
                        值: 6,
                        格式: "{}秒",
                    },
                    每层造成的伤害提高: {
                        值: [0.051, 0.062, 0.073, 0.084, 0.095, 0.106, 0.117, 0.128, 0.139, 0.15, 0.161, 0.172],
                    },
                },
            },
            {
                id: 310104,
                名称: "不可饶恕",
                类型: "被动",
                描述: "[裂伤创口]计数达到上限时立即移除[裂伤]并造成伤害。",
            },
            {
                id: 310003,
                名称: "火狱制造 ",
                类型: "协战",
                描述: "[仅在作为协战同伴登场时生效]\n自身和火属性队友攻击提高。",
                字段: {
                    攻击提高: {
                        值: 0.5,
                    },
                },
            },
        ],
        溯源: [
            "进入战斗时，获得6层[预装填]。同时获得昂扬提高35%，持续60秒。",
            "[火药酬宾]持续期间受到的伤害降低30%，攻击速度提高的叠加间隔降低至0.06秒。",
            "[致命绽放]等级+2，[战术速射]等级+1。",
            "对生命值百分比低于50%的目标，造成的伤害提高70%。",
            "[火药酬宾]等级+2，[战术速射]等级+1。",
            "[火药酬宾]期间使用[汉塞尔与格雷特]触发额外效果时为目标附加[裂伤]，持续8秒。",
        ],
        同律武器: [
            {
                id: 310101,
                名称: "汉塞尔与格雷特",
                类型: ["同律", "远程", "双枪"],
                伤害类型: "贯穿",
                攻击: 28,
                暴击: 0.12,
                暴伤: 1.5,
                触发: 0.5,
            },
        ],
    },
    {
        id: 3102,
        icon: "Xier",
        名称: "希尔妲",
        版本: "1.4",
        别名: "幽雅随行",
        阵营: "海伯利亚帝国",
        属性: "火",
        精通: ["双刀", "榴炮"],
        标签: ["输出", "技能伤害", "武器伤害"],
        基础攻击: 27,
        基础生命: 90,
        基础防御: 265,
        基础护盾: 90,
        基础神智: 200,
        加成: {
            攻击: 0.5,
            武器多重射击: 0.375,
        },
        技能: [
            {
                id: 310201,
                名称: "高温清扫",
                类型: "伤害",
                描述: "命令所有[清扫机]在自身周围持续旋转并发射[高温祛污焰束]，期间所有[轻型清扫机]持续时间暂停。[高温祛污焰束]对扫射到的敌人造成火属性伤害。[高温祛污焰束]持续期间，击败敌人时，自身有概率回复神智。",
                字段: {
                    神智消耗: {
                        影响: "技能效益",
                        值: 10,
                        格式: "{}",
                    },
                    每秒神智消耗: {
                        影响: "技能效益,技能耐久",
                        值: 15,
                        格式: "{}",
                    },
                    伤害: {
                        影响: "技能威力",
                        值: [0.73, 0.88, 1.03, 1.18, 1.33, 1.48, 1.63, 1.78, 1.93, 2.08, 2.23, 2.38],
                    },
                    神智回复概率: {
                        值: [0.13, 0.16, 0.19, 0.22, 0.25, 0.28, 0.31, 0.34, 0.37, 0.4, 0.43, 0.46],
                    },
                    神智回复: {
                        值: 5,
                        格式: "{}",
                    },
                    "[高温祛污焰束]长度": {
                        值: 15,
                        格式: "{}米",
                    },
                },
            },
            {
                id: 310202,
                名称: "倾情服务",
                类型: "召唤",
                描述: "对周围敌人造成火属性伤害并缴械。每命中1名敌人，自身周围生成1座[轻型清扫机]，并刷新所有[轻型清扫机]持续时间。\n自身携带2座[重型清扫机]，[重型清扫机][轻型清扫机]会自动寻找周围的敌人瞄准，每3秒进行1次射击，造成火属性伤害。\n[轻型清扫机]同时最多存在6个。",
                字段: {
                    神智消耗: {
                        影响: "技能效益",
                        值: 30,
                        格式: "{}",
                    },
                    伤害: {
                        影响: "技能威力",
                        值: [3.53, 4.31, 5.09, 5.87, 6.65, 7.43, 8.21, 8.99, 9.77, 10.55, 11.33, 12.11],
                    },
                    伤害半径: {
                        影响: "技能范围",
                        值: 20,
                        格式: "{}米",
                    },
                    "[轻型清扫机]伤害": {
                        影响: "技能威力",
                        值: [2.29, 2.8, 3.31, 3.82, 4.33, 4.84, 5.35, 5.86, 6.37, 6.88, 7.39, 7.9],
                    },
                    "[重型清扫机]伤害": {
                        影响: "技能威力",
                        值: [3.52, 4.31, 5.1, 5.89, 6.68, 7.47, 8.26, 9.05, 9.84, 10.63, 11.42, 12.21],
                    },
                    "[清扫机]索敌半径": {
                        值: 15,
                        格式: "{}米",
                    },
                    "[轻型清扫机]持续时间": {
                        影响: "技能耐久",
                        值: 12,
                        格式: "{}秒",
                    },
                },
                术语解释: {
                    缴械: "永久失去远程武器。",
                },
            },
            {
                id: 310203,
                名称: "自动保洁",
                类型: "被动",
                描述: "闪避时，将自身远程武器弹夹装满，并获得[优雅怒意]。",
                字段: {
                    "[优雅怒意]效果": {
                        值: [0.13, 0.16, 0.19, 0.22, 0.25, 0.28, 0.31, 0.34, 0.37, 0.4, 0.43, 0.46],
                    },
                    "[优雅怒意]持续时间": {
                        影响: "技能耐久",
                        值: 6,
                        格式: "{}",
                    },
                },
                术语解释: {
                    优雅怒意: "[清扫机]的攻击速度提高，[高温清扫]的转速提高，远程武器的攻击速度提高。",
                },
            },
            {
                id: 310204,
                名称: "并行奔忙",
                类型: "被动",
                描述: "[清扫机]进行射击时有概率额外发射1枚子弹，概率为[30%+20%×自身远程武器多重射击属性值]，[高温祛污焰束]伤害提高，提高倍率为[30%+20%×自身远程武器多重射击属性值]。",
            },
            {
                id: 310003,
                名称: "火狱制造 ",
                类型: "协战",
                描述: "[仅在作为协战同伴登场时生效]\n自身和火属性队友攻击提高。",
                字段: {
                    攻击提高: {
                        值: 0.5,
                    },
                },
            },
        ],
        溯源: [
            "闪避次数+2，[优雅怒意]效果倍率增加30%。",
            "[高温祛污焰束]长度提高50%，造成伤害时为目标附加受到来自[希尔妲]的伤害提高85%的效果，持续2秒。",
            "[高温清扫]等级+2，[自动保洁]等级+1。",
            "释放[倾情服务]时，额外生成2座[轻型清扫机]，并对目标附加造成的伤害降低25%的效果，持续12秒。",
            "[倾情服务]等级+2，[自动保洁]等级+1。",
            "[高温清扫]持续期间，自身全属性穿透提高55%。",
        ],
    },
    {
        id: 3103,
        icon: "Yeer",
        名称: "耶尔与奥利弗",
        版本: "1.0",
        别名: "惊喜×惊吓",
        阵营: "无阵营",
        属性: "火",
        精通: ["单手剑", "霰弹枪"],
        标签: ["输出", "技能伤害"],
        基础攻击: 21,
        基础生命: 96,
        基础防御: 288,
        基础护盾: 96,
        基础神智: 180,
        加成: {
            攻击: 0.5,
            技能威力: 0.2,
        },
        技能: [
            {
                id: 310301,
                名称: "小可爱",
                类型: "伤害",
                描述: "丢出1枚名为[小可爱]的炸弹，该炸弹为[小可爱·耶尔制][小可爱·奥利弗制]中随机一种，落地后延迟2秒爆炸，对十字范围内的敌人造成火属性伤害，并引爆范围内的其他[小可爱]。[小可爱]最多同时存在10个。",
                字段: {
                    神智消耗: {
                        影响: "技能效益",
                        值: 15,
                        格式: "{}",
                    },
                    "[小可爱·耶尔制]伤害": {
                        影响: "技能威力",
                        值: [5.02, 6.14, 7.26, 8.38, 9.5, 10.62, 11.74, 12.86, 13.98, 15.1, 16.22, 17.34],
                    },
                    "[小可爱·奥利弗制]伤害": {
                        影响: "技能威力",
                        值: [8.36, 10.22, 12.08, 13.94, 15.8, 17.66, 19.52, 21.38, 23.24, 25.1, 26.96, 28.82],
                    },
                    十字范围长度: {
                        影响: "技能范围",
                        值: 15,
                        格式: "{}米",
                    },
                    十字范围宽度: {
                        影响: "技能范围",
                        值: 4,
                        格式: "{}米",
                    },
                },
                术语解释: {
                    "小可爱·耶尔制":
                        "造成伤害时，造成更大的战姿削减。自身技能威力与技能范围的差值越大，丢出[小可爱·耶尔制]的概率越大。差值大于等于50%时，必定丢出[小可爱·耶尔制]。",
                    "小可爱·奥利弗制":
                        "造成更高的伤害。自身技能范围与技能威力的差值越大，丢出[小可爱·奥利弗制]的概率越大。差值大于等于50%时，必定丢出[小可爱·奥利弗制]。",
                },
            },
            {
                id: 310302,
                名称: "噩梦回忆",
                类型: "伤害",
                描述: "自身周围生成[噩梦实验室]领域。再次使用该技能可提前关闭[噩梦实验室]。",
                字段: {
                    神智消耗: {
                        影响: "技能效益",
                        值: 30,
                        格式: "{}",
                    },
                    持续时间: {
                        影响: "技能耐久",
                        值: 15,
                        格式: "{}秒",
                    },
                    半径: {
                        值: 20,
                        格式: "{}米",
                    },
                    移动速度降低: {
                        值: 0.4,
                    },
                    爆炸伤害: {
                        影响: "技能威力",
                        值: [6.95, 8.5, 10.05, 11.6, 13.15, 14.7, 16.25, 17.8, 19.35, 20.9, 22.45, 24],
                    },
                    "每引爆1枚[小可爱]额外伤害倍率": {
                        影响: "技能威力",
                        值: [2.78, 3.4, 4.02, 4.64, 5.26, 5.88, 6.5, 7.12, 7.74, 8.36, 8.98, 9.6],
                    },
                    "每引爆1枚[小可爱]神智回复": {
                        值: 2,
                        格式: "{}",
                    },
                },
                术语解释: {
                    噩梦实验室:
                        "[噩梦实验室]范围内的敌人移速降低，处于地面上的[小可爱]将暂停延迟爆炸的计时，且不会被其他[小可爱]引爆。\n[噩梦实验室]关闭时会引爆范围内所有的[小可爱]，并对范围内的敌人造成火属性伤害，每引爆1枚[小可爱]，令[噩梦实验室]的伤害倍率提高并为自身回复神智。",
                },
            },
            {
                id: 310303,
                名称: "正确游玩方式",
                类型: "被动",
                描述: "丢出[小可爱]时，如果[小可爱]距离地面高度大于等于2米，落地时对其周围的敌人造成火属性伤害。",
                字段: {
                    "[小可爱]下落伤害": {
                        影响: "技能威力",
                        值: [2.13, 2.59, 3.05, 3.51, 3.97, 4.43, 4.89, 5.35, 5.81, 6.27, 6.73, 7.19],
                    },
                    "[小可爱]下落范围": {
                        影响: "技能范围",
                        值: 6,
                        格式: "{}米",
                    },
                },
            },
            {
                id: 310304,
                名称: "轰鸣回忆",
                类型: "被动",
                描述: "每次释放[小可爱]时获得1层[轰鸣狂热]：技能效益提高，最多叠加3层。",
                字段: {
                    "每层[轰鸣狂热]效果": {
                        值: 0.08,
                    },
                    "[轰鸣狂热]持续时间": {
                        影响: "技能耐久",
                        值: 5,
                        格式: "{}秒",
                    },
                },
            },
            {
                id: 310001,
                名称: "无烟火焰",
                类型: "协战",
                描述: "[仅在作为协战同伴登场时生效]\n自身和火属性队友攻击提高。",
                字段: {
                    攻击提高: {
                        值: 0.4,
                    },
                },
            },
        ],
        溯源: [
            "[小可爱]如果被不同类型的[小可爱]引爆，自身回复1点神智；如果被同类型的[小可爱]引爆，自身回复2点神智。",
            "[噩梦实验室]的移动速度降低效果提高至60%。",
            "[小可爱]等级+2，[正确游玩方式]等级+1。",
            "在[噩梦实验室]中时释放[小可爱]时，有45%概率额外丢出1枚[小可爱]。",
            "[噩梦回忆]等级+2，[正确游玩方式]等级+1。",
            "带有[轰鸣狂热]时，丢出的[小可爱]同时拥有2种类型的特性，可以造成更高的伤害和战姿削减。",
        ],
    },
    {
        id: 3201,
        icon: "Haier",
        名称: "海尔法",
        版本: "1.0",
        别名: "炼火囚笼",
        阵营: "海伯利亚帝国",
        属性: "火",
        精通: ["重剑", "榴炮"],
        标签: ["输出", "最大生命", "技能伤害"],
        基础攻击: 15,
        基础生命: 183,
        基础防御: 345,
        基础护盾: 0,
        基础神智: 120,
        加成: {
            生命: 0.5,
            技能耐久: 0.15,
        },
        技能: [
            {
                id: 320101,
                名称: "灼热地狱",
                类型: "增益",
                描述: "自身获得[裁罚]效果。",
                字段: {
                    神智消耗: {
                        影响: "技能效益",
                        值: 75,
                        格式: "{}",
                    },
                    持续时间: {
                        影响: "技能耐久",
                        值: 15,
                        格式: "{}秒",
                    },
                    持续伤害: {
                        影响: "技能威力",
                        值: [0.24, 0.28, 0.32, 0.36, 0.4, 0.44, 0.48, 0.52, 0.56, 0.6, 0.64, 0.68],
                        格式: "{%}最大生命",
                    },
                    持续伤害范围半径: {
                        影响: "技能范围",
                        值: 10,
                        格式: "{}米",
                    },
                    伤害: {
                        影响: "技能威力",
                        值: [0.36, 0.45, 0.54, 0.63, 0.72, 0.81, 0.9, 0.99, 1.08, 1.17, 1.26, 1.35],
                        值2: [128, 155, 182, 209, 236, 263, 290, 317, 344, 371, 398, 425],
                        格式: "{%}最大生命+{}",
                    },
                    伤害半径: {
                        影响: "技能范围",
                        值: 6,
                        格式: "{}米",
                    },
                    受伤害持续时间延长: {
                        影响: "技能耐久",
                        值: 1,
                        格式: "{}秒",
                    },
                },
                术语解释: {
                    裁罚: "每2秒对周围的敌人造成火属性持续伤害。效果持续期间自身受到伤害后，使效果持续时间延长并对周围敌人造成[穿刺裁罚]火属性伤害，每2秒最多触发1次。",
                },
            },
            {
                id: 320102,
                名称: "绝望牢笼",
                类型: "伤害",
                描述: "对自身周围敌人造成火属性伤害并嘲讽目标。",
                字段: {
                    神智消耗: {
                        影响: "技能效益",
                        值: 50,
                        格式: "{}",
                    },
                    伤害: {
                        影响: "技能威力",
                        值: [0.67, 0.82, 0.97, 1.12, 1.27, 1.42, 1.57, 1.72, 1.87, 2.02, 2.17, 2.32],
                        值2: [110, 133, 156, 179, 202, 225, 248, 271, 294, 317, 340, 363],
                        格式: "{%}最大生命+{}",
                    },
                    伤害半径: {
                        影响: "技能范围",
                        值: 20,
                        格式: "{}米",
                    },
                    嘲讽持续时间: {
                        值: 5,
                        格式: "{}秒",
                    },
                },
            },
            {
                id: 320103,
                名称: "惩戒决意",
                类型: "被动",
                描述: "最大生命值提高，并持续回复生命值。",
                字段: {
                    最大生命值提高: {
                        值: [0.39, 0.48, 0.57, 0.66, 0.75, 0.84, 0.93, 1.02, 1.11, 1.2, 1.29, 1.38],
                    },
                    每秒持续回复生命值: {
                        值: 0.003,
                        格式: "{%}最大生命",
                    },
                },
            },
            {
                id: 320104,
                名称: "罪名宣告",
                类型: "被动",
                描述: "对被自身嘲讽的敌人造成的伤害提高。",
                字段: {
                    造成伤害提高: {
                        值: 0.5,
                    },
                },
            },
            {
                id: 310001,
                名称: "无烟火焰",
                类型: "协战",
                描述: "[仅在作为协战同伴登场时生效]\n自身和火属性队友攻击提高。",
                字段: {
                    攻击提高: {
                        值: 0.4,
                    },
                },
            },
        ],
        溯源: [
            "对自身周围6米范围内的敌人造成的伤害提高30%。",
            "[惩戒决意]的生命值持续回复效果提高至0.4%。",
            "[灼热地狱]等级+2，[惩戒决意]等级+1。",
            "[灼热地狱]的[穿刺裁罚]效果变为每1.4秒最多触发1次。",
            "[绝望牢笼]等级+2，[惩戒决意]等级+1。",
            "其他队友每累计5次消耗神智释放技能，自身自动释放1次[绝望牢笼]效果，每5秒最多触发1次。",
        ],
    },
    {
        id: 3202,
        icon: "Kami",
        名称: "卡米拉",
        版本: "1.3",
        别名: "UI_CHAR_SUBTITLE_3202",
        阵营: "海伯利亚帝国",
        属性: "火",
        精通: ["鞭刃", "手枪"],
        基础攻击: 13,
        基础生命: 185,
        基础防御: 345,
        基础护盾: 120,
        基础神智: 200,
        技能: [
            {
                id: 320201,
                名称: "甘红连打",
                类型: "伤害",
                描述: "击飞所有[匕首轮]，对面范围内的敌人造成火属性伤害并为自身附加1层[赤醺]，连续点击或长按攻击可连续释放。",
                字段: {
                    "每段[甘红连打]神智消耗": {
                        影响: "技能效益",
                        值: 1,
                        格式: "{}",
                    },
                    "[甘红连打]伤害": {
                        影响: "技能威力",
                        值: 1,
                    },
                    "[甘红连打]伤害范围": {
                        影响: "技能范围",
                        值: 3,
                        格式: "{}米",
                    },
                    "每层[赤醺]增加技能速度": {
                        值: 0.06,
                    },
                    "每层[赤醺]增加[匕首轮]击飞飞行速度": {
                        值: 0.2,
                    },
                },
                术语解释: {
                    赤醺: "技能速度增加，[匕首轮]飞行速度增加且持续时间暂停，自身受到伤害时不会产生僵直。[甘红连打]释放结束时清除所有[赤醺]。",
                },
            },
            {
                id: 320202,
                名称: "赤霞狂舞",
                类型: "召唤",
                描述: "对面范围内的敌人造成火属性伤害并召唤8枚[匕首轮]围绕自身旋转，对路径上的敌人造成伤害。",
                字段: {
                    神智消耗: {
                        影响: "技能效益",
                        值: 40,
                        格式: "{}",
                    },
                    "[匕首轮]伤害": {
                        影响: "技能威力",
                        值: 0.15,
                    },
                    "[匕首轮]持续时间": {
                        影响: "技能耐久",
                        值: 20,
                        格式: "{}秒",
                    },
                    "[匕首轮]击飞飞行速度": {
                        值: 20,
                        格式: "{}米/秒",
                    },
                },
                术语解释: {
                    匕首轮: "[匕首轮]每2秒环绕角色旋转一圈，[匕首轮]被击飞后，飞行30米后返回，返回途中若被甘红连打的攻击命中，将其向角色20米范围内的随机一名敌人再次击飞，每次被击飞，都根据[赤醺]层数刷新其速度，同时最多存在8枚。",
                },
            },
            {
                id: 320203,
                名称: "血与酒上",
                类型: "被动",
                描述: "来自[匕首轮]的伤害为敌人附加1层[裂伤]，最多20层。",
                字段: {
                    "[裂伤]追加伤害倍率": {
                        影响: "技能威力",
                        值: 0.1,
                    },
                },
                术语解释: {
                    裂伤: "所有来自武器及除[匕首轮]、[裂伤]外的技能伤害会引爆1层[裂伤]并追加1次对应属性伤害，每秒最多引爆20次。",
                },
            },
            {
                id: 320204,
                名称: "血与酒下",
                类型: "被动",
                描述: "引爆[裂伤]时，为该角色附加1层[微醺愈印]，每获得20层[微醺愈印]触发1次神智回复。",
                字段: {
                    神智回复: {
                        值: 4,
                        格式: "{}%",
                    },
                },
            },
            {
                id: 310001,
                名称: "无烟火焰",
                类型: "协战",
                描述: "[仅在作为协战同伴登场时生效]\n自身和火属性队友攻击提高。",
                字段: {
                    攻击提高: {
                        值: 0.4,
                    },
                },
            },
        ],
        溯源: [
            "来自[匕首轮]的伤害有30%概率额外附加1层[裂伤]。",
            "来自甘红连打的攻击可抵挡敌方投射物，每层持有1层[赤醺]，受到的伤害降低3%。",
            "[甘红连打]等级+2，[赤霞狂舞]等级+1。",
            "引爆[裂伤]造成的伤害提升30%.",
            "[赤霞狂舞]等级+2，[甘红连打]等级+1。",
            "所有来自武器及除[匕首轮]、[裂伤]外的技能伤害会引爆2层[裂伤]。",
        ],
    },
    {
        id: 3301,
        icon: "Maer",
        名称: "玛尔洁",
        版本: "1.0",
        别名: "城市漫游者",
        阵营: "无阵营",
        属性: "火",
        精通: ["长柄", "霰弹枪"],
        标签: ["输出", "控制", "技能伤害"],
        基础攻击: 21,
        基础生命: 83,
        基础防御: 264,
        基础护盾: 83,
        基础神智: 160,
        加成: {
            攻击: 0.5,
            技能范围: 0.3,
        },
        技能: [
            {
                id: 330101,
                名称: "玛尔洁的万能寻宝铲",
                类型: "伤害",
                描述: "攻击自身周围范围内的多名敌人，造成火属性伤害并附加眩晕效果。长按时，持续释放。",
                字段: {
                    神智消耗: {
                        影响: "技能效益",
                        值: 10,
                        格式: "{}",
                    },
                    效果半径: {
                        影响: "技能范围",
                        值: 6,
                        格式: "{}米",
                    },
                    伤害: {
                        影响: "技能威力",
                        值: [1.57, 1.91, 2.25, 2.59, 2.93, 3.27, 3.61, 3.95, 4.29, 4.63, 4.97, 5.31],
                    },
                    眩晕持续时间: {
                        值: 2,
                        格式: "{}秒",
                    },
                    最大攻击目标数量: {
                        值: 6,
                        格式: "{}",
                    },
                },
            },
            {
                id: 330102,
                名称: "玛尔洁的可燃垃圾箱",
                类型: "伤害",
                描述: "向前方发射3个[玛尔洁的可燃垃圾箱]，碰撞障碍物时立即爆炸，造成火属性范围伤害，并通过移除一定层数的[捡到宝了！]强化效果：\n带有3层[捡到宝了！]时，移除对应层数的[捡到宝了！]，使爆炸范围和爆炸伤害倍率增加；\n带有6层[捡到宝了！]时，移除对应层数的[捡到宝了！]，在爆炸后残留灰烬区域，每2秒对范围内的敌人造成1次火属性伤害；\n带有9层[捡到宝了！]时，移除对应层数的[捡到宝了！]，在爆炸后额外造成2次火属性范围伤害。",
                字段: {
                    神智消耗: {
                        影响: "技能效益",
                        值: 50,
                        格式: "{}",
                    },
                    爆炸伤害: {
                        影响: "技能威力",
                        值: [1.26, 1.54, 1.82, 2.1, 2.38, 2.66, 2.94, 3.22, 3.5, 3.78, 4.06, 4.34],
                    },
                    爆炸范围: {
                        影响: "技能范围",
                        值: 6,
                        格式: "{}米",
                    },
                    强化爆炸伤害: {
                        影响: "技能威力",
                        值: [1.87, 2.28, 2.69, 3.1, 3.51, 3.92, 4.33, 4.74, 5.15, 5.56, 5.97, 6.38],
                    },
                    强化爆炸范围: {
                        影响: "技能范围",
                        值: 10,
                        格式: "{}米",
                    },
                    灰烬区域伤害: {
                        影响: "技能威力",
                        值: [0.49, 0.59, 0.69, 0.79, 0.89, 0.99, 1.09, 1.19, 1.29, 1.39, 1.49, 1.59],
                    },
                    灰烬区域范围: {
                        影响: "技能范围",
                        值: 10,
                        格式: "{}米",
                    },
                    灰烬区域持续时间: {
                        值: 10,
                        格式: "{}秒",
                    },
                    额外伤害: {
                        影响: "技能威力",
                        值: [1.27, 1.54, 1.81, 2.08, 2.35, 2.62, 2.89, 3.16, 3.43, 3.7, 3.97, 4.24],
                    },
                    额外伤害范围: {
                        影响: "技能范围",
                        值: 6,
                        格式: "{}米",
                    },
                },
            },
            {
                id: 330103,
                名称: "玛尔洁的回收储物袋",
                类型: "被动",
                描述: "自身和队友拾取掉落物时，自身获得1层永续的[捡到宝了！]：技能威力提高，最多叠加20层。",
                字段: {
                    每层技能威力提高: {
                        值: [0.024, 0.028, 0.032, 0.036, 0.04, 0.044, 0.048, 0.052, 0.056, 0.06, 0.064, 0.068],
                    },
                },
            },
            {
                id: 330104,
                名称: "玛尔洁的鼓劲小调儿",
                类型: "被动",
                描述: "其他队友获得攻击提高效果。",
                字段: {
                    攻击提高: {
                        值: 0.45,
                    },
                },
            },
            {
                id: 100001,
                名称: "攻袭",
                类型: "协战",
                描述: "[仅在作为协战同伴登场时生效]\n自身和队友攻击提高。",
                字段: {
                    攻击提高: {
                        值: 0.4,
                    },
                },
            },
        ],
        溯源: [
            "释放[玛尔洁的可燃垃圾箱]移除[捡到宝了！]后，有30%的概率返还移除的[捡到宝了！]。",
            "释放[玛尔洁的万能寻宝铲]时，有12%概率对范围内的随机1个敌人额外造成1次伤害。",
            "[玛尔洁的万能寻宝铲]等级+2，[玛尔洁的回收储物袋]等级+1。",
            "[玛尔洁的可燃垃圾箱]残留的灰烬区域，持续时间延长至20秒。",
            "[玛尔洁的可燃垃圾箱]等级+2，[玛尔洁的回收储物袋]等级+1。",
            "[玛尔洁的可燃垃圾箱]造成伤害后，目标受到来自玛尔洁的伤害提高60%，持续5秒。",
        ],
    },
    {
        id: 4101,
        icon: "Lise",
        名称: "黎瑟",
        版本: "1.0",
        别名: "到灯塔去",
        阵营: "海伯利亚帝国",
        属性: "雷",
        精通: ["太刀", "突击枪"],
        标签: ["输出", "技能伤害"],
        基础攻击: 22,
        基础生命: 94,
        基础防御: 276,
        基础护盾: 94,
        基础神智: 150,
        加成: {
            攻击: 0.5,
            技能范围: 0.3,
        },
        技能: [
            {
                id: 410101,
                名称: "快速出击",
                类型: "伤害",
                描述: "向前方飞跃并对沿途敌人造成雷属性伤害，[电能]大于等于30时，消耗30[电能]提高飞跃速度及伤害倍率，并使自身获得造成伤害提高效果。",
                字段: {
                    神智消耗: {
                        影响: "技能效益",
                        值: 20,
                        格式: "{}",
                    },
                    伤害: {
                        影响: "技能威力",
                        值: [3.88, 4.74, 5.6, 6.46, 7.32, 8.18, 9.04, 9.9, 10.76, 11.62, 12.48, 13.34],
                    },
                    "消耗[电能]伤害倍率": {
                        影响: "技能威力",
                        值: [6.5, 7.93, 9.36, 10.79, 12.22, 13.65, 15.08, 16.51, 17.94, 19.37, 20.8, 22.23],
                    },
                    造成伤害提高: {
                        值: 0.9,
                    },
                    造成伤害提高效果持续时间: {
                        影响: "技能耐久",
                        值: 9,
                        格式: "{}秒",
                    },
                },
            },
            {
                id: 410102,
                名称: "涡旋电场",
                类型: "增益",
                描述: "对自身周围范围内敌人造成雷属性伤害并使自身进入[电场爆发]状态，期间持续消耗神智，神智下降为0或再次使用此技能时退出[电场爆发]状态。",
                字段: {
                    神智消耗: {
                        影响: "技能效益",
                        值: 10,
                        格式: "{}",
                    },
                    每秒神智消耗: {
                        影响: "技能效益,技能耐久",
                        值: 20,
                        格式: "{}",
                    },
                    伤害: {
                        影响: "技能威力",
                        值: [4.13, 5.06, 5.99, 6.92, 7.85, 8.78, 9.71, 10.64, 11.57, 12.5, 13.43, 14.36],
                    },
                    伤害半径: {
                        影响: "技能范围",
                        值: 10,
                        格式: "{}米",
                    },
                    效果半径: {
                        值: 0.5,
                        格式: "{%}米",
                    },
                    选取敌人伤害: {
                        影响: "技能威力",
                        值: [1.26, 1.55, 1.84, 2.13, 2.42, 2.71, 3, 3.29, 3.58, 3.87, 4.16, 4.45],
                    },
                    "[正电荷]效果半径": {
                        值: 0.2,
                        格式: "{%}米",
                    },
                    "[电荷]伤害": {
                        影响: "技能威力",
                        值: [12.43, 15.18, 17.93, 20.68, 23.43, 26.18, 28.93, 31.68, 34.43, 37.18, 39.93, 42.68],
                    },
                    移动速度提高: {
                        值: 0.25,
                    },
                    "[电荷]持续时间": {
                        影响: "技能耐久",
                        值: 6,
                        格式: "{}秒",
                    },
                },
                术语解释: {
                    电场爆发:
                        "自身和队友移动速度提高。每秒随机选取自身周围范围内的1名敌人造成雷属性伤害，并轮流附加[正电荷]和[负电荷]，优先选取没有[电荷]的敌人。",
                    电荷: "带有[正电荷]的目标，每3秒随机选取其周围范围内1名带有[负电荷]的目标，双方均被向位置中点吸聚，并受到雷属性伤害。如果范围内没有带有[负电荷]的目标，随机选取目标，双方均受到雷属性伤害。\n带有[电荷]的目标，被再次附加同种[电荷]时，刷新持续时间；无法被附加不同种[电荷]。",
                },
            },
            {
                id: 410103,
                名称: "战术节能",
                类型: "被动",
                描述: "自身消耗神智时，消耗量的一定比例转化为[电能]，[电能]上限与最大神智相等。",
                字段: {
                    转化比例: {
                        值: [0.37, 0.44, 0.51, 0.58, 0.65, 0.72, 0.79, 0.86, 0.93, 1, 1.07, 1.14],
                    },
                },
            },
            {
                id: 410104,
                名称: "电量焦虑",
                类型: "被动",
                描述: "自身消耗[电能]时，消耗量的50%转化为神智。",
            },
            {
                id: 410001,
                名称: "飞雷破夜",
                类型: "协战",
                描述: "[仅在作为协战同伴登场时生效]\n自身和雷属性队友攻击提高。",
                字段: {
                    攻击提高: {
                        值: 0.4,
                    },
                },
            },
        ],
        溯源: [
            "[电荷]造成的伤害变为半径3米的范围伤害。",
            "带有[电荷]的敌人被击败时，将[电荷]按照剩余时间传递给其周围20米内的其他目标。",
            "[快速出击]等级+2，[战术节能]等级+1。",
            "初始拥有50%自身最大神智的[电能]。",
            "[涡旋电场]等级+2，[战术节能]等级+1。",
            "[电场爆发]每秒选取的敌人的数量增加至2名。",
        ],
    },
    {
        id: 4102,
        icon: "Zhiliu",
        名称: "止流",
        版本: "1.2",
        别名: "利涉春江",
        阵营: "华胥",
        属性: "雷",
        精通: ["重剑", "双枪"],
        标签: ["输出", "技能伤害"],
        基础攻击: 24,
        基础生命: 80,
        基础防御: 252,
        基础护盾: 140,
        基础神智: 240,
        加成: {
            昂扬: 0.15,
            技能威力: 0.2,
        },
        技能: [
            {
                id: 410201,
                名称: "解天机",
                类型: "伤害",
                描述: "点按时，释放[解天机·震]。对面前范围内的敌人造成雷属性伤害，自身获得1枚[泉符·震]。\n长按时，释放[解天机·巽]。对周围范围内的敌人造成雷属性伤害，并为自身附加超限护盾，自身获得1枚[泉符·巽]。",
                字段: {
                    神智消耗: {
                        影响: "技能效益",
                        值: 15,
                        格式: "{}",
                    },
                    "[解天机·震]伤害": {
                        影响: "技能威力",
                        值: [2.1, 2.56, 3.02, 3.48, 3.94, 4.4, 4.86, 5.32, 5.78, 6.24, 6.7, 7.16],
                    },
                    "[解天机·震]伤害半径": {
                        影响: "技能范围",
                        值: 6,
                        格式: "{}米",
                    },
                    "[解天机·巽]伤害": {
                        影响: "技能威力",
                        值: [3.47, 4.24, 5.01, 5.78, 6.55, 7.32, 8.09, 8.86, 9.63, 10.4, 11.17, 11.94],
                    },
                    "[解天机·巽]伤害半径": {
                        影响: "技能范围",
                        值: 6,
                        格式: "{}米",
                    },
                    "[解天机·巽]超限护盾": {
                        影响: "技能威力",
                        值: 0.04,
                        格式: "{%}最大护盾",
                    },
                },
            },
            {
                id: 410202,
                名称: "天地演绎",
                类型: "伤害",
                描述: "自身[泉符]不足2枚时，对周围范围内的敌人造成雷属性伤害。\n自身持有2枚[泉符]时，根据持有的[泉符]的情况，此技能被替换为其他技能。",
                字段: {
                    "[天地演绎]神智消耗": {
                        影响: "技能效益",
                        值: 20,
                        格式: "{}",
                    },
                    "[震有声]神智消耗": {
                        影响: "技能效益",
                        值: 45,
                        格式: "{}",
                    },
                    "[万物生]神智消耗": {
                        影响: "技能效益",
                        值: 60,
                        格式: "{}",
                    },
                    "[天地明]神智消耗": {
                        影响: "技能效益",
                        值: 30,
                        格式: "{}",
                    },
                    "[天地演绎]伤害": {
                        影响: "技能威力",
                        值: [5.02, 6.15, 7.28, 8.41, 9.54, 10.67, 11.8, 12.93, 14.06, 15.19, 16.32, 17.45],
                    },
                    "[天地演绎]伤害半径": {
                        影响: "技能范围",
                        值: 10,
                        格式: "{}米",
                    },
                    "[震有声]伤害": {
                        影响: "技能威力",
                        值: [24.35, 29.75, 35.15, 40.55, 45.95, 51.35, 56.75, 62.15, 67.55, 72.95, 78.35, 83.75],
                    },
                    "[震有声]伤害范围": {
                        影响: "技能范围",
                        值: 12,
                        值2: 6,
                        格式: "{}米×{}米",
                    },
                    "[万物生]伤害": {
                        影响: "技能威力",
                        值: [6.3, 7.7, 9.1, 10.5, 11.9, 13.3, 14.7, 16.1, 17.5, 18.9, 20.3, 21.7],
                        值2: [18.93, 23.13, 27.33, 31.53, 35.73, 39.93, 44.13, 48.33, 52.53, 56.73, 60.93, 65.13],
                        格式: "{%}×3+{%}",
                    },
                    "[万物生]伤害半径": {
                        影响: "技能范围",
                        值: 10,
                        格式: "{}米",
                    },
                    "[雷风齐四方]领域半径": {
                        影响: "技能范围",
                        值: 20,
                        格式: "{}米",
                    },
                    "[雷风齐四方]领域持续时间": {
                        影响: "技能耐久",
                        值: 24,
                        格式: "{}秒",
                    },
                    "[雷风相与]伤害": {
                        影响: "技能威力",
                        值: [8.72, 10.66, 12.6, 14.54, 16.48, 18.42, 20.36, 22.3, 24.24, 26.18, 28.12, 30.06],
                    },
                    "[雷风相与]伤害半径": {
                        影响: "技能范围",
                        值: 6,
                        格式: "{}米",
                    },
                    "[天地明]伤害": {
                        影响: "技能威力",
                        值: [7.24, 8.86, 10.48, 12.1, 13.72, 15.34, 16.96, 18.58, 20.2, 21.82, 23.44, 25.06],
                    },
                    "[天地明]伤害半径": {
                        影响: "技能范围",
                        值: 6,
                        格式: "{}米",
                    },
                    "[天地明]技能伤害提高": {
                        值: [0.39, 0.48, 0.57, 0.66, 0.75, 0.84, 0.93, 1.02, 1.11, 1.2, 1.29, 1.38],
                    },
                    "[天地明]持续时间": {
                        影响: "技能耐久",
                        值: 24,
                        格式: "{}秒",
                    },
                },
                术语解释: {
                    震有声: "自身拥有2枚[泉符·震]时，[天地演绎]被替换为此技能。\n移除所有[泉符]。对前方直线范围内的敌人造成雷属性伤害。",
                    万物生: "自身拥有1枚[泉符·震]和1枚[泉符·巽]时，[天地演绎]被替换为此技能。\n移除所有[泉符]。连续对前方范围内的敌人造成伤害，之后在伤害位置留下1个[雷风齐四方]领域，每3秒选取领域范围内最多5名敌人，在其位置生成1道[雷风相与]：造成雷属性范围伤害。",
                    天地明: "自身拥有2枚[泉符·巽]时，[天地演绎]被替换为此技能。\n移除所有[泉符]。对周围范围内的敌人造成雷属性伤害，自身获得技能伤害提高效果。",
                },
            },
            {
                id: 410203,
                名称: "双泉并舞",
                类型: "被动",
                描述: "可以通过释放[解天机]获得[泉符]。自身最多持有2个[泉符]。当[泉符]数量溢出时，移除最早获得的1个[泉符]。\n释放[震有声][万物生][天地明]后移除[泉符]时，对每个[泉符]均有概率令其保留，概率基于自身近战武器的触发概率属性值。",
                字段: {
                    效果概率: {
                        值: [0.14, 0.18, 0.22, 0.26, 0.3, 0.34, 0.38, 0.42, 0.46, 0.5, 0.54, 0.58],
                        值2: 0.5,
                        格式: "{%}+{%}×近战武器触发概率",
                    },
                },
            },
            {
                id: 410204,
                名称: "相生",
                类型: "被动",
                描述: "自身和其他队友造成雷属性技能伤害时，自身获得1层昂扬提高效果，最多叠加20层。",
                字段: {
                    每层昂扬提高: {
                        值: 0.04,
                    },
                    持续时间: {
                        影响: "技能耐久",
                        值: 10,
                        格式: "{}秒",
                    },
                },
            },
            {
                id: 410003,
                名称: "神罚降下",
                类型: "协战",
                描述: "[仅在作为协战同伴登场时生效]\n自身和雷属性队友攻击提高。",
                字段: {
                    攻击提高: {
                        值: 0.5,
                    },
                },
            },
        ],
        溯源: [
            "释放[震有声]时，延长自身[天地明]的技能伤害提升效果3.5秒，并使[雷风齐四方]额外触发1次[雷风相与]效果，每道[雷风相与]造成原本60%的伤害。",
            "强化[万物生]，点按释放和长按释放获得不同的效果。点按释放[万物生]时，[雷风相与]效果选取敌人数量提升至8名；长按释放[万物生]时，[雷风齐四方]领域变为永续，持续期间每秒消耗6点神智，神智下降为0或释放任意技能、使用武器时移除雷风齐四方]领域。",
            "[解天机]等级+2，[双泉并舞]等级+1。",
            "释放[解天机]时，为自身和队友附加攻击提高30%，持续16秒。",
            "[天地演绎]等级+2，[双泉并舞]等级+1。",
            "自身处于[雷风齐四方]领域范围内时，全属性穿透提高55%。",
        ],
    },
    {
        id: 4201,
        icon: "Yuming",
        名称: "煜明",
        版本: "1.2",
        别名: "无罪囚徒",
        阵营: "华胥",
        属性: "雷",
        精通: ["长柄", "突击枪"],
        标签: ["输出", "技能伤害", "武器伤害"],
        基础攻击: 22,
        基础生命: 165,
        基础防御: 300,
        基础护盾: 50,
        基础神智: 200,
        加成: {
            攻击: 0.5,
            技能威力: 0.2,
        },
        技能: [
            {
                id: 420101,
                名称: "玉山崩",
                类型: "增益",
                描述: "自身跳跃至空中，滞空期间将下次近战武器的下落攻击替换为[疑星落]。\n如果在[玄蛟附身]状态中，获得1枚[逆鳞]。\n[逆鳞]达到最大枚数时，[疑星落]被强化为[星河寥落]。",
                字段: {
                    神智消耗: {
                        影响: "技能效益",
                        值: 18,
                        格式: "{}",
                    },
                    "[疑星落]伤害": {
                        值: [1.47, 1.8, 2.13, 2.46, 2.79, 3.12, 3.45, 3.78, 4.11, 4.44, 4.77, 5.1],
                    },
                    "[星河寥落]伤害": {
                        值: [4.9, 6, 7.1, 8.2, 9.3, 10.4, 11.5, 12.6, 13.7, 14.8, 15.9, 17],
                    },
                    "[疑星落][星河寥落]伤害半径": {
                        影响: "技能范围",
                        值: 6,
                        格式: "{}米",
                    },
                    "[奔雷]伤害": {
                        影响: "技能威力",
                        值: [0.86, 1.06, 1.26, 1.46, 1.66, 1.86, 2.06, 2.26, 2.46, 2.66, 2.86, 3.06],
                    },
                    "[奔雷]伤害半径": {
                        影响: "技能范围",
                        值: 6,
                        格式: "{}米",
                    },
                    造成伤害提高: {
                        值: [0.09, 0.12, 0.15, 0.18, 0.21, 0.24, 0.27, 0.3, 0.33, 0.36, 0.39, 0.42],
                    },
                    造成伤害提高效果持续时间: {
                        影响: "技能耐久",
                        值: 8,
                        格式: "{}秒",
                    },
                },
                术语解释: {
                    疑星落: "高速下落，落地时造成雷属性范围伤害。本次攻击视为近战武器的下落攻击。[玄蛟附身]状态中，额外触发[云从龙]。",
                    逆鳞: "永续，最多持有6枚，退出[玄蛟附身]状态时移除[逆鳞]。",
                    云从龙: "在受到[疑星落][星河寥落]伤害的目标处生成[奔雷]，造成雷属性范围伤害，最多选取5名目标。",
                    星河寥落:
                        "消耗所有[逆鳞]，为自身和队友附加造成伤害提高效果。\n随后高速下落，落地时造成雷属性范围伤害。本次攻击视为近战武器的下落攻击。[玄蛟附身]状态中，额外触发[云从龙]。",
                },
            },
            {
                id: 420102,
                名称: "濯暗鳞",
                类型: "增益",
                描述: "对面前敌人造成雷属性范围伤害，进入[玄蛟附身]状态。\n[玄蛟附身]状态中，自身和雷属性队友获得[鱼龙舞]。",
                字段: {
                    神智消耗: {
                        影响: "技能效益",
                        值: 100,
                        格式: "{}",
                    },
                    技能释放伤害: {
                        影响: "技能威力",
                        值: [3.59, 4.38, 5.17, 5.96, 6.75, 7.54, 8.33, 9.12, 9.91, 10.7, 11.49, 12.28],
                    },
                    技能释放伤害半径: {
                        影响: "技能范围",
                        值: 10,
                        格式: "{}米",
                    },
                    "[玄蛟附体]伤害": {
                        影响: "技能威力",
                        值: [1.47, 1.8, 2.13, 2.46, 2.79, 3.12, 3.45, 3.78, 4.11, 4.44, 4.77, 5.1],
                    },
                    "[玄蛟附体]最大吸收伤害": {
                        值: [0.37, 0.44, 0.51, 0.58, 0.65, 0.72, 0.79, 0.86, 0.93, 1, 1.07, 1.14],
                        格式: "{%}最大生命",
                    },
                    "[鱼龙舞]伤害": {
                        影响: "技能威力",
                        值: [4.43, 5.42, 6.41, 7.4, 8.39, 9.38, 10.37, 11.36, 12.35, 13.34, 14.33, 15.32],
                    },
                },
                术语解释: {
                    玄蛟附身:
                        "自身受到伤害时不会产生僵直，玄蛟环绕[煜明]盘旋，对碰撞到的敌人造成雷属性伤害，每2秒对同一目标最多造成1次伤害。\n[煜明]受到的生命值伤害时，玄蛟能吸收该次伤害。累计吸收[煜明]最大生命值一定比例的伤害后，[玄蛟附身]状态结束。",
                    鱼龙舞: "对带有[酣战]的目标造成技能伤害时，額外造成1次雷屬性傷害，每3秒对同一目标最多觸發1次。",
                },
            },
            {
                id: 420103,
                名称: "拂玄穹",
                类型: "被动",
                描述: "使用近战武器造成伤害时，对敌人附加[酣战]：雷属性抗性降低。\n[玄蛟附身]状态中，持续为全体敌人附加[酣战]。",
                字段: {
                    雷属性抗性降低: {
                        值: [0.052, 0.064, 0.076, 0.088, 0.1, 0.112, 0.124, 0.136, 0.148, 0.16, 0.172, 0.184],
                    },
                    "[酣战]持续时间": {
                        影响: "技能耐久",
                        值: 3,
                        格式: "{}秒",
                    },
                },
            },
            {
                id: 420104,
                名称: "听惊雷",
                类型: "被动",
                描述: "施放[濯暗鳞]时，获得6枚[逆鳞]。",
            },
            {
                id: 420191,
                名称: "连翩驰",
                类型: "协战",
                描述: "[仅在作为协战同伴登场时生效]\n自身和雷属性队友昂扬提高。",
                字段: {
                    昂扬提高: {
                        值: 0.15,
                    },
                },
            },
        ],
        溯源: [
            "[玄蛟附身]状态中，每次释放[玉山崩]时，额外获得1枚[逆鳞]。释放[星河寥落]时额外为自身和队友附加武器攻击范围提高0.6和技能范围提高30%的效果，持续8秒。",
            "[鱼龙舞]造成的伤害提高至原伤害的300%。",
            "[玉山崩]等级+2，[拂玄穹]等级+1。",
            "获得下落攻击追伤，数值为自身技能威力的18%，上限36%。",
            "[濯暗鳞]等级+2，[拂玄穹]等级+1。",
            "[疑星落][星河寥落]对带有[酣战]的目标造成伤害提高90%。释放[星河寥落]时回复[玄蛟]1.8%的可吸收伤害量。",
        ],
    },
    {
        id: 4202,
        icon: "Landi",
        名称: "兰迪",
        版本: "1.0",
        别名: "散漫愚者",
        阵营: "海伯利亚帝国",
        属性: "雷",
        精通: ["单手剑", "手枪"],
        标签: ["辅助", "防御", "护盾"],
        基础攻击: 14,
        基础生命: 105,
        基础防御: 510,
        基础护盾: 105,
        基础神智: 120,
        加成: {
            防御: 0.5,
            技能耐久: 0.15,
        },
        技能: [
            {
                id: 420201,
                名称: "正当怠工",
                类型: "防御",
                描述: "在自身身前持续展开[屏障]，并对周围敌人造成雷属性伤害。\n展开期间持续消耗神智，无法移动和使用武器，自身受到伤害时不会产生僵直，对周围敌人持续附加[过劳怨念]。\n再次使用此技能时收回[屏障]。",
                字段: {
                    神智消耗: {
                        影响: "技能效益",
                        值: 30,
                        格式: "{}",
                    },
                    每秒神智消耗: {
                        影响: "技能效益,技能耐久",
                        值: 5,
                        格式: "{}",
                    },
                    伤害: {
                        影响: "技能威力",
                        值: [0.42, 0.5, 0.58, 0.66, 0.74, 0.82, 0.9, 0.98, 1.06, 1.14, 1.22, 1.3],
                        值2: [17, 22, 27, 32, 37, 42, 47, 52, 57, 62, 67, 72],
                        格式: "{%}防御+{}",
                    },
                    效果半径: {
                        影响: "技能范围",
                        值: 10,
                        格式: "{}米",
                    },
                    攻击降低: {
                        值: 15,
                        格式: "{}%",
                    },
                    持续伤害: {
                        影响: "技能威力",
                        值: [0.23, 0.29, 0.35, 0.41, 0.47, 0.53, 0.59, 0.65, 0.71, 0.77, 0.83, 0.89],
                        格式: "{%}防御",
                    },
                },
                术语解释: {
                    屏障: "可以抵挡来自前方的投射物伤害并吸收其伤害，累计吸收[兰迪]最大生命值100%的伤害后[屏障]消失。",
                    过劳怨念: "攻击降低，每2秒受到雷属性持续伤害。",
                },
            },
            {
                id: 420202,
                名称: "特殊礼物",
                类型: "伤害",
                描述: "向前方投掷1枚[特制盾牌]，[特制盾牌]停止前进时造成1次[震撼]效果，并在持续时间内每隔3秒造成1次[震撼]效果。\n[震撼]基于自身防御造成只对护盾生效的伤害，同时为自身和队友附加基于自身防御的超限护盾，如果伤害目标护盾值已为0则麻痹目标。",
                字段: {
                    神智消耗: {
                        影响: "技能效益",
                        值: 30,
                        格式: "{}",
                    },
                    伤害: {
                        影响: "技能威力",
                        值: [1.19, 1.44, 1.69, 1.94, 2.19, 2.44, 2.69, 2.94, 3.19, 3.44, 3.69, 3.94],
                        值2: [30, 37, 44, 51, 58, 65, 72, 79, 86, 93, 100, 107],
                        格式: "{%}防御+{}",
                    },
                    附加超限护盾: {
                        影响: "技能威力",
                        值: [0.0037, 0.0044, 0.0051, 0.0058, 0.0065, 0.0072, 0.0079, 0.0086, 0.0093, 0.01, 0.0107, 0.0114],
                        值2: 10,
                        格式: "{%}防御+{}",
                    },
                    "[特制盾牌]持续时间": {
                        影响: "技能耐久",
                        值: 12,
                        格式: "{}",
                    },
                    麻痹持续时间: {
                        值: 2,
                        格式: "{}",
                    },
                    效果半径: {
                        影响: "技能范围",
                        值: 6,
                        格式: "{}米",
                    },
                },
            },
            {
                id: 420203,
                名称: "有盾同挡",
                类型: "被动",
                描述: "为队友附加超限护盾时，基于自身防御为目标附加1层防御提高，最多叠加10层。",
                字段: {
                    每层防御提高: {
                        值: [0.0037, 0.0044, 0.0051, 0.0058, 0.0065, 0.0072, 0.0079, 0.0086, 0.0093, 0.01, 0.0107, 0.0114],
                        格式: "{%}防御",
                    },
                    每层防御提高上限: {
                        值: 20,
                        格式: "{}",
                    },
                    持续时间: {
                        影响: "技能耐久",
                        值: 10,
                        格式: "{}",
                    },
                },
            },
            {
                id: 420204,
                名称: "合理休假",
                类型: "被动",
                描述: "每当[屏障]累计吸收[兰迪]最大生命70%的伤害时，消耗神智刷新[屏障]并造成1次[正当怠工]的屏障展开伤害。",
                字段: {
                    神智消耗: {
                        影响: "技能效益",
                        值: 20,
                        格式: "{}",
                    },
                },
            },
            {
                id: 100007,
                名称: "固守",
                类型: "协战",
                描述: "[仅在作为协战同伴登场时生效]\n自身和队友防御提高。",
                字段: {
                    防御提高: {
                        值: 0.4,
                    },
                },
            },
        ],
        溯源: [
            "[屏障]抵挡投射物吸收其伤害时，对伤害来源附加1层[过劳怨念]，持续3秒，仅此方式可叠加[过劳怨念]，最多叠加2层。",
            "基于自身等级，每级增加自身50点超限护盾上限。",
            "[正当怠工]等级+2，[有盾同挡]等级+1。",
            "[震撼]效果命中目标时，结算1次目标的[过劳怨念]伤害。",
            "[特殊礼物]等级+2，[有盾同挡]等级+1。",
            "[震撼]效果命中目标时，额外造成1次自身[护盾值+超限护盾值]1200%的雷属性伤害。",
        ],
    },
    {
        id: 4301,
        icon: "Xibi",
        名称: "西比尔",
        版本: "1.0",
        别名: "寒鸦",
        阵营: "海伯利亚帝国",
        属性: "雷",
        精通: ["鞭刃", "手枪"],
        标签: ["输出", "最大生命", "技能伤害"],
        基础攻击: 13,
        基础生命: 185,
        基础防御: 345,
        基础护盾: 120,
        基础神智: 200,
        加成: {
            生命: 0.5,
            技能威力: 0.2,
        },
        技能: [
            {
                id: 430101,
                名称: "夺神权柄",
                类型: "伤害",
                描述: "对面前范围内的敌人造成雷属性伤害，并在伤害位置生成[军团惩戒]领域。",
                字段: {
                    神智消耗: {
                        影响: "技能效益",
                        值: 30,
                        格式: "{}",
                    },
                    "[夺神权柄]伤害": {
                        影响: "技能威力",
                        值: [0.29, 0.36, 0.43, 0.5, 0.57, 0.64, 0.71, 0.78, 0.85, 0.92, 0.99, 1.06],
                        值2: [33, 41, 49, 57, 65, 73, 81, 89, 97, 105, 113, 121],
                        格式: "{%}最大生命+{}",
                    },
                    "[夺神权柄]伤害半径": {
                        影响: "技能范围",
                        值: 6,
                        格式: "{}米",
                    },
                    "[军团惩戒]伤害": {
                        影响: "技能威力",
                        值: [0.26, 0.31, 0.36, 0.41, 0.46, 0.51, 0.56, 0.61, 0.66, 0.71, 0.76, 0.81],
                        值2: [26, 32, 38, 44, 50, 56, 62, 68, 74, 80, 86, 92],
                        格式: "{%}最大生命+{}",
                    },
                    "[军团惩戒]领域半径": {
                        值: 6,
                        格式: "{}米",
                    },
                    "[万钧之势]消耗": {
                        值: 20,
                        格式: "{}",
                    },
                },
                术语解释: {
                    军团惩戒:
                        "生成1.5秒后，每0.4秒消耗一定量的[万钧之势]，对领域范围内的1名随机敌人造成雷属性伤害，最多持续10秒。[万钧之势]为0时，[军团惩戒]领域消失。[军团惩戒]领域最多同时存在3个。",
                },
            },
            {
                id: 430102,
                名称: "指尖风暴",
                类型: "召唤",
                描述: "召唤[召唤物·紊乱雷球]，同时最多存在1个。\n消耗[万钧之势]召唤强化的[召唤物·紊乱雷球]，强化的[召唤物·紊乱雷球]触发[灭顶风暴]的间隔降低为2秒，且链接伤害提升。",
                字段: {
                    神智消耗: {
                        影响: "技能效益",
                        值: 50,
                        格式: "{}",
                    },
                    持续时间: {
                        值: 30,
                        格式: "{}秒",
                    },
                    效果半径: {
                        影响: "技能范围",
                        值: 10,
                        格式: "{}米",
                    },
                    链接伤害: {
                        影响: "技能威力",
                        值: [0.025, 0.03, 0.035, 0.04, 0.045, 0.05, 0.055, 0.06, 0.065, 0.07, 0.075, 0.08],
                        值2: [6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17],
                        格式: "{%}最大生命+{}",
                    },
                    强化链接伤害: {
                        影响: "技能威力",
                        值: [0.051, 0.062, 0.073, 0.084, 0.095, 0.106, 0.117, 0.128, 0.139, 0.15, 0.161, 0.172],
                        值2: [8, 11, 14, 17, 20, 23, 26, 29, 32, 35, 38, 41],
                        格式: "{%}最大生命+{}",
                    },
                    伤害传递比例: {
                        值: 0.1,
                    },
                    伤害: {
                        影响: "技能威力",
                        值: [0.26, 0.32, 0.38, 0.44, 0.5, 0.56, 0.62, 0.68, 0.74, 0.8, 0.86, 0.92],
                        值2: [59, 73, 87, 101, 115, 129, 143, 157, 171, 185, 199, 213],
                        格式: "{%}最大生命+{}",
                    },
                    伤害半径: {
                        影响: "技能范围",
                        值: 10,
                        格式: "{}米",
                    },
                    "[万钧之势]消耗": {
                        值: 100,
                        格式: "{}",
                    },
                },
                术语解释: {
                    "召唤物·紊乱雷球":
                        "按一定比例继承召唤者的最大生命值，防御为0，被视为敌方单位。\n[召唤物·紊乱雷球]被召唤后，每3秒触发1次[灭顶风暴]。\n[召唤物·紊乱雷球]被召唤后，链接自身周围范围内最远的5名敌人，每秒额外链接1名敌人，同时最多可以链接10名敌人。[召唤物·紊乱雷球]对链接的目标每秒造成1次雷属性伤害。\n[召唤物·紊乱雷球]受到伤害时，将伤害按一定比例传递给被链接的目标。",
                    灭顶风暴: "对周围的敌人造成雷属性伤害。",
                },
            },
            {
                id: 430103,
                名称: "万钧之势",
                类型: "被动",
                描述: "造成的伤害触发额外效果时，获得一定量的[万钧之势]，最多可以拥有300点[万钧之势]。释放[夺神权柄]和[指尖风暴]时，可以消耗[万钧之势]强化对应技能。",
                字段: {
                    "[万钧之势]获取": {
                        值: [6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17],
                        格式: "{}",
                    },
                },
            },
            {
                id: 430104,
                名称: "黑云执掌",
                类型: "被动",
                描述: "[夺神权柄]和[军团惩戒]造成的伤害可以触发雷属性额外效果，触发概率基于自身近战武器的触发概率。",
                字段: {
                    触发概率的转化比例: {
                        值: 1,
                        格式: "{%}近战武器触发概率",
                    },
                },
            },
            {
                id: 410003,
                名称: "神罚降下",
                类型: "协战",
                描述: "[仅在作为协战同伴登场时生效]\n自身和雷属性队友攻击提高。",
                字段: {
                    攻击提高: {
                        值: 0.5,
                    },
                },
            },
        ],
        溯源: [
            "[召唤物·紊乱雷球]受到[夺神权柄]和[军团惩戒]的伤害时，伤害传递比例增加2%。",
            "[万钧之势]上限增加至600点，[军团惩戒]造成伤害时，每有1点[万钧之势]令[军团惩戒]的伤害提高0.1%；[召唤物·紊乱雷球]传递伤害时，每有1点[万钧之势]令[召唤物·紊乱雷球]传递伤害的比例增加0.01%。",
            "[夺神权柄]等级+2，[万钧之势]等级+1。",
            "[军团惩戒]每次造成伤害时，20%概率再触发一次。",
            "[指尖风暴]等级+2，[万钧之势]等级+1。",
            "[召唤物·紊乱雷球]链接敌人时，如果该目标为首次被链接，[西比尔]对目标额外造成1次[军团惩戒]伤害，倍率为原倍率的500%，且必定触发雷属性额外效果。",
        ],
    },
    {
        id: 5101,
        icon: "Songlu",
        名称: "松露与榛子",
        版本: "1.0",
        别名: "忙忙粮秣官",
        阵营: "艾利西安传颂会",
        属性: "风",
        精通: ["长柄", "弓"],
        标签: ["辅助", "最大生命", "治疗"],
        基础攻击: 12,
        基础生命: 185,
        基础防御: 310,
        基础护盾: 150,
        基础神智: 120,
        加成: {
            生命: 0.5,
            技能耐久: 0.15,
        },
        技能: [
            {
                id: 510101,
                名称: "蹄蹄小跑",
                类型: "伤害",
                描述: "命令[榛子]向前冲刺，对路径上的敌人造成风属性伤害，在撞到障碍物后造成风属性范围伤害。释放技能时，为自身和队友提供治疗，并附加造成伤害提高效果。\n骑乘[榛子]时，此技能被替换为[蹄蹄大冲撞]。",
                字段: {
                    神智消耗: {
                        影响: "技能效益",
                        值: 20,
                        格式: "{}",
                    },
                    路径伤害: {
                        影响: "技能威力",
                        值: [0.14, 0.18, 0.22, 0.26, 0.3, 0.34, 0.38, 0.42, 0.46, 0.5, 0.54, 0.58],
                        值2: [15, 19, 23, 27, 31, 35, 39, 43, 47, 51, 55, 59],
                        格式: "{%}最大生命+{}",
                    },
                    终点伤害: {
                        影响: "技能威力",
                        值: [1.19, 1.46, 1.73, 2, 2.27, 2.54, 2.81, 3.08, 3.35, 3.62, 3.89, 4.16],
                        值2: [125, 152, 179, 206, 233, 260, 287, 314, 341, 368, 395, 422],
                        格式: "{%}最大生命+{}",
                    },
                    终点伤害半径: {
                        影响: "技能范围",
                        值: 6,
                        格式: "{}米",
                    },
                    治疗: {
                        影响: "技能威力",
                        值: 0.016,
                        值2: 30,
                        格式: "{%}最大生命+{}",
                    },
                    造成伤害提高: {
                        值: [0.26, 0.33, 0.4, 0.47, 0.54, 0.61, 0.68, 0.75, 0.82, 0.89, 0.96, 1.03],
                    },
                    造成伤害提高效果持续时间: {
                        影响: "技能耐久",
                        值: 6,
                        格式: "{}秒",
                    },
                    每秒神智消耗: {
                        影响: "技能效益",
                        值: 6,
                        格式: "{}",
                    },
                },
                术语解释: {
                    蹄蹄大冲撞:
                        "长按技能，持续消耗神智并骑乘[榛子]持续进行冲刺，对路径上的敌人造成风属性伤害，在撞到障碍物后停止冲刺，造成风属性范围伤害。",
                },
            },
            {
                id: 510102,
                名称: "饱饱工作",
                类型: "增益",
                描述: "骑乘[榛子]，获得100点[工作热情]。骑乘中，自身的移动速度提高，移动时对路径上的敌人造成风属性伤害。\n骑乘期间，无法使用武器，可以指挥[榛子]执行攻击。再次使用此技能时，退出骑乘状态并释放1次[蹄蹄小跑]。",
                字段: {
                    神智消耗: {
                        影响: "技能效益",
                        值: 60,
                        格式: "{}",
                    },
                    路径伤害: {
                        影响: "技能威力",
                        值: [1.19, 1.46, 1.73, 2, 2.27, 2.54, 2.81, 3.08, 3.35, 3.62, 3.89, 4.16],
                        值2: [125, 152, 179, 206, 233, 260, 287, 314, 341, 368, 395, 422],
                        格式: "{%}最大生命+{}",
                    },
                    骑乘攻击一段伤害: {
                        影响: "技能威力",
                        值: [1.26, 1.55, 1.84, 2.13, 2.42, 2.71, 3, 3.29, 3.58, 3.87, 4.16, 4.45],
                        值2: [132, 161, 190, 219, 248, 277, 306, 335, 364, 393, 422, 451],
                        格式: "{%}最大生命+{}",
                    },
                    骑乘攻击二段伤害: {
                        影响: "技能威力",
                        值: [1.58, 1.93, 2.28, 2.63, 2.98, 3.33, 3.68, 4.03, 4.38, 4.73, 5.08, 5.43],
                        值2: [156, 192, 228, 264, 300, 336, 372, 408, 444, 480, 516, 552],
                        格式: "{%}最大生命+{}",
                    },
                    骑乘攻击下落伤害: {
                        影响: "技能威力",
                        值: [1.22, 1.5, 1.78, 2.06, 2.34, 2.62, 2.9, 3.18, 3.46, 3.74, 4.02, 4.3],
                        值2: [128, 156, 184, 212, 240, 268, 296, 324, 352, 380, 408, 436],
                        格式: "{%}最大生命+{}",
                    },
                },
                术语解释: {
                    工作热情:
                        "[工作热情]每秒下降5点，移动冲撞造成伤害时，回复1点。[蹄蹄大冲撞]技能持续期间，[工作热情]不会下降。当[工作热情]下降至0时，退出骑乘状态并释放1次[蹄蹄小跑]。",
                },
            },
            {
                id: 510103,
                名称: "忙忙粮秣官",
                类型: "被动",
                描述: "每保持移动1秒，获得1层[重磅人物]：造成的伤害提高，受到的伤害降低，最多叠加10层。",
                字段: {
                    每层造成的伤害提高: {
                        值: [0.037, 0.044, 0.051, 0.058, 0.065, 0.072, 0.079, 0.086, 0.093, 0.1, 0.107, 0.114],
                    },
                    每层受到的伤害降低: {
                        值: [0.0065, 0.008, 0.0095, 0.011, 0.0125, 0.014, 0.0155, 0.017, 0.0185, 0.02, 0.0215, 0.023],
                    },
                    持续时间: {
                        影响: "技能耐久",
                        值: 18,
                        格式: "{}秒",
                    },
                },
            },
            {
                id: 510106,
                名称: "连连补给",
                类型: "被动",
                描述: "造成技能伤害时，有概率生成1个[弹药补给箱]。",
                字段: {
                    效果概率: {
                        值: 0.1,
                    },
                },
            },
            {
                id: 510191,
                名称: "咕咕觅食",
                类型: "协战",
                描述: "[仅在作为协战同伴登场时生效]\n队内有2个或以上属性相同的角色时，自身和队友背水提高。",
                字段: {
                    背水提高: {
                        值: 0.05,
                    },
                },
            },
        ],
        溯源: [
            "[工作热情]下降速度降低50%。",
            "释放技能时，为队友附加攻击提高效果，数值为[松露]最大生命的3%，上限300，持续10秒。",
            "[蹄蹄小跑]等级+2，[忙忙粮秣官]等级+1。",
            "[重磅人物]最多叠加层数提高至20层，开始骑乘[榛子]时，获得20层[重磅人物]。",
            "[饱饱工作]等级+2，[忙忙粮秣官]等级+1。",
            "拾取[活化嗅盐][凝神露滴][弹药补给箱]后，自身获得1层技能威力提高45%，最多叠加3层，持续15秒。",
        ],
    },
    {
        id: 5102,
        icon: "Aote",
        名称: "奥特赛德",
        版本: "1.0",
        别名: "异乡人",
        阵营: "夜航者小队",
        属性: "风",
        精通: ["双刀", "双枪"],
        标签: ["输出", "武器伤害"],
        基础攻击: 20,
        基础生命: 85,
        基础防御: 285,
        基础护盾: 195,
        基础神智: 120,
        加成: {
            攻击: 0.5,
            技能耐久: 0.15,
        },
        技能: [
            {
                id: 510201,
                名称: "隐匿",
                类型: "增益",
                描述: "进入[匿踪]状态，并退出[追猎]状态。\n主动退出[匿踪]状态和在[匿踪]状态中再次释放[隐匿]时，生成2枚[獠牙之刺]攻击周围的随机敌人。",
                字段: {
                    神智消耗: {
                        影响: "技能效益",
                        值: 10,
                        格式: "{}",
                    },
                    "[匿踪]持续时间": {
                        影响: "技能耐久",
                        值: [7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18],
                        格式: "{}秒",
                    },
                },
                术语解释: {
                    匿踪: "[匿踪]状态中，无法被敌人发现，受到伤害时不会退出[匿踪]状态，发动攻击或释放[猎袭]时主动退出[匿踪]状态。",
                },
            },
            {
                id: 510202,
                名称: "猎袭",
                类型: "增益",
                描述: "收回所有[獠牙之刺]，进入[追猎]状态。\n每收回1枚[獠牙之刺]，流失一定生命，流失的生命转化为等量的超限护盾，并额外延长[追猎]的持续时间。由于此效果流失生命时，生命最低下降为1。",
                字段: {
                    神智消耗: {
                        影响: "技能效益",
                        值: 60,
                        格式: "{}",
                    },
                    "[追猎]持续时间": {
                        影响: "技能耐久",
                        值: 5,
                        格式: "{}秒",
                    },
                    "单枚[獠牙之刺]延长[追猎]持续时间": {
                        影响: "技能耐久",
                        值: 2,
                        格式: "{}秒",
                    },
                    "[追猎]持续时间延长上限": {
                        值: 50,
                        格式: "{}秒",
                    },
                    "单枚[獠牙之刺]流失生命": {
                        值: 0.1,
                        格式: "{%}最大生命",
                    },
                    攻击速度提高: {
                        值: [0.18, 0.21, 0.24, 0.27, 0.3, 0.33, 0.36, 0.39, 0.42, 0.45, 0.48, 0.51],
                    },
                    背水提高: {
                        值: [0.09, 0.1, 0.11, 0.12, 0.13, 0.14, 0.15, 0.16, 0.17, 0.18, 0.19, 0.2],
                    },
                },
                术语解释: {
                    追猎: "[追猎]状态中，自身受到伤害时不会产生僵直，并获得武器攻击速度和背水提高效果。追猎状态下无法受到治疗，治疗量转化为等量的超限护盾。",
                },
            },
            {
                id: 510203,
                名称: "以牙还牙",
                类型: "被动",
                描述: "受到伤害时，生成1枚[獠牙之刺]攻击伤害来源，效果每秒最多触发1次。",
                字段: {
                    "[断喉]受到来自[奥特赛德]的伤害提高": {
                        值: 0,
                    },
                    "[断喉]持续时间": {
                        影响: "技能耐久",
                        值: 15,
                        格式: "{}秒",
                    },
                    "[獠牙之刺]造成伤害": {
                        影响: "技能威力",
                        值: [6.75, 8.24, 9.73, 11.22, 12.71, 14.2, 15.69, 17.18, 18.67, 20.16, 21.65, 23.14],
                    },
                },
                术语解释: {
                    獠牙之刺:
                        "生成后飞向的目标，对路径上的敌人造成风属性伤害，并附加[断喉]：受到来自奥特赛德的伤害提高。飞行一段时间后下落至地面并停留。最多同时存在10枚。",
                },
            },
            {
                id: 510204,
                名称: "噬咬",
                类型: "被动",
                描述: "不处于[追猎]状态时，使用近战武器造成伤害时有概率生成1枚[獠牙之刺]攻击目标，效果每秒最多触发1次。",
                字段: {
                    效果概率: {
                        值: 0.2,
                    },
                },
            },
            {
                id: 510001,
                名称: "天空支配",
                类型: "协战",
                描述: "[仅在作为协战同伴登场时生效]\n自身和风属性队友攻击提高。",
                字段: {
                    攻击提高: {
                        值: 0.4,
                    },
                },
            },
        ],
        溯源: [
            "主动退出[匿踪]状态时，获得武器暴击率提高60%效果，持续24秒。",
            "[以牙还牙]和[噬咬]效果生成[獠牙之刺]时，有50%概率额外生成1枚。",
            "[隐匿]等级+2，[獠牙之刺]等级+1。",
            "[匿踪]状态中，移动速度提高35%。",
            "[猎袭]等级+2，[獠牙之刺]等级+1。",
            "[追猎]状态中，获得20%风属性追加伤害。",
        ],
    },
    {
        id: 5301,
        icon: "Saiqi",
        名称: "赛琪",
        版本: "1.0",
        别名: "茧的白昼梦",
        阵营: "无阵营",
        属性: "风",
        精通: ["长柄", "突击枪"],
        标签: ["输出", "同律武器", "武器伤害", "技能伤害"],
        基础攻击: 28,
        基础生命: 70,
        基础防御: 252,
        基础护盾: 140,
        基础神智: 150,
        加成: {
            背水: 0.05,
            技能威力: 0.2,
        },
        技能: [
            {
                id: 530101,
                名称: "抽茧成梦",
                类型: "伤害",
                描述: "向前突进，并在原地生成1个[幻象]。此技能可在任意时机释放，且不打断当前动作。[破茧]状态中，此技能被替换为[逐光]。",
                字段: {
                    神智消耗: {
                        影响: "技能效益",
                        值: 30,
                        格式: "{}",
                    },
                    "[幻象]速度降低": {
                        值: 0.2,
                    },
                    "[幻象]伤害": {
                        影响: "技能威力",
                        值: [0.681, 0.832, 0.983, 1.134, 1.285, 1.436, 1.587, 1.738, 1.889, 2.04, 2.191, 2.342],
                    },
                    "[幻象]效果半径": {
                        影响: "技能范围",
                        值: 6,
                        格式: "{}米",
                    },
                    "[浮光鳞粉]伤害": {
                        影响: "技能威力",
                        值: [0.424, 0.518, 0.612, 0.706, 0.8, 0.894, 0.988, 1.082, 1.176, 1.27, 1.364, 1.458],
                    },
                    "[鳞粉印记]触发伤害": {
                        影响: "技能威力",
                        值: [0.127, 0.154, 0.181, 0.208, 0.235, 0.262, 0.289, 0.316, 0.343, 0.37, 0.397, 0.424],
                    },
                    "[鳞粉印记]持续时间": {
                        影响: "技能耐久",
                        值: 10,
                        格式: "{}秒",
                    },
                },
                术语解释: {
                    幻象: "生成后，持续为周围的敌人附加移动速度降低效果，延迟5秒后，对周围的敌人造成1次风属性伤害后消失。生成[幻象]时，令场上已生成的[幻象]立即执行伤害效果并消失。",
                    逐光: "向前突进，发射16枚[浮光鳞粉]，[浮光鳞粉]在被发射后会自动锁定1个随机敌人，命中造成风属性伤害并附加1层[鳞粉印记]，最多叠加12层。",
                    鳞粉印记: "带有[鳞粉印记]的目标受到来自[赛琪]的远程武器伤害时，消耗1层[鳞粉印记]造成1次风属性伤害。",
                },
            },
            {
                id: 530102,
                名称: "腐草为萤",
                类型: "增益",
                描述: "进入[破茧]状态，获得飞行能力。[破茧]状态中只能使用技能和进行射击。[破茧]状态中持续消耗神智，神智下降为0或再次使用此技能时退出[破茧]状态。\n生命值百分比大于15%时，[破茧]状态中每秒流失生命，而不消耗神智。流失的生命按一定比例转化为超限护盾。",
                字段: {
                    神智消耗: {
                        影响: "技能效益",
                        值: 10,
                        格式: "{}",
                    },
                    每秒神智消耗: {
                        影响: "技能效益,技能耐久",
                        值: 30,
                        格式: "{}",
                    },
                    射击伤害: {
                        影响: "技能威力",
                        值: [0.664, 0.738, 0.812, 0.886, 0.96, 1.034, 1.108, 1.182, 1.256, 1.33, 1.404, 1.478],
                    },
                    射击伤害半径: {
                        影响: "技能范围",
                        值: 3,
                        格式: "{}米",
                    },
                    每秒流失生命值: {
                        值: 0.05,
                        格式: "{%}最大生命",
                    },
                    超限护盾转化比例: {
                        值: 1.5,
                    },
                },
            },
            {
                id: 530103,
                名称: "萤烛微光",
                类型: "被动",
                描述: "造成的伤害暴击时，随机获得攻击提高、技能威力提高、背水提高效果中1个。\n基于自身的增益效果的数量，提高造成的伤害，最多计算12个增益效果。",
                字段: {
                    攻击提高: {
                        值: [0.079, 0.098, 0.117, 0.136, 0.155, 0.174, 0.193, 0.212, 0.231, 0.25, 0.269, 0.288],
                    },
                    技能威力提高: {
                        值: [0.079, 0.098, 0.117, 0.136, 0.155, 0.174, 0.193, 0.212, 0.231, 0.25, 0.269, 0.288],
                    },
                    背水提高: {
                        值: [0.037, 0.044, 0.051, 0.058, 0.065, 0.072, 0.079, 0.086, 0.093, 0.1, 0.107, 0.114],
                    },
                    持续时间: {
                        影响: "技能耐久",
                        值: 10,
                        格式: "{}秒",
                    },
                    每个增益效果令造成的伤害提高: {
                        值: [0.012, 0.014, 0.016, 0.018, 0.02, 0.022, 0.024, 0.026, 0.028, 0.03, 0.032, 0.034],
                    },
                },
            },
            {
                id: 530104,
                名称: "譬如朝露",
                类型: "被动",
                描述: "释放[腐草为萤]时，如果自身生命值百分比大于等于75%，获得[譬如朝露]：计算昂扬和背水时，自身生命值百分比强制视为1%。该效果每120秒最多触发1次。",
                字段: {
                    持续时间: {
                        影响: "技能耐久",
                        值: 30,
                        格式: "{}秒",
                    },
                },
            },
            {
                id: 510003,
                名称: "欢宴风闻",
                类型: "协战",
                描述: "[仅在作为协战同伴登场时生效]\n自身和风属性队友攻击提高。",
                字段: {
                    攻击提高: {
                        值: 0.5,
                    },
                },
            },
        ],
        溯源: [
            "释放[抽茧成梦]和[逐光]时，回复自身10%的最大生命，并获得造成的伤害提高35%效果，持续12秒。",
            "[破茧]状态中，每5秒发射16枚[浮光鳞粉]；[浮光鳞粉]和[鳞粉印记]造成伤害时，有35%概率在目标处生成1个[幻象]。",
            "[抽茧成梦]等级+2，[萤烛微光]等级+1。",
            "[破茧]状态中自身获得[羽化]：受到伤害时不会产生僵直，受到的伤害降低25%，拾取范围增加15。",
            "[腐草为萤]等级+2，[萤烛微光]等级+1。",
            "[破茧]状态中自身全属性穿透提高50%。",
        ],
        同律武器: [
            {
                id: 530101,
                名称: "伊卡洛斯",
                类型: ["同律", "远程", "突击枪"],
                伤害类型: "贯穿",
                攻击: 5,
                暴击: 0.33,
                暴伤: 2,
                触发: 0.2,
            },
        ],
    },
    {
        id: 5401,
        icon: "Dafu",
        名称: "达芙涅",
        版本: "1.0",
        别名: "雨中人",
        阵营: "海伯利亚帝国",
        属性: "风",
        精通: ["鞭刃", "突击枪"],
        标签: ["辅助", "控制", "治疗"],
        基础攻击: 19,
        基础生命: 100,
        基础防御: 285,
        基础护盾: 100,
        基础神智: 160,
        加成: {
            攻击: 0.5,
            技能范围: 0.3,
        },
        技能: [
            {
                id: 540101,
                名称: "翠玉弥散",
                类型: "治疗",
                描述: "自身获得[翠玉弥散]效果。效果持续期间，自身周围范围被炼金烟雾弥漫，自身和队友持续回复生命，范围内的敌人被持续附加移动速度降低。\n[翠玉弥散]持续期间，每秒获得2发[阿佐特弹]。",
                字段: {
                    神智消耗: {
                        影响: "技能效益",
                        值: 50,
                        格式: "{}",
                    },
                    每秒持续回复生命值: {
                        影响: "技能威力",
                        值: [0.0024, 0.0028, 0.0032, 0.0036, 0.004, 0.0044, 0.0048, 0.0052, 0.0056, 0.006, 0.0064, 0.0068],
                        值2: 3,
                        格式: "{%}攻击+{}",
                    },
                    持续时间: {
                        影响: "技能耐久",
                        值: 15,
                        格式: "{}秒",
                    },
                    效果半径: {
                        影响: "技能范围",
                        值: 6,
                        格式: "{}米",
                    },
                },
            },
            {
                id: 540102,
                名称: "互斥炼成",
                类型: "增益",
                描述: "对自身和队友提供治疗并附加[净化配方]；对周围的敌人造成短暂束缚并附加[腐朽配方]。\n依据生效的友方及敌方目标数总和获得等量[阿佐特弹]，最多获得12发。",
                字段: {
                    神智消耗: {
                        影响: "技能效益",
                        值: 60,
                        格式: "{}",
                    },
                    治疗: {
                        影响: "技能威力",
                        值: [0.025, 0.03, 0.035, 0.04, 0.045, 0.05, 0.055, 0.06, 0.065, 0.07, 0.075, 0.08],
                        值2: 35,
                        格式: "{%}攻击+{}",
                    },
                    "[净化配方]持续时间": {
                        影响: "技能耐久",
                        值: 12,
                        格式: "{}秒",
                    },
                    追加伤害倍率: {
                        值: [0.066, 0.082, 0.098, 0.114, 0.13, 0.146, 0.162, 0.178, 0.194, 0.21, 0.226, 0.242],
                    },
                    对敌方效果半径: {
                        影响: "技能范围",
                        值: 10,
                        格式: "{}米",
                    },
                    "[腐朽配方]持续时间": {
                        影响: "技能耐久",
                        值: 12,
                        格式: "{}秒",
                    },
                    持续伤害: {
                        影响: "技能威力",
                        值: [0.43, 0.53, 0.63, 0.73, 0.83, 0.93, 1.03, 1.13, 1.23, 1.33, 1.43, 1.53],
                    },
                    攻击降低: {
                        值: 15,
                        格式: "{}%",
                    },
                    束缚持续时间: {
                        影响: "技能耐久",
                        值: 3,
                        格式: "{}秒",
                    },
                },
                术语解释: {
                    净化配方: "获得风属性追加伤害。",
                    腐朽配方: "攻击降低，每2秒受到风属性持续伤害。",
                },
            },
            {
                id: 540103,
                名称: "阿佐特弹",
                类型: "被动",
                描述: "持有[阿佐特弹]期间，自身远程武器的触发概率提高。[阿佐特弹]最多持有30发，每次远程武器射击时，消耗1发[阿佐特弹]。",
                字段: {
                    触发概率提高: {
                        值: [0.37, 0.44, 0.51, 0.58, 0.65, 0.72, 0.79, 0.86, 0.93, 1, 1.07, 1.14],
                    },
                },
            },
            {
                id: 540104,
                名称: "银泪销蚀",
                类型: "被动",
                描述: "持有[阿佐特弹]期间，远程武器造成伤害时额外结算1次目标的[腐朽配方]持续伤害。结算倍率基于自身远程武器触发概率。",
                字段: {
                    结算倍率: {
                        值: 0.1,
                        格式: "{%}远程武器触发概率",
                    },
                },
            },
            {
                id: 100009,
                名称: "奋激",
                类型: "协战",
                描述: "[仅在作为协战同伴登场时生效]\n自身和队友暴击率提高。",
                字段: {
                    暴击率提高: {
                        值: 0.4,
                    },
                },
            },
        ],
        溯源: [
            "[翠玉弥散]持续期间，自身和队友造成的伤害提高10%。",
            "[翠玉弥散]持续期间，每秒获得[阿佐特弹]增加至3发。",
            "[翠玉弥散]等级+2，[阿佐特弹]等级+1。",
            "每消耗1发[阿佐特弹]，自身回复1点神智。",
            "[互斥炼成]等级+2，[阿佐特弹]等级+1。",
            "带有[净化配方]的目标对带有[腐朽配方]的目标造成伤害时，获得1层伤害提高7%，持续12秒，最多叠加3层。该效果每秒最多触发1次。",
        ],
    },
] satisfies Char[] as Char[]

function patch(id: number, skillName: string, cb: (skill: Char["技能"][number]) => void) {
    const char = t.find((item) => item.id === id)
    if (!char) {
        return
    }
    const skill = char.技能.find((item) => item.名称 === skillName)
    if (!skill) {
        return
    }
    cb(skill)
}

patch(2101, "缠绵之触", (skill) => {
    skill.召唤物 = {
        名称: "召唤物·海月水母",
        攻击延迟: 2,
        攻击间隔: 1.8,
    }
})
patch(2401, "提挈浮沉", (skill) => {
    skill.召唤物 = {
        名称: "召唤物·云输",
        攻击延迟: 0,
        攻击间隔: 1,
    }
})
patch(2301, "正义群殴！", (skill) => {
    skill.召唤物 = {
        名称: "召唤物·触手",
        攻击延迟: 0,
        攻击间隔: 1.66667,
    }
})
patch(4301, "指尖风暴", (skill) => {
    skill.召唤物 = {
        名称: "召唤物·紊乱雷球",
        攻击延迟: 2,
        攻击间隔: 2,
    }
})

export default t
